package com.pkm.georgikafarmaka;

import java.util.ArrayList;
import java.util.List;

import android.content.ContentValues;
import android.content.Context;
import android.database.Cursor;
import android.database.sqlite.SQLiteDatabase;
import android.database.sqlite.SQLiteOpenHelper;

public class DbHelper extends SQLiteOpenHelper {
    private static final int DATABASE_VERSION = 2;
    // Database Name
    private static final String DATABASE_NAME = "triviaQuiz";
    // tasks table name
    private static final String TABLE_QUEST = "quest";
    private static final String TABLE_QUEST_2 = "quest_2";
    private static final String TABLE_QUEST_3 = "quest_3";
    private static final String TABLE_QUEST_4 = "quest_4";
    private static final String TABLE_QUEST_5 = "quest_5";
    private static final String TABLE_QUEST_6 = "quest_6";
    private static final String TABLE_QUEST_7 = "quest_7";
    private static final String TABLE_QUEST_8 = "quest_8";
    // tasks Table Columns names
    private static final String KEY_ID = "id";
    private static final String KEY_QUES = "question";
    private static final String KEY_ANSWER = "answer"; //correct option
    private static final String KEY_OPTA = "opta"; //option a
    private static final String KEY_OPTB = "optb"; //option b
    private static final String KEY_OPTC = "optc"; //option c
    private static final String KEY_OPTD = "optd"; //option d
    // tasks Table Columns names
    private static final String KEY_ID_2 = "id_2";
    private static final String KEY_QUES_2 = "question_2";
    private static final String KEY_ANSWER_2 = "answer_2"; //correct option
    private static final String KEY_OPTA_2 = "opta_2"; //option a
    private static final String KEY_OPTB_2 = "optb_2"; //option b
    private static final String KEY_OPTC_2 = "optc_2"; //option c
    private static final String KEY_OPTD_2 = "optd_2"; //option d
    // tasks Table Columns names
    private static final String KEY_ID_3 = "id_3";
    private static final String KEY_QUES_3 = "question_3";
    private static final String KEY_ANSWER_3 = "answer_3"; //correct option
    private static final String KEY_OPTA_3 = "opta_3"; //option a
    private static final String KEY_OPTB_3 = "optb_3"; //option b
    private static final String KEY_OPTC_3 = "optc_3"; //option c
    private static final String KEY_OPTD_3 = "optd_3"; //option d
    // tasks Table Columns names
    private static final String KEY_ID_4 = "id_4";
    private static final String KEY_QUES_4 = "question_4";
    private static final String KEY_ANSWER_4 = "answer_4"; //correct option
    private static final String KEY_OPTA_4 = "opta_4"; //option a
    private static final String KEY_OPTB_4 = "optb_4"; //option b
    private static final String KEY_OPTC_4 = "optc_4"; //option c
    private static final String KEY_OPTD_4 = "optd_4"; //option d
    // tasks Table Columns names
    private static final String KEY_ID_5 = "id_5";
    private static final String KEY_QUES_5 = "question_5";
    private static final String KEY_ANSWER_5 = "answer_5"; //correct option
    private static final String KEY_OPTA_5 = "opta_5"; //option a
    private static final String KEY_OPTB_5 = "optb_5"; //option b
    private static final String KEY_OPTC_5 = "optc_5"; //option c
    private static final String KEY_OPTD_5 = "optd_5"; //option d
    // tasks Table Columns names
    private static final String KEY_ID_6 = "id_6";
    private static final String KEY_QUES_6 = "question_6";
    private static final String KEY_ANSWER_6 = "answer_6"; //correct option
    private static final String KEY_OPTA_6 = "opta_6"; //option a
    private static final String KEY_OPTB_6 = "optb_6"; //option b
    private static final String KEY_OPTC_6 = "optc_6"; //option c
    private static final String KEY_OPTD_6 = "optd_6"; //option d
    // tasks Table Columns names
    private static final String KEY_ID_7 = "id_7";
    private static final String KEY_QUES_7 = "question_7";
    private static final String KEY_ANSWER_7 = "answer_7"; //correct option
    private static final String KEY_OPTA_7 = "opta_7"; //option a
    private static final String KEY_OPTB_7 = "optb_7"; //option b
    private static final String KEY_OPTC_7 = "optc_7"; //option c
    private static final String KEY_OPTD_7 = "optd_7"; //option d


    private SQLiteDatabase dbase;

    public DbHelper(Context context) {
        super(context, DATABASE_NAME, null, DATABASE_VERSION);
    }

    @Override
    public void onCreate(SQLiteDatabase db) {
        dbase = db;
        String sql = "CREATE TABLE IF NOT EXISTS " + TABLE_QUEST + " ( "
                + KEY_ID + " INTEGER PRIMARY KEY AUTOINCREMENT, " + KEY_QUES
                + " TEXT, " + KEY_ANSWER + " TEXT, " + KEY_OPTA + " TEXT, "
                + KEY_OPTB + " TEXT, " + KEY_OPTC + " TEXT, " + KEY_OPTD + " TEXT)";
        String sql_2 = "CREATE TABLE IF NOT EXISTS " + TABLE_QUEST_2 + " ( "
                + KEY_ID_2 + " INTEGER PRIMARY KEY AUTOINCREMENT, " + KEY_QUES_2
                + " TEXT, " + KEY_ANSWER_2 + " TEXT, " + KEY_OPTA_2 + " TEXT, "
                + KEY_OPTB_2 + " TEXT, " + KEY_OPTC_2 + " TEXT, " + KEY_OPTD_2 + " TEXT)";
        String sql_3 = "CREATE TABLE IF NOT EXISTS " + TABLE_QUEST_3 + " ( "
                + KEY_ID_3 + " INTEGER PRIMARY KEY AUTOINCREMENT, " + KEY_QUES_3
                + " TEXT, " + KEY_ANSWER_3 + " TEXT, " + KEY_OPTA_3 + " TEXT, "
                + KEY_OPTB_3 + " TEXT, " + KEY_OPTC_3 + " TEXT, " + KEY_OPTD_3 + " TEXT)";
        String sql_4 = "CREATE TABLE IF NOT EXISTS " + TABLE_QUEST_4 + " ( "
                + KEY_ID_4 + " INTEGER PRIMARY KEY AUTOINCREMENT, " + KEY_QUES_4
                + " TEXT, " + KEY_ANSWER_4 + " TEXT, " + KEY_OPTA_4 + " TEXT, "
                + KEY_OPTB_4 + " TEXT, " + KEY_OPTC_4 + " TEXT, " + KEY_OPTD_4 + " TEXT)";
        String sql_5 = "CREATE TABLE IF NOT EXISTS " + TABLE_QUEST_5 + " ( "
                + KEY_ID_5 + " INTEGER PRIMARY KEY AUTOINCREMENT, " + KEY_QUES_5
                + " TEXT, " + KEY_ANSWER_5 + " TEXT, " + KEY_OPTA_5 + " TEXT, "
                + KEY_OPTB_5 + " TEXT, " + KEY_OPTC_5 + " TEXT, " + KEY_OPTD_5 + " TEXT)";
        String sql_6 = "CREATE TABLE IF NOT EXISTS " + TABLE_QUEST_6 + " ( "
                + KEY_ID_6 + " INTEGER PRIMARY KEY AUTOINCREMENT, " + KEY_QUES_6
                + " TEXT, " + KEY_ANSWER_6 + " TEXT, " + KEY_OPTA_6 + " TEXT, "
                + KEY_OPTB_6 + " TEXT, " + KEY_OPTC_6 + " TEXT, " + KEY_OPTD_6 + " TEXT)";
        String sql_7 = "CREATE TABLE IF NOT EXISTS " + TABLE_QUEST_7 + " ( "
                + KEY_ID_7 + " INTEGER PRIMARY KEY AUTOINCREMENT, " + KEY_QUES_7
                + " TEXT, " + KEY_ANSWER_7 + " TEXT, " + KEY_OPTA_7 + " TEXT, "
                + KEY_OPTB_7 + " TEXT, " + KEY_OPTC_7 + " TEXT, " + KEY_OPTD_7 + " TEXT)";

        db.execSQL(sql);
        db.execSQL(sql_2);
        db.execSQL(sql_3);
        db.execSQL(sql_4);
        db.execSQL(sql_5);
        db.execSQL(sql_6);
        db.execSQL(sql_7);
        addQuestions();
        addQuestions_2();
        addQuestions_3();
        addQuestions_4();
        addQuestions_5();
        addQuestions_6();
        addQuestions_7();
        //db.close();
    }

    private void addQuestions() {
        Question q1 = new Question("Η ετικέτα του γεωργικού φαρμάκου, το οποίο επιτρέπεται να χρησιμοποιήσω στην καλλιέργειά μου:",
                "Γράφει τον αριθμό έγκρισης και ως " +
                        "παραδείγματα, μερικές από τις καλλιέργειες " +
                        "όπου επιτρέπεται η χρήση του.",
                "Αναγράφει αριθμό έγκρισης του Υπουργείου " +
                        "Αγροτικής Ανάπτυξης και Τροφίμων και την " +
                        "καλλιέργειά μου.",
                "Αναγράφει μόνο τον αριθμό έγκρισης. Δεν " +
                        "γράφει τίποτε για την δράση του και τις " +
                        "καλλιέργειες, αφού αυτά τα ξέρουν καλύτερα οι " +
                        "γεωπόνοι της κάθε περιοχής.",
                "Δεν αναγράφει αριθμό έγκρισης αλλά έχει " +
                        "δοκιμαστεί (ή έχουν γίνει πειράματα) στην περιοχή " +
                        "μου.",
                "Αναγράφει αριθμό έγκρισης του Υπουργείου " +
                        "Αγροτικής Ανάπτυξης και Τροφίμων και την " +
                        "καλλιέργειά μου.");
        this.addQuestion(q1);
        Question q2 = new Question("Ένα μυκητοκτόνο προϊόν είναι εγκεκριμένο για χρήση στην Ελλάδα, εάν:",
                "Έχει εγκριθεί η δραστική του ουσία από την " +
                        "Ευρωπαϊκή Ένωση.",
                "Τα μέγιστα ανεκτά υπολείμματά του (MRL) είναι " +
                        "ιδιαίτερα υψηλά, πχ. 10 ppm.",
                "Έχει χορηγηθεί -και συνεχίζει να ισχύει- άδεια " +
                        "διάθεσης στην ελληνική αγορά για το εν λόγω " +
                        "σκεύασμα.",
                "Η υπολειμματική του διάρκεια είναι μικρότερη από " +
                        "15 ημέρες.",
                "Έχει χορηγηθεί -και συνεχίζει να ισχύει- άδεια " +
                        "διάθεσης στην ελληνική αγορά για το εν λόγω " +
                        "σκεύασμα.");
        this.addQuestion(q2);
        Question q3 = new Question("Παραγωγός επισκέπτεται τη Βουλγαρία και προμηθεύεται εντομοκτόνα για τις καλλιέργειές του τα " +
                "οποία φέρνει στη χώρα μας. Τι ισχύει;",
                "Κανένα πρόβλημα. Είναι ελεύθερο το εμπόριο " +
                        "μεταξύ Κρατών Μελών.",
                "Εφόσον υπάρχει αντίστοιχο προϊόν εγκεκριμένο στην " +
                        "Ελλάδα είναι νόμιμο.",
                "Το προϊόν είναι παράνομο. Ο παραγωγός " +
                        "τιμωρείται με πρόστιμο, φυλάκιση και απώλεια " +
                        "επιδοτήσεων.",
                "Δεν είναι νόμιμο αλλά αφού είναι για δική του χρήση και " +
                        "όχι εμπορία δεν τιμωρείται από τον νόμο.",
                "Το προϊόν είναι παράνομο. Ο παραγωγός " +
                        "τιμωρείται με πρόστιμο, φυλάκιση και απώλεια " +
                        "επιδοτήσεων.");
        this.addQuestion(q3);
        Question q4 = new Question("Η καταγραφή της χρήσης των γεωργικών φαρμάκων",
                "Απαιτείται όταν η καλλιέργεια επιδοτείται.",
                "Απαιτείται όταν έχει προηγούμενα διαπιστωθεί " +
                        "παράβαση.",
                "Απαιτείται όταν τα φυτικά προϊόντα " +
                        "προορίζονται για εξαγωγή.",
                "Απαιτείται πάντα.",
                "Απαιτείται πάντα.");
        this.addQuestion(q4);
        Question q5 = new Question("Σε περίπτωση ψεκασμού γεωργικών φαρμάκων με χρήση πτυσσόμενης ράμπας, ο χειριστής του " +
                "τρακτέρ:",
                "Οφείλει να οδηγεί πάντα κόντρα στον άνεμο " +
                        "για να μην εισπνέει το ψεκαστικό υγρό.",
                "Οφείλει να φορά τα προστατευτικά μέσα που " +
                        "αναφέρονται στην ετικέτα του γεωργικού φαρμάκου.",
                "Οφείλει να φορά μόνο μάσκα προσώπου.",
                "Οφείλει να φορά πλήρη στολή (μάσκα, μπότες, γάντια " +
                        "κλπ).",
                "Οφείλει να φορά τα προστατευτικά μέσα που " +
                        "αναφέρονται στην ετικέτα του γεωργικού φαρμάκου.");
        this.addQuestion(q5);
        Question q6 = new Question("Η μετάγγιση γεωργικών φαρμάκων από την αρχική συσκευασία σε άλλα μικρότερα δοχεία:",
                "Προτείνεται.",
                "Απαγορεύεται.",
                "Επιβάλλεται .",
                "Επιτρέπεται μόνο αν γίνεται παρουσία ειδικού " +
                        "επιστήμονα.",
                "Απαγορεύεται.");
        this.addQuestion(q6);
        Question q7 = new Question("Ένα ψεκαστικό μηχάνημα που παρουσιάζει διαρροές:",
                "Δεν αποτελεί κίνδυνο αν η διαρροή είναι μικρή.",
                "Αποτελεί άμεσο κίνδυνο και δεν πρέπει να " +
                        "χρησιμοποιείται έως ότου επισκευαστεί.",
                "Πρέπει να γεμίζεται με περισσότερο ψεκαστικό " +
                        "υγρό",
                "Χρησιμοποιείται αν ο χρήστης φοράει αδιάβροχη " +
                        "φόρμα.",
                "Αποτελεί άμεσο κίνδυνο και δεν πρέπει να " +
                        "χρησιμοποιείται έως ότου επισκευαστεί.");
        this.addQuestion(q7);
        Question q8 = new Question("Δεν επιτρέπεται η πρόσβαση στην καλλιέργεια όπου έγινε ψεκασμός γεωργικού φαρμάκου",
                "Για 24 ώρες μετά τον ψεκασμό.",
                "Πριν περάσει χρόνος ίσος με το διάστημα αναμονής " +
                        "προ της συγκομιδής που αναγράφεται στην ετικέτα.",
                "Μέχρι να ολοκληρωθεί ο ψεκασμός.",
                "Πριν στεγνώσει το ψεκαστικό υγρό",
                "Πριν στεγνώσει το ψεκαστικό υγρό");
        this.addQuestion(q8);
        Question q9 = new Question("Ο χώρος αποθήκευσης των γεωργικών φαρμάκων πρέπει να είναι καλά αεριζόμενος γιατί:",
                "Με αυτόν τον τρόπο διατηρούνται πέρα από την " +
                        "διάρκεια που γράφει η ετικέτα.",
                "Έτσι αποφεύγεται η εξασθένισή τους.",
                "Έτσι αποφεύγεται η εισπνοή τους όταν ανοίγει την " +
                        "αποθήκη.",
                "Έτσι ανεβαίνει η θερμοκρασία της αποθήκης.",
                "Έτσι αποφεύγεται η εισπνοή τους όταν ανοίγει την " +
                        "αποθήκη.");
        this.addQuestion(q9);
        Question q10 = new Question("Ποια από τα παρακάτω δεν είναι ασφαλείς εργασιακές πρακτικές;",
                "Να ψεκάζουμε κόντρα στον άνεμο με επινώτιους " +
                        "ψεκαστήρες.",
                "Να καπνίζουμε κατά τη διάρκεια του ψεκασμού.",
                "Να αποφράζουμε τα μπεκ (ακροφύσια) φυσώντας " +
                        "με το στόμα.",
                "Όλες οι άλλες απαντήσεις.",
                "Όλες οι άλλες απαντήσεις.");
        this.addQuestion(q10);
        Question q11 = new Question("Τα μέσα προστασίας, όπως γάντια και ρούχα (αν δεν είναι μίας χρήσεως) που χρησιμοποιήθηκαν " +
                "κατά την εφαρμογή ενός γεωργικού φαρμάκου πρέπει να πλένονται:",
                "Καθημερινά.",
                "Μία φορά την εβδομάδα.",
                "Αμέσως μετά τον ψεκασμό",
                "Ποτέ. Πρέπει να αντικαθίστανται τακτικά.",
                "Αμέσως μετά τον ψεκασμό");
        this.addQuestion(q11);
        Question q12 = new Question("Ο ψεκαστήρας πρέπει να πλένεται:",
                "Αμέσως μετά από κάθε εφαρμογή του.",
                "Μόνο όταν ψεκάσουμε με γεωργικό φάρμακο που " +
                        "μπορεί να τον καταστρέψει.",
                "Μόνο εάν χρησιμοποιήθηκαν τοξικά γεωργικά " +
                        "φάρμακα.",
                "Μόνο όταν παρουσιάζει διαρροές.",
                "Αμέσως μετά από κάθε εφαρμογή του.");
        this.addQuestion(q12);
        Question q13 = new Question("Όταν το έδαφος είναι πολύ αμμώδες, υπάρχει κίνδυνος:",
                "Να ξεπλυθεί ένα ζιζανιοκτόνο και να φτάσει σε " +
                        "υπόγεια νερά.",
                "Να αλλάξει δομή το έδαφος από τα ζιζανιοκτόνα που " +
                        "ψεκάζονται.",
                "Να δεσμευτεί και να μη δράσει ένα " +
                        "ζιζανιοκτόνο.",
                "Να μη δράσει ένα ζιζανιοκτόνο.",
                "Να ξεπλυθεί ένα ζιζανιοκτόνο και να φτάσει σε " +
                        "υπόγεια νερά.");
        this.addQuestion(q13);
        Question q14 = new Question("Εάν αναμένεται βροχή, τότε ο ψεκασμός…",
                "Πρέπει να γίνει άμεσα, πριν ξεκινήσει η βροχή.",
                "Αναβάλλεται μέχρι να μην προβλέπεται βροχή για 48 " +
                        "ώρες.",
                "Αναβάλλεται μέχρι να μην προβλέπεται βροχή " +
                        "για 24 ώρες.",
                "Αναβάλλεται μέχρι να μην προβλέπεται βροχή για 6-8 " +
                        "ώρες.",
                "Αναβάλλεται μέχρι να μην προβλέπεται βροχή για 6-8 " +
                        "ώρες.");
        this.addQuestion(q14);
        Question q15 = new Question("Αν σε περίπτωση ατυχήματος, χυθεί πάνω στο δέρμα γεωργικό φάρμακο και ιδιαίτερα αν είναι πυκνό, " +
                "τότε:",
                "Διαβάζουμε την ετικέτα του γεωργικού " +
                        "φαρμάκου και εφόσον είναι τοξικό σε " +
                        "περίπτωση επαφής με το δέρμα, " +
                        "πλένουμε καλά το δέρμα.",
                "Πλένουμε καλά το δέρμα και διαβάζουμε την ετικέτα του " +
                        "γεωργικού φαρμάκου για επιπρόσθετες οδηγίες.",
                "Κρατώντας την ετικέτα του γεωργικού " +
                        "φαρμάκου επισκεπτόμαστε γιατρό.",
                "Κρατώντας την ετικέτα του γεωργικού φαρμάκου " +
                        "επικοινωνούμε με το Κέντρο Δηλητηριάσεων.",
                "Πλένουμε καλά το δέρμα και διαβάζουμε την ετικέτα του " +
                        "γεωργικού φαρμάκου για επιπρόσθετες οδηγίες.");
        this.addQuestion(q15);
        Question q16 = new Question("Το τηλέφωνο του Κέντρου Δηλητηριάσεων είναι:",
                "166",
                "Το τοπικό Κέντρο Υγείας.",
                "210-77.93.777",
                "Διαθέσιμο από κάθε τοπικό παθολόγο.",
                "210-77.93.777");
        this.addQuestion(q16);
        Question q17 = new Question("Διασυστηματικό εντομοκτόνο είναι αυτό που…",
                "Εφαρμόζεται μετά το φύτρωμα της καλλιέργειας " +
                        "για καταπολέμηση όλων των εντόμων που " +
                        "προσβάλλουν την καλλιέργεια.",
                "Απορροφάται από τα φυτά και μπορεί να " +
                        "καταπολεμήσει τα έντομα που αναφέρονται στην " +
                        "ετικέτα του",
                "Απορροφάται από τα φυτά και μπορεί να " +
                        "καταπολεμήσει ακόμη και τα έντομα που " +
                        "προσβάλλουν την επόμενη καλλιέργεια",
                "Εφαρμόζεται μετά το φύτρωμα της καλλιέργειας για " +
                        "καταπολέμηση όλων των εντόμων που προσβάλλουν " +
                        "την καλλιέργεια.",
                "Απορροφάται από τα φυτά και μπορεί να " +
                        "καταπολεμήσει τα έντομα που αναφέρονται στην " +
                        "ετικέτα του");
        this.addQuestion(q17);
        Question q18 = new Question("Μεταφυτρωτικό εκλεκτικό ζιζανιοκτόνο είναι αυτό που…",
                "Έχει εγκριθεί μέσα από διασυστηματική " +
                        "εξέταση.",
                "Μπορεί να καταπολεμήσει εχθρούς και ασθένειες σε όλο το " +
                        "φυτό.",
                "Πρέπει να εφαρμόζεται από όλους τους " +
                        "αγρότες μιας περιοχής για να δράσει.",
                "Μετά την εφαρμογή του καταστρέφει συγκεκριμένα ζιζάνια " +
                        "και όχι την καλλιέργεια που εφαρμόζεται",
                "Μετά την εφαρμογή του καταστρέφει συγκεκριμένα ζιζάνια " +
                        "και όχι την καλλιέργεια που εφαρμόζεται");
        this.addQuestion(q18);
        Question q19 = new Question("Αμειψισπορά είναι…",
                "Η εναλλαγή διαφορετικών γεωργικών " +
                        "φαρμάκων στο ίδιο χωράφι",
                "Η εναλλαγή διαφορετικών καλλιεργειών στο ίδιο χωράφι",
                "Η εναλλαγή διαφορετικών ποικιλιών μιας " +
                        "καλλιέργειας στο ίδιο χωράφι.",
                "Η εναλλαγή βιολογικής και ολοκληρωμένης " +
                        "φυτοπροστασίας στο ίδιο χωράφι.",
                "Η εναλλαγή διαφορετικών καλλιεργειών στο ίδιο χωράφι");
        this.addQuestion(q19);
        Question q20 = new Question("Ποια από τις παρακάτω επιλογές αποτελεί τεχνική ολοκληρωμένης φυτοπροστασίας;",
                "Επαναλαμβανόμενος ψεκασμός με " +
                        "ζιζανιοκτόνα.",
                "Όψιμη φύτευση αφού φυτρώσουν τα ζιζάνια.",
                "Πρώιμη φύτευση πριν φυτρώσουν τα " +
                        "ζιζάνια.",
                "Αραιή φύτευση σε σημεία που δεν φυτρώνουν ζιζάνια.",
                "Πρώιμη φύτευση πριν φυτρώσουν τα " +
                        "ζιζάνια.");
        this.addQuestion(q20);
        Question q21 = new Question("Ποια από τις παρακάτω επιλογές αποτελεί τεχνική ολοκληρωμένης φυτοπροστασίας;",
                "Συγκαλλιέργεια με εδαφοκάλυψη και " +
                        "χημική απολύμανση εδάφους.",
                "Συγκαλλιέργεια χωρίς εδαφοκάλυψη και χημική " +
                        "απολύμανση εδάφους.",
                "Συγκαλλιέργεια και χημική απολύμανση " +
                        "εδάφους.",
                "Συγκαλλιέργεια με εδαφοκάλυψη.",
                "Συγκαλλιέργεια με εδαφοκάλυψη.");
        this.addQuestion(q21);
        Question q22 = new Question("Η μετάδοση επιβλαβών (φυτοπαθογόνων) οργανισμών από τα χρησιμοποιούμενα μηχανήματα και " +
                "τον εξοπλισμό γίνεται όταν:",
                "Είναι παλαιά.",
                "Δεν καθαρίζονται τακτικά.",
                "Είναι καινούρια.",
                "Δεν ρυθμίζονται σωστά τα μπεκ.",
                "Δεν καθαρίζονται τακτικά.");
        this.addQuestion(q22);
        Question q23 = new Question("Οι ανθεκτικές ποικιλίες φυτών, πρέπει να προτιμούνται:",
                "Μόνο εφόσον υπάρχει σχετική εντολή " +
                        "από τις αρμόδιες αρχές.",
                "Μόνο εφόσον επιδοτούνται.",
                "Μόνο εφόσον υπάρχει σε έξαρση μια " +
                        "ασθένεια.",
                "Πάντα, εφόσον βοηθούν στην προληπτική αντιμετώπιση " +
                        "του παθογόνου.",
                "Πάντα, εφόσον βοηθούν στην προληπτική αντιμετώπιση " +
                        "του παθογόνου.");
        this.addQuestion(q23);
        Question q24 = new Question("Για να προστατέψω ένα ωφέλιμο έντομο στο χωράφι μου…",
                "Εφαρμόζω μέτρα βιολογικού ελέγχου και αν " +
                        "χρειαστεί γεωργικά φάρμακα, που σύμφωνα με " +
                        "τις συμβουλές του γεωπόνου δεν επηρεάζουν " +
                        "την ανάπτυξή του.",
                "Δεν ψεκάζω ποτέ με ζιζανιοκτόνα.",
                "Δεν χρησιμοποιώ χημικά λιπάσματα.",
                "Δεν ψεκάζω με υψηλή θερμοκρασία.",
                "Εφαρμόζω μέτρα βιολογικού ελέγχου και αν " +
                        "χρειαστεί γεωργικά φάρμακα, που σύμφωνα με " +
                        "τις συμβουλές του γεωπόνου δεν επηρεάζουν " +
                        "την ανάπτυξή του.");
        this.addQuestion(q24);
        Question q25 = new Question("Με τις παγίδες με κόλλα μπορώ:",
                "Να παρακολουθώ αν έχει γίνει σωστός " +
                        "ψεκασμός ενός γεωργικού φαρμάκου.",
                "Να παρακολουθώ αν έβρεξε.",
                "Να ελέγχω την κατάσταση του χωραφιού μου.",
                "Να παρακολουθώ τον πληθυσμό επιβλαβών εντόμων.",
                "Να παρακολουθώ τον πληθυσμό επιβλαβών εντόμων.");
        this.addQuestion(q25);
        Question q26 = new Question("Με σκοπό την αποφυγή μολύνσεων του ξύλου μετά το κλάδεμα των δένδρων…",
                "Γίνεται προληπτικός ψεκασμός του δένδρου με " +
                        "μυκητοκτόνα πριν το κλάδεμα.",
                "Μεσαίες και μεγάλες τομές καλύπτονται με ειδικό " +
                        "επουλωτικό πληγών.",
                "Διατηρείται στρώμα από ζιζάνια στο έδαφος " +
                        "κάτω από το δένδρο.",
                "Ο κλαδευτής των δένδρων φορά ειδικά γάντια.",
                "Μεσαίες και μεγάλες τομές καλύπτονται με ειδικό " +
                        "επουλωτικό πληγών.");
        this.addQuestion(q26);
        Question q27 = new Question("Αν πρέπει να διαλέξω μεταξύ ενός εντομοκτόνου που μπορεί να καταπολεμήσει πολλά έντομα κι ενός " +
                "ειδικού για το έντομο που προσβάλλει την καλλιέργειά μου, επιλέγω",
                "Το εντομοκτόνο που καταπολεμά πολλά " +
                        "έντομα.",
                "Το εντομοκτόνο που καταπολεμά μόνο το έντομο που " +
                        "προσβάλλει την καλλιέργειά μου.",
                "Κανένα από τα δύο.",
                "Και τα δύο, εφαρμόζοντάς τα μία φορά το ένα και μία φορά " +
                        "το άλλο.",
                "Το εντομοκτόνο που καταπολεμά μόνο το έντομο που " +
                        "προσβάλλει την καλλιέργειά μου.");
        this.addQuestion(q27);
        Question q28 = new Question("Τι είναι τα μπεκ μειωμένης διασποράς;",
                "Μπεκ που χρησιμοποιούνται μόνο σε δενδρώδεις " +
                        "καλλιέργειες.",
                "Μπεκ που χρησιμοποιούνται μόνο σε μεγάλες " +
                        "καλλιέργειες.",
                "Μπεκ που μειώνουν τη διασπορά του ψεκαστικού " +
                        "υγρού.",
                "Μπεκ που διασπείρονται στο χωράφι σε μειωμένο " +
                        "αριθμό.",
                "Μπεκ που μειώνουν τη διασπορά του ψεκαστικού " +
                        "υγρού.");
        this.addQuestion(q28);
        Question q29 = new Question("Χαμηλή πίεση ψεκασμού χρησιμοποιείται:",
                "Σε εντομοκτόνα.",
                "Σε όλα τα φάρμακα για οικονομία ψεκαστικού υγρού.",
                "Στα ζιζανιοκτόνα.",
                "Στα διασυστηματικά μυκητοκτόνα.",
                "Στα ζιζανιοκτόνα.");
        this.addQuestion(q29);
        Question q30 = new Question("Με τη ρύθμιση του εξοπλισμού εφαρμογής γεωργικών φαρμάκων (βαθμονόμηση) επιτυγχάνουμε:",
                "Ελάχιστες επιπτώσεις στο περιβάλλον",
                "Οικονομία στο φάρμακο",
                "Οικονομία στο φάρμακο, ελάχιστες " +
                        "επιπτώσεις στο περιβάλλον και στον εαυτό " +
                        "μας και αποτελεσματική εφαρμογή.",
                "Αποτελεσματική εφαρμογή.",
                "Οικονομία στο φάρμακο, ελάχιστες " +
                        "επιπτώσεις στο περιβάλλον και στον εαυτό " +
                        "μας και αποτελεσματική εφαρμογή.");
        this.addQuestion(q30);
        Question q31 = new Question("Δεν υπάρχει κίνδυνος δηλητηρίασης διερχόμενων ζώων, εφόσον",
                "Το πλύσιμο του βυτίου γίνεται στο χωράφι.",
                "Τα χρησιμοποιούμενα γεωργικά φάρμακα δεν είναι " +
                        "δηλητήρια.",
                "Υπάρχουν διαρροές από το ψεκαστικό " +
                        "μηχάνημα.",
                "Μετά τον ψεκασμό σταματάει αμέσως η λειτουργία των " +
                        "μπεκ .",
                "Μετά τον ψεκασμό σταματάει αμέσως η λειτουργία των " +
                        "μπεκ .");
        this.addQuestion(q31);
        Question q32 = new Question("Με τη σωστή συντήρηση του εξοπλισμού εφαρμογής γεωργικών φαρμάκων επιτυγχάνεται:",
                "Μεγάλη μείωση του κόστους " +
                        "καταπολέμησης.",
                "Διατήρηση του χρώματος της δεξαμενής για " +
                        "μεγαλύτερο χρονικό διάστημα.",
                "Μεταφορά των σταγονιδίων ψεκαστικού " +
                        "υγρού σε μεγαλύτερες αποστάσεις.",
                "Η ελάχιστη δυνατή ανάδευση του ψεκαστικού υγρού " +
                        "στη δεξαμενή.",
                "Μεγάλη μείωση του κόστους " +
                        "καταπολέμησης.");
        this.addQuestion(q32);
        Question q33 = new Question("Η προετοιμασία του εξοπλισμού εφαρμογής γεωργικών φαρμάκων για την επόμενη χρήση " +
                "περιλαμβάνει :",
                "Πλύση της δεξαμενής ψεκαστικού υγρού και " +
                        "των λοιπών συστημάτων (αντλία, φίλτρα, " +
                        "σωληνώσεις κ.ο.κ) και ψεκασμός αυτού σε " +
                        "κατάλληλη έκταση μακριά από επιφανειακά " +
                        "νερά.",
                "Υπολογισμός της ταχύτητας του ελκυστήρα για την " +
                        "εφαρμογή του ψεκαστικού υγρού, σε συνάρτηση με " +
                        "τον όγκο του ψεκαστικού υγρού και την παροχή των " +
                        "ακροφυσίων (βαθμονόμηση).",
                "Οπτικός έλεγχος για πιθανά σημεία " +
                        "διαρροών (δεξαμενή, σωληνώσεις, αντλία " +
                        "κλπ), για τυχόν φθορές και για την ύπαρξη " +
                        "προφυλακτήρων στο σύστημα μετάδοσης " +
                        "κίνησης.",
                "Το σύνολο των αναφερομένων στις άλλες απαντήσεις " +
                        "ενεργειών.",
                "Το σύνολο των αναφερομένων στις άλλες απαντήσεις " +
                        "ενεργειών.");
        this.addQuestion(q33);
        Question q34 = new Question("Η βαθμονόμηση του εξοπλισμού εφαρμογής γεωργικών φαρμάκων:",
                "Είναι η απαραίτητη προετοιμασία πριν από " +
                        "κάθε εφαρμογή γεωργικού φαρμάκου, για " +
                        "την ελαχιστοποίηση των κινδύνων στην " +
                        "καλλιέργεια, στον χρήστη, στο περιβάλλον.",
                "Είναι σημαντική για να εξασφαλιστεί μια " +
                        "στοχοθετημένη χρήση των γεωργικών φαρμάκων και " +
                        "για να επιτευχθεί το βέλτιστο αποτέλεσμα.",
                "Είναι καθοριστική διαδικασία για να " +
                        "αποφευχθεί η περίσσεια του ψεκαστικού " +
                        "υγρού κατά το τέλος της εργασίας ψεκασμού.",
                "Το σύνολο των άλλων απαντήσεων είναι σωστό.",
                "Το σύνολο των άλλων απαντήσεων είναι σωστό.");
        this.addQuestion(q34);
        Question q35 = new Question("Οι βραχίονες ψεκασμού στα ψεκαστικά μηχανήματα μεγάλης καλλιέργειας",
                "Πρέπει να είναι χαλαροί.",
                "Δεν έχει σημασία σε τι ύψος βρίσκονται από την " +
                        "επιφάνεια-στόχο.",
                "Απαγορεύεται να έχουν διαφορετική " +
                        "διατομή κατά το μήκος τους.",
                "Κατασκευάζονται ώστε να ασφαλίζονται κατά τη " +
                        "μεταφορά και να ρυθμίζονται σε ύψος και κλίση κατά " +
                        "την εφαρμογή, μέσω κατάλληλων διατάξεων.",
                "Κατασκευάζονται ώστε να ασφαλίζονται κατά τη " +
                        "μεταφορά και να ρυθμίζονται σε ύψος και κλίση κατά " +
                        "την εφαρμογή, μέσω κατάλληλων διατάξεων.");
        this.addQuestion(q35);
        Question q36 = new Question("Για τη συντήρηση και τον καθαρισμό των ακροφυσίων μπορούμε",
                "Να τα αποφράζουμε φυσώντας με το " +
                        "στόμα.",
                "Να τα ξεπλένουμε, χρησιμοποιώντας ειδικό βουρτσάκι ή " +
                        "να χρησιμοποιούμε δέσμη πεπιεσμένου αέρα.",
                "Να τα αποφράζουμε χρησιμοποιώντας " +
                        "αιχμηρό αντικείμενο π.χ. καρφί.",
                "Να μην τα συντηρούμε αν στο ψεκαστικό διάλυμα έχει " +
                        "προηγηθεί καλή ανάδευση.",
                "Να τα ξεπλένουμε, χρησιμοποιώντας ειδικό βουρτσάκι ή " +
                        "να χρησιμοποιούμε δέσμη πεπιεσμένου αέρα.");
        this.addQuestion(q36);
        Question q37 = new Question("Το μανόμετρο πρέπει :",
                "Να έχει εύρος 80 bar όταν προορίζεται για " +
                        "νεφελοψεκαστήρα.",
                "Δεν είναι απαραίτητο να λειτουργεί όταν γνωρίζουμε " +
                        "την πίεση λειτουργίας της αντλίας.",
                "Να είναι κατάλληλης κλίμακας, ανάλογα με " +
                        "το είδος του εξοπλισμού εφαρμογής και να " +
                        "είναι ευανάγνωστο από τη θέση του χειριστή.",
                "Να έχει ένδειξη (λαμπάκι) που να υποδεικνύει άμεσα " +
                        "τυχόν διαρροή.",
                "Να είναι κατάλληλης κλίμακας, ανάλογα με " +
                        "το είδος του εξοπλισμού εφαρμογής και να " +
                        "είναι ευανάγνωστο από τη θέση του χειριστή.");
        this.addQuestion(q37);
        Question q38 = new Question("Η βαλβίδα ασφαλείας εφόσον υπάρχει :",
                "Ενεργοποιείται όταν γίνεται υπέρβαση της " +
                        "πίεσης λειτουργίας και εκτονώνεται στη " +
                        "δεξαμενή.",
                "Ενεργοποιείται όταν γίνεται υπέρβαση της πίεσης " +
                        "λειτουργίας και εκτονώνεται στο περιβάλλον.",
                "Όταν ενεργοποιηθεί διακόπτει τη λειτουργία " +
                        "του ψεκαστικού μηχανήματος.",
                "Δεν μπορεί να χρησιμοποιηθεί όταν ψεκάζουμε με " +
                        "ζιζανιοκτόνο.",
                "Ενεργοποιείται όταν γίνεται υπέρβαση της " +
                        "πίεσης λειτουργίας και εκτονώνεται στη " +
                        "δεξαμενή.");
        this.addQuestion(q38);
        Question q39 = new Question("Τα ακροφύσια των ψεκαστήρων μεγάλων καλλιεργειών:",
                "Μπορούν να αντικαθίστανται κατά τη διάρκεια " +
                        "του ψεκασμού αν είναι βουλωμένα.",
                "Πρέπει να τοποθετούνται σε ίσες αποστάσεις " +
                        "μεταξύ τους.",
                "Επιτρέπεται να στάζουν μέχρι 30 δευτερόλεπτα " +
                        "μετά την παύση λειτουργίας του ψεκαστικού " +
                        "μηχανήματος.",
                "Πρέπει να ελέγχονται κάθε 10 ημέρες.",
                "Πρέπει να τοποθετούνται σε ίσες αποστάσεις " +
                        "μεταξύ τους.");
        this.addQuestion(q39);
        Question q40 = new Question("Η αντλία ψεκασμού :",
                "Δεν είναι από τα σημαντικά μέρη του " +
                        "εξοπλισμού εφαρμογής γεωργικών " +
                        "φαρμάκων.",
                "Αν παρουσιάζει δονήσεις σημαίνει ότι πρέπει να " +
                        "προσαρμόσουμε την ταχύτητα ψεκασμού.",
                "Οποιαδήποτε διαρροή παρουσιάσει είναι " +
                        "άνευ σημασίας, αν εξασφαλίζεται σταθερή " +
                        "πίεση.",
                "Πρέπει να εξασφαλίζει σταθερή παροχή ψεκαστικού " +
                        "υγρού, να μην παρουσιάζει δονήσεις και διαρροές στην " +
                        "αναρρόφηση ή στην κατάθλιψη.",
                "Πρέπει να εξασφαλίζει σταθερή παροχή ψεκαστικού " +
                        "υγρού, να μην παρουσιάζει δονήσεις και διαρροές στην " +
                        "αναρρόφηση ή στην κατάθλιψη.");
        this.addQuestion(q40);

    }

    private void addQuestions_2() {
        Question_2 q1_2 = new Question_2("Για να αντιμετωπίσω ένα έντομο:",
                "Χρησιμοποιώ όποιο εντομοκτόνο γράφει στην " +
                        "ετικέτα ότι καταπολεμά το έντομο αυτό.",
                "Χρησιμοποιώ γνωστά εντομοκτόνα που " +
                        "χρησιμοποιούνται χρόνια στην περιοχή (π.χ. " +
                        "χλωρπυριφος) κι αν χρειαστεί μπορεί να επιλέξω άλλο .",
                "Ακολουθώ το πρόγραμμα ψεκασμών άλλων " +
                        "παραγωγών που έχουν με επιτυχία " +
                        "αντιμετωπίσει το έντομο αυτό.",
                "Δίνω προτεραιότητα σε μέτρα ‘βιολογικού ελέγχου’ και " +
                        "γεωργικά φάρμακα χαμηλού κινδύνου, χρησιμοποιώ το " +
                        "σκεύασμα το οποίο στην ετικέτα του αναγράφει και το " +
                        "έντομο και την καλλιέργεια στην οποία θέλω να το " +
                        "χρησιμοποιήσω και ακολουθώ τις οδηγίες χρήσεως.",
                "Δίνω προτεραιότητα σε μέτρα ‘βιολογικού ελέγχου’ και " +
                        "γεωργικά φάρμακα χαμηλού κινδύνου, χρησιμοποιώ το " +
                        "σκεύασμα το οποίο στην ετικέτα του αναγράφει και το " +
                        "έντομο και την καλλιέργεια στην οποία θέλω να το " +
                        "χρησιμοποιήσω και ακολουθώ τις οδηγίες χρήσεως.");
        this.addQuestion_2(q1_2);
        Question_2 q2_2 = new Question_2("Οι οδηγίες χρήσης που αναγράφονται στην ετικέτα ενός γεωργικού φαρμάκου:",
                "Είναι προτάσεις της εταιρείας που το διακινεί για " +
                        "να μην έχει ευθύνες.",
                "Είναι υποχρεωτικές δεν επιτρέπεται η χρήση " +
                        "διαφορετικά από ότι γράφεται στις οδηγίες.",
                "Είναι ενδεικτικές και αφορούν μερικές από τις " +
                        "καλλιέργειες όπου έχει αποτέλεσμα.",
                "Είναι υποχρεωτικές μόνο όταν τα φυτικά προϊόντα " +
                        "προορίζονται για εξαγωγή.",
                "Είναι υποχρεωτικές δεν επιτρέπεται η χρήση " +
                        "διαφορετικά από ότι γράφεται στις οδηγίες.");
        this.addQuestion_2(q2_2);
        Question_2 q3_2 = new Question_2("Το παράνομο φυτοπροστατευτικό προϊόν αναγνωρίζεται από:",
                "Τη μη αναγραφή του αριθμού έγκρισης ως " +
                        "γεωργικό φάρμακο.",
                "Τη φθηνή τιμή του και την πληρωμή του σε μετρητά.",
                "Την πώλησή του από παράνομα καταστήματα " +
                        "γεωργικών φαρμάκων.",
                "Την πρόχειρη συσκευασία.",
                "Τη μη αναγραφή του αριθμού έγκρισης ως " +
                        "γεωργικό φάρμακο.");
        this.addQuestion_2(q3_2);
        Question_2 q4_2 = new Question_2("Η τήρηση αρχείου για κάθε χρήση γεωργικών φαρμάκων",
                "Γίνεται σε ηλεκτρονική βάση που τηρείται στο " +
                        "Υπουργείο Αγροτικής Ανάπτυξης και Τροφίμων.",
                "Γίνεται από τον παραγωγό που χρησιμοποιεί τα " +
                        "γεωργικά φάρμακα.",
                "Γίνεται από το κατάστημα που διαθέτει τα " +
                        "γεωργικά φάρμακα ή από τον σύμβουλο.",
                "Γίνεται από το Συνεταιρισμό που ανήκει ο παραγωγός " +
                        "που προμηθεύτηκε τα γεωργικά φάρμακα.",
                "Γίνεται από τον παραγωγό που χρησιμοποιεί τα " +
                        "γεωργικά φάρμακα.");
        this.addQuestion_2(q4_2);
        Question_2 q5_2 = new Question_2("Η διάθεση στην αγορά φρούτων και λαχανικών που έχουν ψεκαστεί με γεωργικά φάρμακα:",
                "Επιτρέπεται αν η συγκομιδή έγινε τουλάχιστον " +
                        "μία εβδομάδα μετά την τελευταία εφαρμογή " +
                        "γεωργικού φαρμάκου.",
                "Επιτρέπεται αν η συγκομιδή έγινε αφού πέρασε " +
                        "χρόνος ίσος με το διάστημα αναμονής προ της " +
                        "συγκομιδής που αναγράφεται στην ετικέτα.",
                "Επιτρέπεται αν η συγκομιδή έγινε τουλάχιστον " +
                        "δέκα ημέρες μετά την τελευταία εφαρμογή " +
                        "γεωργικού φαρμάκου.",
                "Επιτρέπεται αν δεν υπάρχουν φανερά ίχνη του " +
                        "γεωργικού φαρμάκου στο προϊόν που συγκομίζεται.",
                "Επιτρέπεται αν η συγκομιδή έγινε αφού πέρασε " +
                        "χρόνος ίσος με το διάστημα αναμονής προ της " +
                        "συγκομιδής που αναγράφεται στην ετικέτα.");
        this.addQuestion_2(q5_2);
        Question_2 q6_2 = new Question_2("Σε περίπτωση που χυθεί στο δέρμα γεωργικό φάρμακο:",
                "Πλένουμε με άφθονο νερό το δέρμα και " +
                        "ακολουθούμε τις οδηγίες της ετικέτας του " +
                        "γεωργικού φαρμάκου.",
                "Εφόσον το γεωργικό φάρμακο δεν είναι ιδιαίτερα " +
                        "τοξικό, δεν υπάρχει λόγος ανησυχίας.",
                "Πλένουμε το δέρμα με νερό και σαπούνι και " +
                        "λαμβάνουμε προληπτικά αντίδοτο.",
                "Επικοινωνούμε με την εταιρεία που διαθέτει το " +
                        "γεωργικό φάρμακο στην αγορά για να ενημερωθούμε " +
                        "για την επικινδυνότητά του.",
                "Πλένουμε με άφθονο νερό το δέρμα και " +
                        "ακολουθούμε τις οδηγίες της ετικέτας του " +
                        "γεωργικού φαρμάκου.");
        this.addQuestion_2(q6_2);
        Question_2 q7_2 = new Question_2("Τα ωφέλιμα έντομα:",
                "Επηρεάζονται από τα γεωργικά φάρμακα μόνο " +
                        "όταν αυτά είναι εντομοκτόνα.",
                "Δεν επηρεάζονται από τα γεωργικά φάρμακα που " +
                        "εφαρμόζονται στο χώμα ή στην αρχή της " +
                        "καλλιέργειας.",
                "Επηρεάζονται σε διαφορετικό βαθμό από τα " +
                        "διάφορα γεωργικά φάρμακα σύμφωνα με την " +
                        "ετικέτα τους.",
                "Δεν επηρεάζονται ιδιαίτερα από τα γεωργικά " +
                        "φάρμακα που δεν έχουν βαριά σήμανση τοξικότητας " +
                        "(τοξικό κλπ).",
                "Επηρεάζονται σε διαφορετικό βαθμό από τα " +
                        "διάφορα γεωργικά φάρμακα σύμφωνα με την " +
                        "ετικέτα τους.");
        this.addQuestion_2(q7_2);
        Question_2 q8_2 = new Question_2("Τα ωφέλιμα έντομα:",
                "Είναι έντομα που προστατεύονται λόγω " +
                        "κινδύνου εξαφάνισής τους.",
                "Είναι έντομα με θετικές επιδράσεις που βοηθούν π.χ. " +
                        "στον έλεγχο των επιβλαβών εντόμων και εχθρών της " +
                        "καλλιέργειας, ή όπως οι μέλισσες, οι βομβίνοι κλπ " +
                        "που βοηθούν στην επικονίαση των φυτών.",
                "Είναι μόνο οι μέλισσες.",
                "Είναι έντομα που βοηθούν τη δράση συγκεκριμένων " +
                        "γεωργικών φαρμάκων.",
                "Είναι έντομα με θετικές επιδράσεις που βοηθούν π.χ. " +
                        "στον έλεγχο των επιβλαβών εντόμων και εχθρών της " +
                        "καλλιέργειας, ή όπως οι μέλισσες, οι βομβίνοι κλπ " +
                        "που βοηθούν στην επικονίαση των φυτών.");
        this.addQuestion_2(q8_2);
        Question_2 q9_2 = new Question_2("Διαβάζουμε τις οδηγίες της ετικέτας του γεωργικού φαρμάκου …",
                "Εφόσον δεν θυμόμαστε τη χρήση του.",
                "Ποτέ.",
                "Πάντα πριν την εφαρμογή και τις ακολουθούμε " +
                        "πιστά.",
                "Όταν αγοράζουμε το γεωργικό φάρμακο",
                "Πάντα πριν την εφαρμογή και τις ακολουθούμε " +
                        "πιστά.");
        this.addQuestion_2(q9_2);
        Question_2 q10_2 = new Question_2("Για να υπολογίσουμε την απαιτούμενη ποσότητα του γεωργικού φαρμάκου;",
                "Χρησιμοποιούμε κουτάλι για τα στερεά και ποτήρι " +
                        "κρασιού για τα υγρά.",
                "Χρησιμοποιούμε κατάλληλα μέσα μέτρησης .",
                "Απαιτείται να χρησιμοποιηθεί ζυγαριά ακριβείας.",
                "Για υγρά και στερεά γεωργικά φάρμακα " +
                        "χρησιμοποιούμε οποιοδήποτε σημαδεμένο " +
                        "ποτηράκι.",
                "Χρησιμοποιούμε κατάλληλα μέσα μέτρησης .");
        this.addQuestion_2(q10_2);
        Question_2 q11_2 = new Question_2("Τα γεωργικά φάρμακα αποθηκεύονται…",
                "Πάντα κλειδωμένα.",
                "Κλειδωμένα όσα είναι ακριβά.",
                "Κλειδωμένα εφόσον είναι ιδιαίτερα τοξικά.",
                "Σε ανοικτή αποθήκη",
                "Πάντα κλειδωμένα.");
        this.addQuestion_2(q11_2);
        Question_2 q12_2 = new Question_2("Τα γάντια που χρησιμοποιούνται σε ψεκασμούς γεωργικών φαρμάκων πρέπει να είναι:",
                "Δερμάτινα για να αντέχουν.",
                "Μάλλινα για να προφυλάσσουν και από " +
                        "κρυοπαγήματα.",
                "Λεπτά πλαστικά όπως τα γάντια κουζίνας για να " +
                        "αντικαθίστανται μετά από κάθε ψεκασμό.",
                "Ειδικά γάντια ψεκασμού γεωργικών φαρμάκων.",
                "Ειδικά γάντια ψεκασμού γεωργικών φαρμάκων.");
        this.addQuestion_2(q12_2);
        Question_2 q13_2 = new Question_2("Όταν επικρατεί παγωνιά ή ψυχροί άνεμοι…",
                "Οι ψεκασμοί με γεωργικά φάρμακα γίνονται τις " +
                        "ζεστές ώρες τις ημέρας.",
                "Οι ψεκασμοί με γεωργικά φάρμακα γίνονται νωρίς το " +
                        "πρωί.",
                "Οι ψεκασμοί με γεωργικά φάρμακα γίνονται " +
                        "αργά το βράδυ.",
                "Οι ψεκασμοί με γεωργικά φάρμακα πρέπει να " +
                        "αποφεύγονται.",
                "Οι ψεκασμοί με γεωργικά φάρμακα πρέπει να " +
                        "αποφεύγονται.");
        this.addQuestion_2(q13_2);
        Question_2 q14_2 = new Question_2("Ενσωμάτωση του ζιζανιοκτόνου στο έδαφος με ελαφριά άροση γίνεται…",
                "Σε όλα τα ζιζανιοκτόνα.",
                "Όταν το έδαφος είναι ελαφρύ (αμμώδες).",
                "Όταν το έδαφος είναι στο ρώγο του.",
                "Όταν προβλέπεται από την ετικέτα του ζιζανιοκτόνου.",
                "Όταν προβλέπεται από την ετικέτα του ζιζανιοκτόνου.");
        this.addQuestion_2(q14_2);
        Question_2 q15_2 = new Question_2("Σε περίπτωση που κάποιος εισπνεύσει γεωργικό φάρμακο…",
                "Διαβάζουμε την ετικέτα του γεωργικού " +
                        "φαρμάκου και εφόσον είναι τοξικό σε " +
                        "περίπτωση εισπνοής, σταματάμε τον " +
                        "ψεκασμό.",
                "Κρατώντας την ετικέτα του γεωργικού φαρμάκου " +
                        "επικοινωνούμε με γιατρό.",
                "Κρατώντας την ετικέτα του γεωργικού " +
                        "φαρμάκου επισκεπτόμαστε γιατρό.",
                "Μεταφέρουμε άμεσα τον ασθενή σε καθαρό αέρα και " +
                        "διαβάζουμε την ετικέτα του γεωργικού φαρμάκου για " +
                        "επιπρόσθετες οδηγίες .",
                "Κρατώντας την ετικέτα του γεωργικού φαρμάκου " +
                        "επικοινωνούμε με γιατρό.");
        this.addQuestion_2(q15_2);
        Question_2 q16_2 = new Question_2("Σε περίπτωση δηλητηρίασης από γεωργικό φάρμακο, όπου ο ασθενής έχει χάσει τις αισθήσεις του:",
                "Χορηγούμε άμεσα εμετικό για να " +
                        "αποβάλλει το γεωργικό φάρμακο .",
                "Χορηγούμε άμεσα αντίδοτο για να αποφύγουμε περαιτέρω " +
                        "επίδραση του γεωργικού φαρμάκου.",
                "Επικοινωνούμε άμεσα με γιατρό και " +
                        "εφαρμόζουμε τις οδηγίες που θα μας " +
                        "δώσει.",
                "Επικοινωνούμε άμεσα με το κατάστημα εμπορίας " +
                        "γεωργικών φαρμάκων και εφαρμόζουμε τις οδηγίες που θα " +
                        "μας δώσει.",
                "Επικοινωνούμε άμεσα με γιατρό και " +
                        "εφαρμόζουμε τις οδηγίες που θα μας " +
                        "δώσει.");
        this.addQuestion_2(q16_2);
        Question_2 q17_2 = new Question_2("Το καλό κλάδεμα με την αφαίρεση των προσβεβλημένων κλάδων και ο αερισμός του δέντρου που " +
                "προκύπτει από το κλάδεμα …",
                "Πρέπει να γίνεται μετά την εφαρμογή των " +
                        "γεωργικών φαρμάκων.",
                "Αποτελούν μέτρο έκτακτης ανάγκης.",
                "Δεν επηρεάζουν τις ανάγκες του δένδρου για " +
                        "εφαρμογή γεωργικών φαρμάκων.",
                "Είναι το πρώτο μέτρο μείωσης των προσβολών από " +
                        "εχθρούς (κυρίως κοκκοειδή) και ασθένειες.",
                "Είναι το πρώτο μέτρο μείωσης των προσβολών από " +
                        "εχθρούς (κυρίως κοκκοειδή) και ασθένειες.");
        this.addQuestion_2(q17_2);
        Question_2 q18_2 = new Question_2("Η οξαλίδα (ζιζάνιο) μπορεί να χρησιμοποιηθεί:",
                "Για παραγωγή τσαγιού.",
                "Σε τίποτα.",
                "Για εδαφοκάλυψη και περιορισμό των ζιζανίων " +
                        "στην ελιά, στο αμπέλι και στα εσπεριδοειδή.",
                "Για περιορισμό των εντόμων.",
                "Για εδαφοκάλυψη και περιορισμό των ζιζανίων " +
                        "στην ελιά, στο αμπέλι και στα εσπεριδοειδή.");
        this.addQuestion_2(q18_2);
        Question_2 q19_2 = new Question_2("Τα προφυτρωτικά ζιζανιοκτόνα εφαρμόζονται:",
                "Αποκλειστικά για στενόφυλλα ζιζάνια.",
                "Πριν το φύτρωμα της καλλιέργειας.",
                "Αποκλειστικά για πλατύφυλλα ζιζάνια.",
                "Μετά το φύτρωμα της καλλιέργειας",
                "Πριν το φύτρωμα της καλλιέργειας.");
        this.addQuestion_2(q19_2);
        Question_2 q20_2 = new Question_2("Η καλύτερη εποχή για την εφαρμογή της ηλιαπολύμανσης είναι:",
                "Ο χειμώνας.",
                "Η άνοιξη.",
                "Το καλοκαίρι.",
                "Το φθινόπωρο.",
                "Το καλοκαίρι.");
        this.addQuestion_2(q20_2);
        Question_2 q21_2 = new Question_2("Η ηλιαπολύμανση εφαρμόζεται:",
                "Μόνο σε καλλιέργειες θερμοκηπίου.",
                "Μόνο σε φρούτα και λαχανικά.",
                "Μόνο σε λαχανικά.",
                "Σε πολλές καλλιέργειες.",
                "Σε πολλές καλλιέργειες.");
        this.addQuestion_2(q21_2);
        Question_2 q22_2 = new Question_2("Με το σύστημα γεωργικών προειδοποιήσεων",
                "Ενημερωνόμαστε για τον καιρό.",
                "Ενημερωνόμαστε για τις επιδοτήσεις.",
                "Ενημερωνόμαστε για την εξέλιξη των " +
                        "εντόμων και ασθενειών στην περιοχή.",
                "Ενημερωνόμαστε για τη δυνατότητα εφαρμογών " +
                        "γεωργικών φαρμάκων πέραν των αναγραφόμενων στην " +
                        "ετικέτα τους.",
                "Ενημερωνόμαστε για την εξέλιξη των " +
                        "εντόμων και ασθενειών στην περιοχή.");
        this.addQuestion_2(q22_2);
        Question_2 q23_2 = new Question_2("Χρησιμοποιώντας τις έγχρωμες κολλητικές παγίδες (κίτρινες ή μπλε παγίδες):",
                "Ενημερωνόμαστε για την ύπαρξη και τον " +
                        "πληθυσμό επιβλαβών εντόμων.",
                "Ενημερωνόμαστε για τη δυνατότητα συνδυασμού ενός " +
                        "εντομοκτόνου με άλλο.",
                "Διαπιστώνουμε αν υπάρχουν ωφέλιμα " +
                        "έντομα στην καλλιέργεια.",
                "Απωθούνται τα επιβλαβή έντομα από την καλλιέργεια.",
                "Ενημερωνόμαστε για την ύπαρξη και τον " +
                        "πληθυσμό επιβλαβών εντόμων.");
        this.addQuestion_2(q23_2);
        Question_2 q24_2 = new Question_2("Μία βιολογική μέθοδος καταπολέμησης εφαρμόζεται:",
                "Μόνο όταν έχουμε πιστοποιηθεί για " +
                        "βιολογική καλλιέργεια.",
                "Κατά προτίμηση σε σχέση με τα χημικά μέσα.",
                "Κατά προτίμηση μετά τα χημικά μέσα",
                "Μόνο εφόσον έχουν αποτύχει τα χημικά μέσα.",
                "Κατά προτίμηση σε σχέση με τα χημικά μέσα.");
        this.addQuestion_2(q24_2);
        Question_2 q25_2 = new Question_2("Τα ψεκαστικά μέσα τύπου τουρμπίνας εφαρμόζονται:",
                "Όταν το κτήμα είναι μικρό και η " +
                        "καλλιέργεια έχει μικρό ύψος.",
                "Όταν το κτήμα είναι μεγάλο και η καλλιέργεια έχει μικρό " +
                        "ύψος.",
                "Όταν το κτήμα είναι μεγάλο κα η " +
                        "καλλιέργεια έχει μεγάλο ύψος.",
                "Όταν το κτήμα είναι μικρό και η καλλιέργεια έχει μεγάλο " +
                        "ύψος.",
                "Όταν το κτήμα είναι μεγάλο κα η " +
                        "καλλιέργεια έχει μεγάλο ύψος.");
        this.addQuestion_2(q25_2);
        Question_2 q26_2 = new Question_2("Για να αποφύγω την ανάπτυξη ανθεκτικότητας από ένα επιβλαβές έντομο:",
                "Χρησιμοποιώ το ίδιο εντομοκτόνο " +
                        "συνεχώς για μερικά χρόνια.",
                "Χρησιμοποιώ εντομοκτόνα με διαφορετικό τρόπο δράσης.",
                "Χρησιμοποιώ εντομοκτόνα με ίδιο τρόπο " +
                        "δράσης.",
                "Φροντίζω να εναλλάσσω εντομοκτόνα που είναι στην ίδια " +
                        "χημική ομάδα.",
                "Χρησιμοποιώ εντομοκτόνα με διαφορετικό τρόπο δράσης.");
        this.addQuestion_2(q26_2);
        Question_2 q27_2 = new Question_2("Με σκοπό να καταπολεμήσω δεδομένο επιβλαβές έντομο μπορώ να χρησιμοποιήσω 3 εντομοκτόνα: " +
                "Ένα με σήμανση νεκροκεφαλή, ένα με σήμανση χιαστί σταυρό και ένα χωρίς σήμανση. Ποιο και γιατί " +
                "επιλέγω να χρησιμοποιήσω;",
                "Το εντομοκτόνο με σήμανση " +
                        "νεκροκεφαλή γιατί είναι το πιο δυνατό " +
                        "από τα τρία.",
                "Το εντομοκτόνο με σήμανση χιαστί σταυρό γιατί συνδυάζει " +
                        "ασφάλεια και αποτελεσματικότητα.",
                "Το εντομοκτόνο χωρίς σήμανση γιατί " +
                        "είναι το πιο ασφαλές από τα τρία.",
                "Χρησιμοποιώ και τα τρία εντομοκτόνα αρκεί να κάθε φορά " +
                        "να χρησιμοποιώ διαφορετικό.",
                "Το εντομοκτόνο χωρίς σήμανση γιατί " +
                        "είναι το πιο ασφαλές από τα τρία.");
        this.addQuestion_2(q27_2);
        Question_2 q28_2 = new Question_2("Για ποιο λόγο χρησιμοποιούμε τα μπεκ μειωμένης διασποράς;",
                "Επειδή είναι οικονομικά, αφού απαιτούνται " +
                        "λιγότερα ανά στρέμμα.",
                "Επειδή μειώνουν τη διασπορά του ψεκαστικού " +
                        "υγρού με αποτέλεσμα τη μείωση της " +
                        "επικινδυνότητας του φαρμάκου στο περιβάλλον.",
                "Επειδή μειώνουν τη διασπορά του ψεκαστικού " +
                        "υγρού με αποτέλεσμα να μην απαιτούνται μέσα " +
                        "προσωπικής προστασίας.",
                "Επειδή είναι επιδοτούμενα.",
                "Επειδή μειώνουν τη διασπορά του ψεκαστικού " +
                        "υγρού με αποτέλεσμα τη μείωση της " +
                        "επικινδυνότητας του φαρμάκου στο περιβάλλον.");
        this.addQuestion_2(q28_2);
        Question_2 q29_2 = new Question_2("Η βαθμονόμηση του εξοπλισμού εφαρμογής γεωργικών φαρμάκων:",
                "Συνίσταται στον υπολογισμό της ταχύτητας του " +
                        "ελκυστήρα με την οποία πρέπει να γίνει η εφαρμογή " +
                        "του γεωργικού φαρμάκου, γνωρίζοντας την παροχή " +
                        "των ακροφυσίων που έχω επιλέξει και " +
                        "χρησιμοποιώντας την αραίωση του γεωργικού " +
                        "φαρμάκου όπως συστήνεται στην ετικέτα του.",
                "Συνίσταται στον υπολογισμό της παροχής των " +
                        "ακροφυσίων, με βάση την ταχύτητα και τον " +
                        "χρόνο που θέλω να διαθέσω για να ολοκληρώσω " +
                        "τον ψεκασμό καθώς και την αραίωση του " +
                        "γεωργικού φαρμάκου που συστήνει η ετικέτα " +
                        "του.",
                "Δεν είναι απαραίτητη να γίνεται σε κάθε ψεκασμό " +
                        "και ιδιαιτέρως εφόσον χρησιμοποιείται ψεκαστικό " +
                        "διάλυμα υψηλής αραίωσης.",
                "Όλες οι άλλες απαντήσεις είναι σωστές.",
                "Συνίσταται στον υπολογισμό της ταχύτητας του " +
                        "ελκυστήρα με την οποία πρέπει να γίνει η εφαρμογή " +
                        "του γεωργικού φαρμάκου, γνωρίζοντας την παροχή " +
                        "των ακροφυσίων που έχω επιλέξει και " +
                        "χρησιμοποιώντας την αραίωση του γεωργικού " +
                        "φαρμάκου όπως συστήνεται στην ετικέτα του.");
        this.addQuestion_2(q29_2);
        Question_2 q30_2 = new Question_2("Παράγοντες που αυξάνουν τις πιθανότητες αερομεταφοράς είναι :",
                "Ο δυνατός άνεμος ή η αυξημένη πίεση ψεκασμού.",
                "Υψηλή ταχύτητα εργασίας ή η χρήση " +
                        "ακατάλληλου μεγέθους ακροφυσίων.",
                "Μεγαλύτερη από την συνιστώμενη απόστα- ση των " +
                        "ακροφυσίων από την επιφάνεια στόχο ή λάθος " +
                        "προσανατολισμός αυτών.",
                "Όλοι οι παράγοντες που αναφέρονται στις άλλες " +
                        "απαντήσεις αυξάνουν τις πιθανότητες " +
                        "αερομεταφοράς.",
                "Όλοι οι παράγοντες που αναφέρονται στις άλλες " +
                        "απαντήσεις αυξάνουν τις πιθανότητες " +
                        "αερομεταφοράς.");
        this.addQuestion_2(q30_2);
        Question_2 q31_2 = new Question_2("Για την ασφάλεια του χρήστη :",
                "Δεν είναι απαραίτητη η ύπαρξη προφυλακτήρων " +
                        "του δυναμοδότη.",
                "Είναι απαραίτητη η ύπαρξη προφυλακτήρα στον " +
                        "δυναμοδότη και στον δυναμολήπτη του " +
                        "εξοπλισμού εφαρμογής γεωργικών φαρμάκων.",
                "Η ύπαρξη προφυλακτήρα στον δυναμολήπτη είναι " +
                        "αρκετή.",
                "Οι φθορές στα εξαρτήματα μετάδοσης κίνησης " +
                        "δεν παίζουν ρόλο.",
                "Είναι απαραίτητη η ύπαρξη προφυλακτήρα στον " +
                        "δυναμοδότη και στον δυναμολήπτη του " +
                        "εξοπλισμού εφαρμογής γεωργικών φαρμάκων.");
        this.addQuestion_2(q31_2);
        Question_2 q32_2 = new Question_2("Για τη χρήση φορητού εξοπλισμού εφαρμογής γεωργικών φαρμάκων (επινώτιων ψεκαστήρων):",
                "Η βαθμονόμηση είναι απαραίτητη και πρέπει να " +
                        "γίνεται με βάση την προσωπική ταχύτητα " +
                        "βηματισμού και το ρυθμό εφαρμογής του " +
                        "χρήστη και πάντοτε μόνο με τη χρήση καθαρού " +
                        "νερού.",
                "Πρέπει να λαμβάνονται τα μέτρα ατομικής " +
                        "προστασίας του χρήστη που αναφέρονται στην " +
                        "ετικέτα του γεωργικού φαρμάκου, όπως ισχύει και " +
                        "για τους νεφελοψεκαστήρες και ψεκαστήρες " +
                        "μεγάλων καλλιεργειών.",
                "Δεν απαιτείται βαθμονόμησή του, λόγω μικρού " +
                        "όγκου ψεκαστικού διαλύματος.",
                "Η βαθμονόμηση είναι απαραίτητη και πρέπει να " +
                        "λαμβάνονται τα μέτρα ατομικής προστασίας του " +
                        "χρήστη που αναφέρονται στις άλλες απαντήσεις",
                "Η βαθμονόμηση είναι απαραίτητη και πρέπει να " +
                        "λαμβάνονται τα μέτρα ατομικής προστασίας του " +
                        "χρήστη που αναφέρονται στις άλλες απαντήσεις");
        this.addQuestion_2(q32_2);
        Question_2 q33_2 = new Question_2("Χαμηλή πίεση ψεκασμού χρησιμοποιείται:",
                "Σε εντομοκτόνα.",
                "Σε όλα τα φάρμακα για οικονομία ψεκαστικού υγρού.",
                "Στα ζιζανιοκτόνα.",
                "Στα διασυστηματικά μυκητοκτόνα.",
                "Στα ζιζανιοκτόνα.");
        this.addQuestion_2(q33_2);
        Question_2 q34_2 = new Question_2("Με τη ρύθμιση του εξοπλισμού εφαρμογής γεωργικών φαρμάκων (βαθμονόμηση) επιτυγχάνουμε:",
                "Eλάχιστες επιπτώσεις στο περιβάλλον",
                "Οικονομία στο φάρμακο",
                "Οικονομία στο φάρμακο, ελάχιστες " +
                        "επιπτώσεις στο περιβάλλον και στον εαυτό " +
                        "μας και αποτελεσματική εφαρμογή.",
                "Αποτελεσματική εφαρμογή.",
                "Οικονομία στο φάρμακο, ελάχιστες " +
                        "επιπτώσεις στο περιβάλλον και στον εαυτό " +
                        "μας και αποτελεσματική εφαρμογή.");
        this.addQuestion_2(q34_2);
        Question_2 q35_2 = new Question_2("Η ανάδευση του ψεκαστικού υγρού :",
                "Δεν είναι απαραίτητη αν το φάρμακο είναι " +
                        "υδατοδιαλυτό.",
                "Επιβάλλεται μόνο στις περιπτώσεις που το φάρμακο " +
                        "είναι σε μορφή σκόνης.",
                "Επιβάλλεται πάντα ώστε να επιτυγχάνεται η " +
                        "ίδια συγκέντρωση φυτοφαρμάκου σε όλο τον " +
                        "όγκο του ψεκαστικού υγρού μέσα στη " +
                        "δεξαμενή.",
                "Στις μικρές δεξαμενές μπορεί να γίνεται με το χέρι " +
                        "εφόσον φοράμε γάντια.",
                "Επιβάλλεται πάντα ώστε να επιτυγχάνεται η " +
                        "ίδια συγκέντρωση φυτοφαρμάκου σε όλο τον " +
                        "όγκο του ψεκαστικού υγρού μέσα στη " +
                        "δεξαμενή.");
        this.addQuestion_2(q35_2);
        Question_2 q36_2 = new Question_2("Για τη δεξαμενή ψεκαστικού υγρού:",
                "Δεν είναι σημαντικό να γνωρίζουμε επακριβώς " +
                        "τον όγκο της.",
                "Πρέπει να υπάρχει ευκρινής δείκτης περιεχομένου, " +
                        "ορατός από τη θέση του χειριστή.",
                "Μία αυξημένη τραχύτητα στην εσωτερική " +
                        "επιφάνεια της δεξαμενής, βοηθάει στην καλή " +
                        "ανάδευση του περιεχομένου.",
                "Το σύστημα ανάδευσης δεν είναι υποχρεωτικό.",
                "Πρέπει να υπάρχει ευκρινής δείκτης περιεχομένου, " +
                        "ορατός από τη θέση του χειριστή.");
        this.addQuestion_2(q36_2);
        Question_2 q37_2 = new Question_2("Η καταγραφή του εξοπλισμού εφαρμογής γεωργικών φαρμάκων:",
                "Είναι υποχρεωτική για την καλύτερη " +
                        "οργάνωση της περιοδικής επιθεώρησης που " +
                        "ακολουθεί.",
                "Είναι υποχρεωτική γιατί προβλέπεται από την " +
                        "ευρωπαϊκή και εθνική νομοθεσία.",
                "Εξυπηρετεί τη δημιουργία μητρώου που " +
                        "τηρείται στις αρμόδιες περιφερειακές " +
                        "υπηρεσίες απογραφής αγροτικών " +
                        "μηχανημάτων και αγροτικού εξηλεκτρισμού.",
                "Όλες οι άλλες απαντήσεις ισχύουν.",
                "Όλες οι άλλες απαντήσεις ισχύουν.");
        this.addQuestion_2(q37_2);
        Question_2 q38_2 = new Question_2("Για τον ψεκασμό ζιζανιοκτόνων εδάφους χρησιμοποιούμε μπέκ:",
                "Τύπου σκούπας.",
                "Τύπου κώνου.",
                "Ομοιόμορφης κατανομής.",
                "Συγκεντρωτικά.",
                "Τύπου σκούπας.");
        this.addQuestion_2(q38_2);
        Question_2 q39_2 = new Question_2("Οι βραχίονες ψεκασμού στα ψεκαστικά μηχανήματα μεγάλης καλλιέργειας",
                "Πρέπει να είναι χαλαροί.",
                "Δεν έχει σημασία σε τι ύψος βρίσκονται από την " +
                        "επιφάνεια-στόχο.",
                "Απαγορεύεται να έχουν διαφορετική " +
                        "διατομή κατά το μήκος τους.",
                "Κατασκευάζονται ώστε να ασφαλίζονται κατά τη " +
                        "μεταφορά και να ρυθμίζονται σε ύψος και κλίση κατά " +
                        "την εφαρμογή, μέσω κατάλληλων διατάξεων.",
                "Κατασκευάζονται ώστε να ασφαλίζονται κατά τη " +
                        "μεταφορά και να ρυθμίζονται σε ύψος και κλίση κατά " +
                        "την εφαρμογή, μέσω κατάλληλων διατάξεων.");
        this.addQuestion_2(q39_2);
        Question_2 q40_2 = new Question_2("Για τη συντήρηση και τον καθαρισμό των ακροφυσίων μπορούμε",
                "Να τα αποφράζουμε φυσώντας με το " +
                        "στόμα.",
                "Να τα ξεπλένουμε, χρησιμοποιώντας ειδικό βουρτσάκι ή " +
                        "να χρησιμοποιούμε δέσμη πεπιεσμένου αέρα.",
                "Να τα αποφράζουμε χρησιμοποιώντας " +
                        "αιχμηρό αντικείμενο π.χ. καρφί.",
                "Να μην τα συντηρούμε αν στο ψεκαστικό διάλυμα έχει " +
                        "προηγηθεί καλή ανάδευση.",
                "Να τα ξεπλένουμε, χρησιμοποιώντας ειδικό βουρτσάκι ή " +
                        "να χρησιμοποιούμε δέσμη πεπιεσμένου αέρα.");
        this.addQuestion_2(q40_2);

    }

    private void addQuestions_3() {
        Question_3 q1_3 = new Question_3("Ένα νόμιμο γεωργικό φάρμακο ξεχωρίζει γιατί…",
                "Μπορεί να το γράψει ο πωλητής στο τιμολόγιο.",
                "Γράφει στην ετικέτα του τον αριθμό έγκρισης του " +
                        "Υπουργείου Αγροτικής Ανάπτυξης και Τροφίμων και " +
                        "πωλείται από εγκεκριμένα σημεία πώλησης",
                "Έχει καλύτερη συσκευασία από το μη νόμιμο.",
                "Στην ετικέτα του γράφει τη βιομηχανία που το έφτιαξε.",
                "Γράφει στην ετικέτα του τον αριθμό έγκρισης του " +
                        "Υπουργείου Αγροτικής Ανάπτυξης και Τροφίμων και " +
                        "πωλείται από εγκεκριμένα σημεία πώλησης");
        this.addQuestion_3(q1_3);
        Question_3 q2_3 = new Question_3("Ένα γεωργικό φάρμακο με ξενόγλωσση ετικέτα:",
                "Πρέπει πάντα να συνοδεύεται με φυλλάδιο με " +
                        "μετάφραση της ετικέτας του στα Ελληνικά.",
                "Είναι παράνομο εφόσον δεν υπάρχει εγκεκριμένο στη " +
                        "χώρα με την ίδια ονομασία.",
                "Είναι σε κάθε περίπτωση παράνομο.",
                "Είναι παράνομο εφόσον δεν πουλιέται από " +
                        "καταστήματα γεωργικών φαρμάκων με γεωπόνο.",
                "Είναι σε κάθε περίπτωση παράνομο.");
        this.addQuestion_3(q2_3);
        Question_3 q3_3 = new Question_3("Τα γεωργικά φάρμακα που πουλιούνται σε συσκευασίες χωρίς ετικέτα και οδηγίες χρήσης:",
                "Δεν έχουν ελεγχθεί και μπορεί να προκαλέσουν " +
                        "ανεπιθύμητες επιπτώσεις.",
                "Περιέχουν πάντα τοξικές ουσίες.",
                "Δεν έχουν πάρει ακόμη έγκριση κυκλοφορίας " +
                        "και διατίθενται δοκιμαστικά για να " +
                        "επιβεβαιωθεί η αποτελεσματικότητά τους.",
                "Είναι πιο αποτελεσματικά και πιο φθηνά από τα " +
                        "εγκεκριμένα.",
                "");
        this.addQuestion_3(q3_3);
        Question_3 q4_3 = new Question_3("Η τήρηση αρχείου για κάθε χρήση γεωργικών φαρμάκων",
                "Αφορά την καταγραφή της ονομασίας του " +
                        "γεωργικού φαρμάκου, της καλλιέργειας, της " +
                        "περιοχής, του χρόνου χρήσης και της " +
                        "δοσολογίας που χρησιμοποιήθηκε.",
                "Αφορά την καταγραφή της ονομασίας του γεωργικού " +
                        "φαρμάκου, , και του χρόνου χρήσης,.",
                "Αφορά την καταγραφή της ονομασίας του " +
                        "γεωργικού φαρμάκου.",
                "Αφορά την καταγραφή της καλλιέργειας όπου " +
                        "χρησιμοποιήθηκε.",
                "Αφορά την καταγραφή της ονομασίας του " +
                        "γεωργικού φαρμάκου, της καλλιέργειας, της " +
                        "περιοχής, του χρόνου χρήσης και της " +
                        "δοσολογίας που χρησιμοποιήθηκε.");
        this.addQuestion_3(q4_3);
        Question_3 q5_3 = new Question_3("Η πασχαλίτσα είναι ωφέλιμο έντομο γιατί:",
                "Καταναλώνει άλλα βλαβερά έντομα.",
                "Δένει καλύτερα ο καρπός σε πολλές καλλιέργειες.",
                "Είναι ιδιαίτερα όμορφο έντομο συνδεδεμένο με " +
                        "παραδόσεις.",
                "Βοηθά στην αύξηση της αποτελεσματικότητας των " +
                        "γεωργικών φαρμάκων.",
                "Καταναλώνει άλλα βλαβερά έντομα.");
        this.addQuestion_3(q5_3);
        Question_3 q6_3 = new Question_3("Φυτά που βρίσκονται γειτονικά του κτήματος που γίνεται εφαρμογή γεωργικού φαρμάκου:",
                "Δεν κινδυνεύουν παρά μόνο εάν εφαρμόζονται " +
                        "ζιζανιοκτόνα.",
                "Δεν κινδυνεύουν εκτός εάν ο ψεκασμός γίνεται με " +
                        "τουρμπίνες.",
                "Δεν κινδυνεύουν, φτάνει να εφαρμόζονται όταν " +
                        "δε φυσάει.",
                "Δεν κινδυνεύουν όταν: εφαρμόζονται αφενός μεν " +
                        "καλές γεωργικές πρακτικές (ψεκασμός όταν δεν " +
                        "φυσάει δυνατός άνεμος κλπ) αλλά και οι οδηγίες της " +
                        "ετικέτας.",
                "Δεν κινδυνεύουν όταν: εφαρμόζονται αφενός μεν " +
                        "καλές γεωργικές πρακτικές (ψεκασμός όταν δεν " +
                        "φυσάει δυνατός άνεμος κλπ) αλλά και οι οδηγίες της " +
                        "ετικέτας.");
        this.addQuestion_3(q6_3);
        Question_3 q7_3 = new Question_3("Κατά το γέμισμα του ψεκαστικού βυτίου με το γεωργικό φάρμακο, ο παραγωγός:",
                "Φοράει γυαλιά, μάσκα, γάντια, μπότες και " +
                        "φόρμα.",
                "Δεν χρειάζονται τα μέσα προσωπικής προστασίας " +
                        "αρκεί να μην χυθεί πάνω του το γεωργικό φάρμακο.",
                "Φοράει τα μέσα προσωπικής προστασίας που " +
                        "αναφέρονται στην ετικέτα του γεωργικού " +
                        "φαρμάκου.",
                "Δεν χρειάζονται τα μέσα προσωπικής προστασίας, " +
                        "όταν έχει πολύχρονη εμπειρία στους ψεκασμούς.",
                "Φοράει τα μέσα προσωπικής προστασίας που " +
                        "αναφέρονται στην ετικέτα του γεωργικού " +
                        "φαρμάκου.");
        this.addQuestion_3(q7_3);
        Question_3 q8_3 = new Question_3("Οι κίνδυνοι για τους χειριστές των γεωργικών φαρμάκων, είναι μεγάλοι όταν:",
                "Το γεωργικό φάρμακο δεν έχει έγκριση " +
                        "κυκλοφορίας ή είναι ληγμένο.",
                "Είναι καλοκαίρι, ή τα γεωργικά φάρμακα " +
                        "εφαρμόζονται σε θερμοκήπια.",
                "Όταν ο χειριστής είναι κουρασμένος ή νηστικός.",
                "Δεν εφαρμόζονται όλα όσα λέει η ετικέτα για τα " +
                        "μέτρα προστασίας.",
                "Δεν εφαρμόζονται όλα όσα λέει η ετικέτα για τα " +
                        "μέτρα προστασίας.");
        this.addQuestion_3(q8_3);
        Question_3 q9_3 = new Question_3("Τα ληγμένα γεωργικά φάρμακα…",
                "Δεν χρησιμοποιούνται αλλά αποστέλλονται στις " +
                        "εταιρείες διαχείρισης αποβλήτων.",
                "Χρησιμοποιούνται εφόσον η εικόνα τους είναι " +
                        "κανονική.",
                "Χρησιμοποιούνται σε καλλιέργειες που δεν θα " +
                        "καταναλωθούν όπως τα λουλούδια στον κήπο.",
                "Χρησιμοποιούνται σε ανάμιξη με μη ληγμένα " +
                        "γεωργικά φάρμακα.",
                "Δεν χρησιμοποιούνται αλλά αποστέλλονται στις " +
                        "εταιρείες διαχείρισης αποβλήτων.");
        this.addQuestion_3(q9_3);
        Question_3 q10_3 = new Question_3("Στην αποθήκη των γεωργικών φαρμάκων",
                "Τα υγρά τοποθετούνται πάνω από τα στερεά " +
                        "γεωργικά φάρμακα.",
                "Διατηρούμε τις κενές συσκευασίες των γεωργικών " +
                        "φαρμάκων για να τις επαναχρησιμοποιήσουμε .",
                "Τα στερεά τοποθετούνται πάνω από τα υγρά " +
                        "γεωργικά φάρμακα.",
                "Αποθηκεύουμε τρόφιμα και ποτά.",
                "Τα στερεά τοποθετούνται πάνω από τα υγρά " +
                        "γεωργικά φάρμακα.");
        this.addQuestion_3(q10_3);
        Question_3 q11_3 = new Question_3("Ποια είναι τα σωστά μέσα προστασίας που πρέπει να φοράμε κατά την εφαρμογή ενός γεωργικού " +
                "φαρμάκου",
                "Όποια αναφέρονται στην ετικέτα του γεωργικού " +
                        "φαρμάκου.",
                "Γάντια, και μπότες.",
                "Αδιάβροχη φόρμα, και μάσκα.",
                "Ότι συστήνει το κατάστημα από όπου " +
                        "προμηθευτήκαμε το γεωργικό φάρμακο.",
                "Όποια αναφέρονται στην ετικέτα του γεωργικού " +
                        "φαρμάκου.");
        this.addQuestion_3(q11_3);
        Question_3 q12_3 = new Question_3("Πότε φοράμε τα μέσα προστασίας;",
                "Αφού ετοιμάσουμε το ψεκαστικό διάλυμα",
                "Όταν το τρακτέρ δεν έχει κλειστό κουβούκλιο.",
                "Όταν φυσάει δυνατός άνεμος.",
                "Πριν ξεκινήσουμε να ετοιμάζουμε το ψεκαστικό " +
                        "διάλυμα.",
                "Πριν ξεκινήσουμε να ετοιμάζουμε το ψεκαστικό " +
                        "διάλυμα.");
        this.addQuestion_3(q12_3);
        Question_3 q13_3 = new Question_3("Σε ελαφρύ αμμώδες έδαφος, ο κίνδυνος έκπλυσης (ξεπλύματος) των γεωργικών φαρμάκων και " +
                "ρύπανσης των υπόγειων νερών είναι:",
                "Μεγαλύτερος από αυτόν σε βαρύ " +
                        "αργιλώδες έδαφος.",
                "Μικρότερος από αυτόν σε βαρύ αργιλλώδες έδαφος.",
                "Ίδιος με αυτόν σε βαρύ αργιλώδες έδαφος.",
                "Εξαρτάται από την χρονιά.",
                "Μεγαλύτερος από αυτόν σε βαρύ " +
                        "αργιλώδες έδαφος.");
        this.addQuestion_3(q13_3);
        Question_3 q14_3 = new Question_3("Σε επικλινή εδάφη (με κλίση μεγαλύτερη από 10%)…",
                "Ψεκάζουμε με ζιζανιοκτόνα",
                "Ελέγχουμε τα ζιζάνια μόνο με χορτοκοπή, ώστε να " +
                        "διατηρείται η φυτοκάλυψη για να αποφεύγεται η " +
                        "διάβρωση του εδάφους.",
                "Κάνουμε μόνο επιφανειακή άροση για " +
                        "ζιζανιοκτονία.",
                "Εφαρμόζουμε κοκκώδη ζιζανιοκτόνα",
                "Ελέγχουμε τα ζιζάνια μόνο με χορτοκοπή, ώστε να " +
                        "διατηρείται η φυτοκάλυψη για να αποφεύγεται η " +
                        "διάβρωση του εδάφους.");
        this.addQuestion_3(q14_3);
        Question_3 q15_3 = new Question_3("Αν χυθεί ποσότητα γεωργικού φαρμάκου στο έδαφος …",
                "Ρίχνουμε άφθονο νερό, ώστε τα απόνερα " +
                        "να πάνε στο υπέδαφος.",
                "Ρίχνουμε απορροφητικό υλικό (άμμος) και σκεπάζουμε το " +
                        "σημείο.",
                "Συλλέγουμε το ρυπασμένο χώμα και " +
                        "διαχειριζόμαστε σύμφωνα με τη " +
                        "νομοθεσία για τα απόβλητα.",
                "Αποφεύγουμε για 15 ημέρες το πότισμα στο συγκεκριμένο " +
                        "σημείο .",
                "Συλλέγουμε το ρυπασμένο χώμα και " +
                        "διαχειριζόμαστε σύμφωνα με τη " +
                        "νομοθεσία για τα απόβλητα.");
        this.addQuestion_3(q15_3);
        Question_3 q16_3 = new Question_3("Το τηλέφωνο του Κέντρου Δηλητηριάσεων αναγράφεται:",
                "Στην είσοδο του καταστήματος εμπορίας " +
                        "γεωργικών φαρμάκων.",
                "Σε κάθε ετικέτα γεωργικού φαρμάκου.",
                "Στην είσοδο του τοπικού Κέντρου Υγείας " +
                        "ή αγροτικού ιατρού.",
                "Σε κάθε τιμολόγιο πώλησης γεωργικού φαρμάκου.",
                "Σε κάθε ετικέτα γεωργικού φαρμάκου.");
        this.addQuestion_3(q16_3);
        Question_3 q17_3 = new Question_3("Ανθεκτικότητα εντόμων σε ένα εντομοκτόνο σημαίνει ότι:",
                "Το εντομοκτόνο αυτό δεν είναι πλέον " +
                        "αποτελεσματικό στα συγκεκριμένα έντομα.",
                "Τα έντομα παρουσιάζουν καλύτερη ανάπτυξη μετά την " +
                        "εφαρμογή του συγκεκριμένου εντομοκτόνου.",
                "Απαιτούνται επαναλαμβανόμενες εφαρμογές " +
                        "με μειωμένες δόσεις του συγκεκριμένου " +
                        "εντομοκτόνου.",
                "Τα έντομα είναι πλέον ανθεκτικά σε όλα τα " +
                        "εντομοκτόνα.",
                "Το εντομοκτόνο αυτό δεν είναι πλέον " +
                        "αποτελεσματικό στα συγκεκριμένα έντομα.");
        this.addQuestion_3(q17_3);
        Question_3 q18_3 = new Question_3("Ο παραγωγός πρέπει να συμβουλεύεται γεωπόνο για τη φυτοπροστασία της καλλιέργειάς του…",
                "Μία φορά το χρόνο.",
                "Μία φορά το μήνα.",
                "Όταν χρειάζεται τις συμβουλές του.",
                "Καθημερινά.",
                "Όταν χρειάζεται τις συμβουλές του.");
        this.addQuestion_3(q18_3);
        Question_3 q19_3 = new Question_3("Ενέργειες μετά τη συγκομιδή (πχ όργωμα με αλέτρι με υνί σε ετήσιες καλλιέργειες, συλλογή καρπών " +
                "πάνω στο δέντρο ή και κάτω στο έδαφος που είναι προσβεβλημένοι, κλάδεμα δέντρων και " +
                "αφαίρεση με κάψιμο προσβεβλημένων μερών, ψεκασμός πριν το φούσκωμα των ματιών σε δέντρα " +
                "με χαλκούχα ή με ορυκτέλαια-παραφινέλαια) …",
                "Μπορούν να μειώνουν το μέγεθος του " +
                        "αρχικού πληθυσμού ορισμένων εχθρών " +
                        "και ασθενειών την επόμενη " +
                        "καλλιεργητική περίοδο.",
                "Δεν μειώνουν ποτέ το μέγεθος του αρχικού πληθυσμού " +
                        "ορισμένων εχθρών και ασθενειών την επόμενη " +
                        "καλλιεργητική περίοδο.",
                "Αυξάνουν το μέγεθος του αρχικού " +
                        "πληθυσμού ορισμένων εχθρών(που " +
                        "διαχειμάζουν στο έδαφος) και ασθενειών " +
                        "την επόμενη καλλιεργητική περίοδο.",
                "Είναι χωρίς σημασία. Μόνο οι επεμβάσεις με " +
                        "φυτοπροσταστευτικά προϊόντα κατά την καλλιεργητική " +
                        "περίοδο μειώνουν τον αρχικό πληθυσμό ενός εχθρού, " +
                        "ασθένειας",
                "Μπορούν να μειώνουν το μέγεθος του " +
                        "αρχικού πληθυσμού ορισμένων εχθρών " +
                        "και ασθενειών την επόμενη " +
                        "καλλιεργητική περίοδο.");
        this.addQuestion_3(q19_3);
        Question_3 q20_3 = new Question_3("Ποια από τις παρακάτω επιλογές αποτελεί τεχνική ολοκληρωμένης φυτοπροστασίας",
                "Οι επαναλαμβανόμενοι ψεκασμοί " +
                        "κάλυψης με γεωργικά φάρμακα.",
                "Η αραιή φύτευση της καλλιέργειας.",
                "Η υπερβολική χρήση λιπασμάτων.",
                "Η καταπολέμηση εντόμων με παγίδες.",
                "Η καταπολέμηση εντόμων με παγίδες.");
        this.addQuestion_3(q20_3);
        Question_3 q21_3 = new Question_3("Τι από τα παρακάτω είναι σωστό για τις μέλισσες;",
                "Αυξάνουν την παραγωγή οπωροφόρων " +
                        "μέσω της επικονίασης.",
                "Συμβάλλουν στη διατήρηση της βιοποικιλότητας.",
                "Μελισσοτοξικά σκευάσματα " +
                        "απαγορεύεται να χρησιμοποιούνται κατά " +
                        "την άνθηση των φυτών.",
                "Όλες οι άλλες απαντήσεις είναι σωστές.",
                "Όλες οι άλλες απαντήσεις είναι σωστές.");
        this.addQuestion_3(q21_3);
        Question_3 q22_3 = new Question_3("Διασυστηματικό εντομοκτόνο είναι αυτό που…",
                "Εφαρμόζεται μετά το φύτρωμα της καλλιέργειας " +
                        "για καταπολέμηση όλων των εντόμων που " +
                        "προσβάλλουν την καλλιέργεια.",
                "Απορροφάται από τα φυτά και μπορεί να " +
                        "καταπολεμήσει τα έντομα που αναφέρονται στην " +
                        "ετικέτα του",
                "Απορροφάται από τα φυτά και μπορεί να " +
                        "καταπολεμήσει ακόμη και τα έντομα που " +
                        "προσβάλλουν την επόμενη καλλιέργεια",
                "Εφαρμόζεται μετά το φύτρωμα της καλλιέργειας για " +
                        "καταπολέμηση όλων των εντόμων που προσβάλλουν " +
                        "την καλλιέργεια.",
                "Απορροφάται από τα φυτά και μπορεί να " +
                        "καταπολεμήσει τα έντομα που αναφέρονται στην " +
                        "ετικέτα του");
        this.addQuestion_3(q22_3);
        Question_3 q23_3 = new Question_3("Μεταφυτρωτικό εκλεκτικό ζιζανιοκτόνο είναι αυτό που…",
                "Έχει εγκριθεί μέσα από διασυστηματική " +
                        "εξέταση.",
                "Μπορεί να καταπολεμήσει εχθρούς και ασθένειες σε όλο το " +
                        "φυτό.",
                "Πρέπει να εφαρμόζεται από όλους τους " +
                        "αγρότες μιας περιοχής για να δράσει.",
                "Μετά την εφαρμογή του καταστρέφει συγκεκριμένα ζιζάνια " +
                        "και όχι την καλλιέργεια που εφαρμόζεται",
                "Μετά την εφαρμογή του καταστρέφει συγκεκριμένα ζιζάνια " +
                        "και όχι την καλλιέργεια που εφαρμόζεται");
        this.addQuestion_3(q23_3);
        Question_3 q24_3 = new Question_3("Αμειψισπορά είναι…",
                "Η εναλλαγή διαφορετικών γεωργικών " +
                        "φαρμάκων στο ίδιο χωράφι",
                "Η εναλλαγή διαφορετικών καλλιεργειών στο ίδιο χωράφι",
                "Η εναλλαγή διαφορετικών ποικιλιών μιας " +
                        "καλλιέργειας στο ίδιο χωράφι.",
                "Η εναλλαγή βιολογικής και ολοκληρωμένης " +
                        "φυτοπροστασίας στο ίδιο χωράφι.",
                "Η εναλλαγή διαφορετικών καλλιεργειών στο ίδιο χωράφι");
        this.addQuestion_3(q24_3);
        Question_3 q25_3 = new Question_3("Ποια από τις παρακάτω επιλογές αποτελεί τεχνική ολοκληρωμένης φυτοπροστασίας;",
                "Επαναλαμβανόμενος ψεκασμός με " +
                        "ζιζανιοκτόνα.",
                "Όψιμη φύτευση αφού φυτρώσουν τα ζιζάνια.",
                "Πρώιμη φύτευση πριν φυτρώσουν τα " +
                        "ζιζάνια.",
                "Αραιή φύτευση σε σημεία που δεν φυτρώνουν ζιζάνια.",
                "Πρώιμη φύτευση πριν φυτρώσουν τα " +
                        "ζιζάνια.");
        this.addQuestion_3(q25_3);
        Question_3 q26_3 = new Question_3("Ποια από τις παρακάτω επιλογές αποτελεί τεχνική ολοκληρωμένης φυτοπροστασίας;",
                "Συγκαλλιέργεια με εδαφοκάλυψη και " +
                        "χημική απολύμανση εδάφους.",
                "Συγκαλλιέργεια χωρίς εδαφοκάλυψη και χημική " +
                        "απολύμανση εδάφους.",
                "Συγκαλλιέργεια και χημική απολύμανση " +
                        "εδάφους.",
                "Συγκαλλιέργεια με εδαφοκάλυψη.",
                "Συγκαλλιέργεια με εδαφοκάλυψη.");
        this.addQuestion_3(q26_3);
        Question_3 q27_3 = new Question_3("Η καλλιέργεια γειτονεύει με σχολείο. Ο παραγωγός μπορεί να χρησιμοποιεί γεωργικά φάρμακα",
                "Μόνο το καλοκαίρι που κλείνει το " +
                        "σχολείο.",
                "Μόνο εφόσον τηρεί συγκεκριμένες αποστάσεις από το " +
                        "σχολείο αναλόγως της τοξικότητας του γεωργικού " +
                        "φαρμάκου.",
                "Μόνο το Σαββατοκύριακο που κλείνει το " +
                        "σχολείο.",
                "Μόνο εφόσον είναι παρών ο Διευθυντής του σχολείου.",
                "Μόνο εφόσον τηρεί συγκεκριμένες αποστάσεις από το " +
                        "σχολείο αναλόγως της τοξικότητας του γεωργικού " +
                        "φαρμάκου.");
        this.addQuestion_3(q27_3);
        Question_3 q28_3 = new Question_3("Σε ποιες καλλιέργειες δίνεται προτεραιότητα στη χρήση μπεκ μειωμένης διασποράς;",
                "Στο βαμβάκι.",
                "Σε χαμηλού ύψους λαχανικά, όπως μαρούλι και " +
                        "χόρτα.",
                "Στις καλλιέργειες κατακόρυφης ανάπτυξης όπως " +
                        "οι οπωρώνες και οι αμπελώνες.",
                "Σε φυτά μεγάλης καλλιέργειας όπως στάρι και " +
                        "κριθάρι.",
                "Στις καλλιέργειες κατακόρυφης ανάπτυξης όπως " +
                        "οι οπωρώνες και οι αμπελώνες.");
        this.addQuestion_3(q28_3);
        Question_3 q29_3 = new Question_3("Δεν υπάρχει κίνδυνος δηλητηρίασης διερχόμενων ζώων, εφόσον",
                "Το πλύσιμο του βυτίου γίνεται στο χωράφι.",
                "Τα χρησιμοποιούμενα γεωργικά φάρμακα δεν είναι " +
                        "δηλητήρια.",
                "Υπάρχουν διαρροές από το ψεκαστικό " +
                        "μηχάνημα.",
                "Μετά τον ψεκασμό σταματάει αμέσως η λειτουργία των " +
                        "μπεκ .",
                "Μετά τον ψεκασμό σταματάει αμέσως η λειτουργία των " +
                        "μπεκ .");
        this.addQuestion_3(q29_3);
        Question_3 q30_3 = new Question_3("Με τη σωστή συντήρηση του εξοπλισμού εφαρμογής γεωργικών φαρμάκων επιτυγχάνεται:",
                "Μεγάλη μείωση του κόστους " +
                        "καταπολέμησης.",
                "Διατήρηση του χρώματος της δεξαμενής για " +
                        "μεγαλύτερο χρονικό διάστημα.",
                "Μεταφορά των σταγονιδίων ψεκαστικού " +
                        "υγρού σε μεγαλύτερες αποστάσεις.",
                "Η ελάχιστη δυνατή ανάδευση του ψεκαστικού υγρού " +
                        "στη δεξαμενή.",
                "Μεγάλη μείωση του κόστους " +
                        "καταπολέμησης.");
        this.addQuestion_3(q30_3);
        Question_3 q31_3 = new Question_3("Η προετοιμασία του εξοπλισμού εφαρμογής γεωργικών φαρμάκων για την επόμενη χρήση " +
                "περιλαμβάνει :",
                "Πλύση της δεξαμενής ψεκαστικού υγρού και " +
                        "των λοιπών συστημάτων (αντλία, φίλτρα, " +
                        "σωληνώσεις κ.ο.κ) και ψεκασμός αυτού σε " +
                        "κατάλληλη έκταση μακριά από επιφανειακά " +
                        "νερά.",
                "Υπολογισμός της ταχύτητας του ελκυστήρα για την " +
                        "εφαρμογή του ψεκαστικού υγρού, σε συνάρτηση με " +
                        "τον όγκο του ψεκαστικού υγρού και την παροχή των " +
                        "ακροφυσίων (βαθμονόμηση).",
                "Οπτικός έλεγχος για πιθανά σημεία " +
                        "διαρροών (δεξαμενή, σωληνώσεις, αντλία " +
                        "κλπ), για τυχόν φθορές και για την ύπαρξη " +
                        "προφυλακτήρων στο σύστημα μετάδοσης " +
                        "κίνησης.",
                "Το σύνολο των αναφερομένων στις άλλες απαντήσεις " +
                        "ενεργειών.",
                "Το σύνολο των αναφερομένων στις άλλες απαντήσεις " +
                        "ενεργειών.");
        this.addQuestion_3(q31_3);
        Question_3 q32_3 = new Question_3("Η βαθμονόμηση του εξοπλισμού εφαρμογής γεωργικών φαρμάκων:",
                "Είναι η απαραίτητη προετοιμασία πριν από " +
                        "κάθε εφαρμογή γεωργικού φαρμάκου, για " +
                        "την ελαχιστοποίηση των κινδύνων στην " +
                        "καλλιέργεια, στον χρήστη, στο περιβάλλον.",
                "Είναι σημαντική για να εξασφαλιστεί μια " +
                        "στοχοθετημένη χρήση των γεωργικών φαρμάκων και " +
                        "για να επιτευχθεί το βέλτιστο αποτέλεσμα.",
                "Είναι καθοριστική διαδικασία για να " +
                        "αποφευχθεί η περίσσεια του ψεκαστικού " +
                        "υγρού κατά το τέλος της εργασίας ψεκασμού.",
                "Το σύνολο των άλλων απαντήσεων είναι σωστό.",
                "Το σύνολο των άλλων απαντήσεων είναι σωστό.");
        this.addQuestion_3(q32_3);
        Question_3 q33_3 = new Question_3("Η βαθμονόμηση του εξοπλισμού εφαρμογής γεωργικών φαρμάκων:",
                "Συνίσταται στον υπολογισμό της ταχύτητας του " +
                        "ελκυστήρα με την οποία πρέπει να γίνει η εφαρμογή " +
                        "του γεωργικού φαρμάκου, γνωρίζοντας την παροχή " +
                        "των ακροφυσίων που έχω επιλέξει και " +
                        "χρησιμοποιώντας την αραίωση του γεωργικού " +
                        "φαρμάκου όπως συστήνεται στην ετικέτα του.",
                "Συνίσταται στον υπολογισμό της παροχής των " +
                        "ακροφυσίων, με βάση την ταχύτητα και τον " +
                        "χρόνο που θέλω να διαθέσω για να ολοκληρώσω " +
                        "τον ψεκασμό καθώς και την αραίωση του " +
                        "γεωργικού φαρμάκου που συστήνει η ετικέτα " +
                        "του.",
                "Δεν είναι απαραίτητη να γίνεται σε κάθε ψεκασμό " +
                        "και ιδιαιτέρως εφόσον χρησιμοποιείται ψεκαστικό " +
                        "διάλυμα υψηλής αραίωσης.",
                "Όλες οι άλλες απαντήσεις είναι σωστές.",
                "Συνίσταται στον υπολογισμό της ταχύτητας του " +
                        "ελκυστήρα με την οποία πρέπει να γίνει η εφαρμογή " +
                        "του γεωργικού φαρμάκου, γνωρίζοντας την παροχή " +
                        "των ακροφυσίων που έχω επιλέξει και " +
                        "χρησιμοποιώντας την αραίωση του γεωργικού " +
                        "φαρμάκου όπως συστήνεται στην ετικέτα του.");
        this.addQuestion_3(q33_3);
        Question_3 q34_3 = new Question_3("Παράγοντες που αυξάνουν τις πιθανότητες αερομεταφοράς είναι :",
                "Ο δυνατός άνεμος ή η αυξημένη πίεση ψεκασμού.",
                "Υψηλή ταχύτητα εργασίας ή η χρήση " +
                        "ακατάλληλου μεγέθους ακροφυσίων.",
                "Μεγαλύτερη από την συνιστώμενη απόστα- ση των " +
                        "ακροφυσίων από την επιφάνεια στόχο ή λάθος " +
                        "προσανατολισμός αυτών.",
                "Όλοι οι παράγοντες που αναφέρονται στις άλλες " +
                        "απαντήσεις αυξάνουν τις πιθανότητες " +
                        "αερομεταφοράς.",
                "Όλοι οι παράγοντες που αναφέρονται στις άλλες " +
                        "απαντήσεις αυξάνουν τις πιθανότητες " +
                        "αερομεταφοράς.");
        this.addQuestion_3(q34_3);
        Question_3 q35_3 = new Question_3("Το μανόμετρο πρέπει :",
                "Να έχει εύρος 80 bar όταν προορίζεται για " +
                        "νεφελοψεκαστήρα.",
                "Δεν είναι απαραίτητο να λειτουργεί όταν γνωρίζουμε " +
                        "την πίεση λειτουργίας της αντλίας.",
                "Να είναι κατάλληλης κλίμακας, ανάλογα με " +
                        "το είδος του εξοπλισμού εφαρμογής και να " +
                        "είναι ευανάγνωστο από τη θέση του χειριστή.",
                "Να έχει ένδειξη (λαμπάκι) που να υποδεικνύει άμεσα " +
                        "τυχόν διαρροή.",
                "Να είναι κατάλληλης κλίμακας, ανάλογα με " +
                        "το είδος του εξοπλισμού εφαρμογής και να " +
                        "είναι ευανάγνωστο από τη θέση του χειριστή.");
        this.addQuestion_3(q35_3);
        Question_3 q36_3 = new Question_3("Η βαλβίδα ασφαλείας εφόσον υπάρχει :",
                "Ενεργοποιείται όταν γίνεται υπέρβαση της " +
                        "πίεσης λειτουργίας και εκτονώνεται στη " +
                        "δεξαμενή.",
                "Ενεργοποιείται όταν γίνεται υπέρβαση της πίεσης " +
                        "λειτουργίας και εκτονώνεται στο περιβάλλον.",
                "Όταν ενεργοποιηθεί διακόπτει τη λειτουργία " +
                        "του ψεκαστικού μηχανήματος.",
                "Δεν μπορεί να χρησιμοποιηθεί όταν ψεκάζουμε με " +
                        "ζιζανιοκτόνο.",
                "Ενεργοποιείται όταν γίνεται υπέρβαση της " +
                        "πίεσης λειτουργίας και εκτονώνεται στη " +
                        "δεξαμενή.");
        this.addQuestion_3(q36_3);
        Question_3 q37_3 = new Question_3("Τα ακροφύσια των ψεκαστήρων μεγάλων καλλιεργειών:",
                "Μπορούν να αντικαθίστανται κατά τη διάρκεια " +
                        "του ψεκασμού αν είναι βουλωμένα.",
                "Πρέπει να τοποθετούνται σε ίσες αποστάσεις " +
                        "μεταξύ τους.",
                "Επιτρέπεται να στάζουν μέχρι 30 δευτερόλεπτα " +
                        "μετά την παύση λειτουργίας του ψεκαστικού " +
                        "μηχανήματος.",
                "Πρέπει να ελέγχονται κάθε 10 ημέρες.",
                "Πρέπει να τοποθετούνται σε ίσες αποστάσεις " +
                        "μεταξύ τους.");
        this.addQuestion_3(q37_3);
        Question_3 q38_3 = new Question_3("Η αντλία ψεκασμού :",
                "Δεν είναι από τα σημαντικά μέρη του " +
                        "εξοπλισμού εφαρμογής γεωργικών " +
                        "φαρμάκων.",
                "Αν παρουσιάζει δονήσεις σημαίνει ότι πρέπει να " +
                        "προσαρμόσουμε την ταχύτητα ψεκασμού.",
                "Οποιαδήποτε διαρροή παρουσιάσει είναι " +
                        "άνευ σημασίας, αν εξασφαλίζεται σταθερή " +
                        "πίεση.",
                "Πρέπει να εξασφαλίζει σταθερή παροχή ψεκαστικού " +
                        "υγρού, να μην παρουσιάζει δονήσεις και διαρροές στην " +
                        "αναρρόφηση ή στην κατάθλιψη.",
                "Πρέπει να εξασφαλίζει σταθερή παροχή ψεκαστικού " +
                        "υγρού, να μην παρουσιάζει δονήσεις και διαρροές στην " +
                        "αναρρόφηση ή στην κατάθλιψη.");
        this.addQuestion_3(q38_3);
        Question_3 q39_3 = new Question_3("Η ανάδευση του ψεκαστικού υγρού :",
                "Δεν είναι απαραίτητη αν το φάρμακο είναι " +
                        "υδατοδιαλυτό.",
                "Επιβάλλεται μόνο στις περιπτώσεις που το φάρμακο " +
                        "είναι σε μορφή σκόνης.",
                "Επιβάλλεται πάντα ώστε να επιτυγχάνεται η " +
                        "ίδια συγκέντρωση φυτοφαρμάκου σε όλο τον " +
                        "όγκο του ψεκαστικού υγρού μέσα στη " +
                        "δεξαμενή.",
                "Στις μικρές δεξαμενές μπορεί να γίνεται με το χέρι " +
                        "εφόσον φοράμε γάντια.",
                "Επιβάλλεται πάντα ώστε να επιτυγχάνεται η " +
                        "ίδια συγκέντρωση φυτοφαρμάκου σε όλο τον " +
                        "όγκο του ψεκαστικού υγρού μέσα στη " +
                        "δεξαμενή.");
        this.addQuestion_3(q39_3);
        Question_3 q40_3 = new Question_3("Για τη δεξαμενή ψεκαστικού υγρού:",
                "Δεν είναι σημαντικό να γνωρίζουμε επακριβώς " +
                        "τον όγκο της.",
                "Πρέπει να υπάρχει ευκρινής δείκτης περιεχομένου, " +
                        "ορατός από τη θέση του χειριστή.",
                "Μία αυξημένη τραχύτητα στην εσωτερική " +
                        "επιφάνεια της δεξαμενής, βοηθάει στην καλή " +
                        "ανάδευση του περιεχομένου.",
                "Το σύστημα ανάδευσης δεν είναι υποχρεωτικό.",
                "Πρέπει να υπάρχει ευκρινής δείκτης περιεχομένου, " +
                        "ορατός από τη θέση του χειριστή.");
        this.addQuestion_3(q40_3);


    }

    private void addQuestions_4() {
        Question_4 q1_4 = new Question_4("Πριν αγοράσω ένα γεωργικό φάρμακο, για να βεβαιωθώ ότι είναι νόμιμο, διαβάζω στην ετικέτα:",
                "Τη βιομηχανία που το έφτιαξε.",
                "Την εμπορική ονομασία του ή τη δραστική του ουσία.",
                "Τον αριθμό έγκρισης από χώρα της " +
                        "Ευρωπαϊκής Ένωσης.",
                "Τον αριθμό έγκρισης του Υπουργείου Αγροτικής Ανάπτυξης " +
                        "και Τροφίμων.",
                "Τον αριθμό έγκρισης του Υπουργείου Αγροτικής Ανάπτυξης " +
                        "και Τροφίμων.");
        this.addQuestion_4(q1_4);
        Question_4 q2_4 = new Question_4("Σε ποιες περιπτώσεις χρησιμοποιούμε ένα γεωργικό φάρμακο που δεν έχει έγκριση στην καλλιέργεια " +
                "μας αλλά κυκλοφορεί νόμιμα στην Ελληνική αγορά;",
                "Μόνο αν έχει έγκριση για παρόμοια " +
                        "καλλιέργεια",
                "Μόνο εάν καταπολεμάει το ίδιο έντομο ή ασθένεια ή " +
                        "ζιζάνιο σε άλλη καλλιέργεια και έχει έγκριση για αυτό",
                "Μόνο αν μου πει ο γεωπόνος ότι είναι " +
                        "αποτελεσματικό.",
                "Ποτέ.",
                "Ποτέ.");
        this.addQuestion_4(q2_4);
        Question_4 q3_4 = new Question_4("Η χρήση γεωργικού φαρμάκου από γειτονικές χώρες επιτρέπεται όταν:",
                "Παλιά είχε έγκριση στην Ελλάδα.",
                "Γνωρίζουμε ότι είναι ιδιαίτερα αποτελεσματικό.",
                "Ποτέ.",
                "Δεν μπορούμε να το βρούμε στα καταστήματα της " +
                        "Ελλάδας.",
                "Ποτέ.");
        this.addQuestion_4(q3_4);
        Question_4 q4_4 = new Question_4("Οι παραγωγοί διατηρούν αρχεία για κάθε χρήση γεωργικών φαρμάκων",
                "Για τουλάχιστον ένα έτος.",
                "Για τουλάχιστον πέντε έτη.",
                "Για τουλάχιστον τρία έτη.",
                "Για τουλάχιστον δέκα έτη.",
                "Για τουλάχιστον τρία έτη.");
        this.addQuestion_4(q4_4);
        Question_4 q5_4 = new Question_4("Οι κίνδυνοι για τους περαστικούς και επισκέπτες, κατά την διάρκεια εφαρμογής γεωργικού " +
                "φαρμάκου, είναι μεγαλύτεροι όταν:",
                "Δεν τους έχουμε ειδοποιήσει ότι έχει γίνει " +
                        "ψεκασμός ή άλλη εφαρμογή γεωργικού " +
                        "φαρμάκου.",
                "Είναι άνοιξη και έχουν αλλεργία.",
                "Δεν φοράνε τα μάλλινα ρούχα.",
                "Είναι πιο κοντοί από το ύψος της καλλιέργειας που " +
                        "ψεκάστηκε.",
                "Δεν τους έχουμε ειδοποιήσει ότι έχει γίνει " +
                        "ψεκασμός ή άλλη εφαρμογή γεωργικού " +
                        "φαρμάκου.");
        this.addQuestion_4(q5_4);
        Question_4 q6_4 = new Question_4("Ανησυχούμε για πιθανή δηλητηρίαση όταν κάποιος που έχει έρθει σε επαφή με γεωργικό φάρμακο:",
                "Έχει ζαλάδα, ή δύσπνοια, ή ανησυχία, ή τρέμουλο " +
                        "ή τάση για εμετό.",
                "Έχει ερεθισμό του δέρματος, ή φαγούρα, ή " +
                        "κοκκινίλες.",
                "Έχει ζαλάδα, ή δύσπνοια, ή ανησυχία, ή τρέμουλο " +
                        "ή τάση για εμετό και ερεθισμό του δέρματος, ή " +
                        "φαγούρα, ή κοκκινίλες .",
                "Παρουσιάζει έστω ένα σύμπτωμα από τα " +
                        "αναφερόμενα στις άλλες απαντήσεις.",
                "Παρουσιάζει έστω ένα σύμπτωμα από τα " +
                        "αναφερόμενα στις άλλες απαντήσεις.");
        this.addQuestion_4(q6_4);
        Question_4 q7_4 = new Question_4("Εφόσον αντιληφθούμε κατάποση γεωργικού φαρμάκου:",
                "Χορηγούμε αμέσως εμετικό",
                "Χορηγούμε εμετικό εφόσον ο ασθενής έχει τις " +
                        "αισθήσεις του.",
                "Ακολουθούμε τις οδηγίες της ετικέτας και ζητάμε " +
                        "άμεσα ιατρική συμβουλή.",
                "Επικοινωνούμε με το κατάστημα που προμήθευσε " +
                        "το γεωργικό φάρμακο .",
                "Ακολουθούμε τις οδηγίες της ετικέτας και ζητάμε " +
                        "άμεσα ιατρική συμβουλή.");
        this.addQuestion_4(q7_4);
        Question_4 q8_4 = new Question_4("Τα γεωργικά φάρμακα που ενσωματώνονται στο έδαφος:",
                "Δεν έχουν καμία επίδραση στα πουλιά.",
                "Έχουν επίδραση μόνο στις κότες",
                "Έχουν επιδράσεις μόνο στα πουλιά που " +
                        "φωλιάζουν στο έδαφος.",
                "Μπορεί να έχουν επιδράσεις στα πουλιά, αν δεν " +
                        "γίνει καλή ενσωμάτωση.",
                "Μπορεί να έχουν επιδράσεις στα πουλιά, αν δεν " +
                        "γίνει καλή ενσωμάτωση.");
        this.addQuestion_4(q8_4);
        Question_4 q9_4 = new Question_4("Ποιος είναι ο πιο συχνός τρόπος εισόδου μεγάλων ποσοτήτων γεωργικών φαρμάκων στον " +
                "ανθρώπινο οργανισμό;",
                "Απορρόφηση από το δέρμα.",
                "Με την εισπνοή.",
                "Με την κατάποση.",
                "Μέσω των φρούτων / λαχανικών που τρώμε.",
                "Απορρόφηση από το δέρμα.");
        this.addQuestion_4(q9_4);
        Question_4 q10_4 = new Question_4("Κατά την παρασκευή του ψεκαστικού διαλύματος φοράω ανθεκτικά γάντια νιτριλίου;",
                "Κάτω από τη φόρμα προστασίας.",
                "Πάνω από τη φόρμα προστασίας.",
                "Πάνω από μάλλινα γάντια.",
                "Μόνο εάν βάλω το χέρι μου μέσα στο βυτίο με το " +
                        "ψεκαστικό υγρό.",
                "Πάνω από τη φόρμα προστασίας.");
        this.addQuestion_4(q10_4);
        Question_4 q11_4 = new Question_4("Η παρασκευή του ψεκαστικού διαλύματος γίνεται:",
                "Μέσα στην αποθήκη των γεωργικών φαρμάκων.",
                "Σε καλά αεριζόμενο χώρο με στεγανό δάπεδο.",
                "Στο χώμα εντός της καλλιέργειας.",
                "Στο χώμα αλλά εκτός της καλλιέργειας.",
                "Σε καλά αεριζόμενο χώρο με στεγανό δάπεδο.");
        this.addQuestion_4(q11_4);
        Question_4 q12_4 = new Question_4("Ξεπλένω τρεις (3) φορές τις κενές συσκευασίες με καθαρό νερό και ρίχνω το νερό:",
                "Στο ψεκαστικό βυτίο.",
                "Στο χωράφι .",
                "Στην αποχέτευση.",
                "Σε άλλο δοχείο όπου συγκεντρώνω τα υγρά.",
                "Στο ψεκαστικό βυτίο.");
        this.addQuestion_4(q12_4);
        Question_4 q13_4 = new Question_4("Αν η καλλιέργεια μου γειτνιάζει με επιφανειακά ύδατα (ποτάμι, λίμνη, ρυάκι, στραγγιστικό δίκτυο), " +
                "τότε:",
                "Κατά τον ψεκασμό ψεκάζω και στο νερό " +
                        "για να αποφύγω εξάπλωση ασθενειών από " +
                        "αυτό στην καλλιέργεια μου.",
                "Λαμβάνω όλα τα απαραίτητα μέτρα ώστε να μην φτάσει " +
                        "γεωργικό φάρμακο στο νερό.",
                "Δεν εφαρμόζω εντομοκτόνα που έχουν " +
                        "τοξικότητα στα ψάρια.",
                "Δεν εφαρμόζω ζιζανιοκτόνα που έχουν τοξικότητα στα " +
                        "φύκη.",
                "Λαμβάνω όλα τα απαραίτητα μέτρα ώστε να μην φτάσει " +
                        "γεωργικό φάρμακο στο νερό.");
        this.addQuestion_4(q13_4);
        Question_4 q14_4 = new Question_4("Αν στο αγροτεμάχιο που ψεκάζω υπάρχει γεώτρηση ή πηγάδι τότε:",
                "Ρίχνω το περισσευούμενο ψεκαστικό υγρό " +
                        "μέσα στη γεώτρηση-πηγάδι για να μην " +
                        "δηλητηριαστούν πουλιά και ζώα.",
                "Δεν ψεκάζω κοντά στη γεώτρηση-πηγάδι ούτε ξεπλένω το " +
                        "ψεκαστικό εκεί.",
                "Ψεκάζω γύρω από τη γεώτρηση",
                "Ξεπλένω το ψεκαστικό στη γεώτρηση-πηγάδι.",
                "Δεν ψεκάζω κοντά στη γεώτρηση-πηγάδι ούτε ξεπλένω το " +
                        "ψεκαστικό εκεί.");
        this.addQuestion_4(q14_4);
        Question_4 q15_4 = new Question_4("Αν περισσέψει μικρή ποσότητα ψεκαστικού υγρού στον ψεκαστήρα",
                "Το αδειάζουμε στο δρόμο καθώς " +
                        "επιστρέφουμε στο σπίτι μας",
                "Το αδειάζουμε στο σημείο γεμίσματος των ψεκαστικών",
                "Το αδειάζουμε σημειακά στο χωράφι ή " +
                        "σε γειτονικό κανάλι",
                "Το αραιώνουμε με νερό και το ψεκάζουμε",
                "Το αραιώνουμε με νερό και το ψεκάζουμε");
        this.addQuestion_4(q15_4);
        Question_4 q16_4 = new Question_4("Η παρακολούθηση της υγείας των ψεκαστών γεωργικών φαρμάκων πρέπει να γίνεται:",
                "Με ετήσιο καρδιογράφημα.",
                "Με τακτικές εξετάσεις αφού ενημερώσουμε τον γιατρό για " +
                        "την ενασχόληση με τα γεωργικά φάρμακα.",
                "Σε κάθε περίπτωση δηλητηρίασης.",
                "Μόνο εφόσον εφαρμόζουμε τα γεωργικά φάρμακα χωρίς " +
                        "να φοράμε μπότες και γάντια.",
                "Με τακτικές εξετάσεις αφού ενημερώσουμε τον γιατρό για " +
                        "την ενασχόληση με τα γεωργικά φάρμακα.");
        this.addQuestion_4(q16_4);
        Question_4 q17_4 = new Question_4("Η μετάδοση επιβλαβών (φυτοπαθογόνων) οργανισμών από τα χρησιμοποιούμενα μηχανήματα και " +
                "τον εξοπλισμό γίνεται όταν:",
                "Είναι παλαιά.",
                "Δεν καθαρίζονται τακτικά.",
                "Είναι καινούρια.",
                "Δεν ρυθμίζονται σωστά τα μπεκ.",
                "Δεν καθαρίζονται τακτικά.");
        this.addQuestion_4(q17_4);
        Question_4 q18_4 = new Question_4("Οι ανθεκτικές ποικιλίες φυτών, πρέπει να προτιμούνται:",
                "Μόνο εφόσον υπάρχει σχετική εντολή " +
                        "από τις αρμόδιες αρχές.",
                "Μόνο εφόσον επιδοτούνται.",
                "Μόνο εφόσον υπάρχει σε έξαρση μια " +
                        "ασθένεια.",
                "Πάντα, εφόσον βοηθούν στην προληπτική αντιμετώπιση " +
                        "του παθογόνου.",
                "Πάντα, εφόσον βοηθούν στην προληπτική αντιμετώπιση " +
                        "του παθογόνου.");
        this.addQuestion_4(q18_4);
        Question_4 q19_4 = new Question_4("Για να προστατέψω ένα ωφέλιμο έντομο στο χωράφι μου…",
                "Εφαρμόζω μέτρα βιολογικού ελέγχου και αν " +
                        "χρειαστεί γεωργικά φάρμακα, που σύμφωνα με " +
                        "τις συμβουλές του γεωπόνου δεν επηρεάζουν " +
                        "την ανάπτυξή του.",
                "Δεν ψεκάζω ποτέ με ζιζανιοκτόνα.",
                "Δεν χρησιμοποιώ χημικά λιπάσματα.",
                "Δεν ψεκάζω με υψηλή θερμοκρασία.",
                "Εφαρμόζω μέτρα βιολογικού ελέγχου και αν " +
                        "χρειαστεί γεωργικά φάρμακα, που σύμφωνα με " +
                        "τις συμβουλές του γεωπόνου δεν επηρεάζουν " +
                        "την ανάπτυξή του.");
        this.addQuestion_4(q19_4);
        Question_4 q20_4 = new Question_4("Με τις παγίδες με κόλλα μπορώ:",
                "Να παρακολουθώ αν έχει γίνει σωστός " +
                        "ψεκασμός ενός γεωργικού φαρμάκου.",
                "Να παρακολουθώ αν έβρεξε.",
                "Να ελέγχω την κατάσταση του χωραφιού μου.",
                "Να παρακολουθώ τον πληθυσμό επιβλαβών εντόμων.",
                "Να παρακολουθώ τον πληθυσμό επιβλαβών εντόμων.");
        this.addQuestion_4(q20_4);
        Question_4 q21_4 = new Question_4("Με σκοπό την αποφυγή μολύνσεων του ξύλου μετά το κλάδεμα των δένδρων…",
                "Γίνεται προληπτικός ψεκασμός του δένδρου με " +
                        "μυκητοκτόνα πριν το κλάδεμα.",
                "Μεσαίες και μεγάλες τομές καλύπτονται με ειδικό " +
                        "επουλωτικό πληγών.",
                "Διατηρείται στρώμα από ζιζάνια στο έδαφος " +
                        "κάτω από το δένδρο.",
                "Ο κλαδευτής των δένδρων φορά ειδικά γάντια.",
                "Μεσαίες και μεγάλες τομές καλύπτονται με ειδικό " +
                        "επουλωτικό πληγών.");
        this.addQuestion_4(q21_4);
        Question_4 q22_4 = new Question_4("Το καλό κλάδεμα με την αφαίρεση των προσβεβλημένων κλάδων και ο αερισμός του δέντρου που " +
                "προκύπτει από το κλάδεμα …",
                "Πρέπει να γίνεται μετά την εφαρμογή των " +
                        "γεωργικών φαρμάκων.",
                "Αποτελούν μέτρο έκτακτης ανάγκης.",
                "Δεν επηρεάζουν τις ανάγκες του δένδρου για " +
                        "εφαρμογή γεωργικών φαρμάκων.",
                "Είναι το πρώτο μέτρο μείωσης των προσβολών από " +
                        "εχθρούς (κυρίως κοκκοειδή) και ασθένειες.",
                "Είναι το πρώτο μέτρο μείωσης των προσβολών από " +
                        "εχθρούς (κυρίως κοκκοειδή) και ασθένειες.");
        this.addQuestion_4(q22_4);
        Question_4 q23_4 = new Question_4("Η οξαλίδα (ζιζάνιο) μπορεί να χρησιμοποιηθεί:",
                "Για παραγωγή τσαγιού.",
                "Σε τίποτα.",
                "Για εδαφοκάλυψη και περιορισμό των ζιζανίων " +
                        "στην ελιά, στο αμπέλι και στα εσπεριδοειδή.",
                "Για περιορισμό των εντόμων.",
                "Για εδαφοκάλυψη και περιορισμό των ζιζανίων " +
                        "στην ελιά, στο αμπέλι και στα εσπεριδοειδή.");
        this.addQuestion_4(q23_4);
        Question_4 q24_4 = new Question_4("Τα προφυτρωτικά ζιζανιοκτόνα εφαρμόζονται:",
                "Αποκλειστικά για στενόφυλλα ζιζάνια.",
                "Πριν το φύτρωμα της καλλιέργειας.",
                "Αποκλειστικά για πλατύφυλλα ζιζάνια.",
                "Μετά το φύτρωμα της καλλιέργειας",
                "Πριν το φύτρωμα της καλλιέργειας.");
        this.addQuestion_4(q24_4);
        Question_4 q25_4 = new Question_4("Η καλύτερη εποχή για την εφαρμογή της ηλιαπολύμανσης είναι:",
                "Ο χειμώνας.",
                "Η άνοιξη.",
                "Το καλοκαίρι.",
                "Το φθινόπωρο.",
                "Το καλοκαίρι.");
        this.addQuestion_4(q25_4);
        Question_4 q26_4 = new Question_4("Η ηλιαπολύμανση εφαρμόζεται:",
                "Μόνο σε καλλιέργειες θερμοκηπίου.",
                "Μόνο σε φρούτα και λαχανικά.",
                "Μόνο σε λαχανικά.",
                "Σε πολλές καλλιέργειες.",
                "Σε πολλές καλλιέργειες.");
        this.addQuestion_4(q26_4);
        Question_4 q27_4 = new Question_4("Για να προστατέψω τους υδάτινους πόρους (λίμνες, ποτάμια κλπ) που τυχόν βρίσκονται κοντά " +
                "στην καλλιέργειά μου;",
                "Δεν χρησιμοποιώ γεωργικά φάρμακα με σήμανση " +
                        "τοξικό ή δηλητήριο.",
                "Όταν χρησιμοποιώ γεωργικά φάρμακα, τα " +
                        "εφαρμόζω κρατώντας κατάλληλη απόσταση από " +
                        "τους υδάτινους πόρους.",
                "Χρησιμοποιώ μόνον γεωργικά φάρμακα στερεάς " +
                        "μορφής (σκόνες, κοκκώδη κλπ).",
                "Χρησιμοποιώ μόνον νεφελοψεκαστήρες.",
                "Όταν χρησιμοποιώ γεωργικά φάρμακα, τα " +
                        "εφαρμόζω κρατώντας κατάλληλη απόσταση από " +
                        "τους υδάτινους πόρους.");
        this.addQuestion_4(q27_4);
        Question_4 q28_4 = new Question_4("Η απόρριψη των κενών συσκευασίας σε αρδευτικά κανάλια",
                "Δεν επηρεάζει τους υδάτινους πόρους (λίμνες, " +
                        "ποτάμια κλπ) που τυχόν βρίσκονται κοντά στην " +
                        "καλλιέργειά μου.",
                "Δεν τιμωρείται από την νομοθεσία.",
                "Ρυπαίνει τους υδάτινους πόρους (λίμνες, ποτάμια " +
                        "κλπ) και εν γένει το περιβάλλον.",
                "Δεν επηρεάζει το περιβάλλον αν τα γεωργικά " +
                        "φάρμακα δεν είναι τοξικά",
                "Ρυπαίνει τους υδάτινους πόρους (λίμνες, ποτάμια " +
                        "κλπ) και εν γένει το περιβάλλον.");
        this.addQuestion_4(q28_4);
        Question_4 q29_4 = new Question_4("Για την ασφάλεια του χρήστη :",
                "Δεν είναι απαραίτητη η ύπαρξη προφυλακτήρων " +
                        "του δυναμοδότη.",
                "Είναι απαραίτητη η ύπαρξη προφυλακτήρα στον " +
                        "δυναμοδότη και στον δυναμολήπτη του " +
                        "εξοπλισμού εφαρμογής γεωργικών φαρμάκων.",
                "Η ύπαρξη προφυλακτήρα στον δυναμολήπτη είναι " +
                        "αρκετή.",
                "Οι φθορές στα εξαρτήματα μετάδοσης κίνησης " +
                        "δεν παίζουν ρόλο.",
                "Είναι απαραίτητη η ύπαρξη προφυλακτήρα στον " +
                        "δυναμοδότη και στον δυναμολήπτη του " +
                        "εξοπλισμού εφαρμογής γεωργικών φαρμάκων.");
        this.addQuestion_4(q29_4);
        Question_4 q30_4 = new Question_4("Για τη χρήση φορητού εξοπλισμού εφαρμογής γεωργικών φαρμάκων (επινώτιων ψεκαστήρων):",
                "Η βαθμονόμηση είναι απαραίτητη και πρέπει να " +
                        "γίνεται με βάση την προσωπική ταχύτητα " +
                        "βηματισμού και το ρυθμό εφαρμογής του " +
                        "χρήστη και πάντοτε μόνο με τη χρήση καθαρού " +
                        "νερού.",
                "Πρέπει να λαμβάνονται τα μέτρα ατομικής " +
                        "προστασίας του χρήστη που αναφέρονται στην " +
                        "ετικέτα του γεωργικού φαρμάκου, όπως ισχύει και " +
                        "για τους νεφελοψεκαστήρες και ψεκαστήρες " +
                        "μεγάλων καλλιεργειών.",
                "Δεν απαιτείται βαθμονόμησή του, λόγω μικρού " +
                        "όγκου ψεκαστικού διαλύματος.",
                "Η βαθμονόμηση είναι απαραίτητη και πρέπει να " +
                        "λαμβάνονται τα μέτρα ατομικής προστασίας του " +
                        "χρήστη που αναφέρονται στις άλλες απαντήσεις",
                "Η βαθμονόμηση είναι απαραίτητη και πρέπει να " +
                        "λαμβάνονται τα μέτρα ατομικής προστασίας του " +
                        "χρήστη που αναφέρονται στις άλλες απαντήσεις");
        this.addQuestion_4(q30_4);
        Question_4 q31_4 = new Question_4("Χαμηλή πίεση ψεκασμού χρησιμοποιείται:",
                "Σε εντομοκτόνα.",
                "Σε όλα τα φάρμακα για οικονομία ψεκαστικού υγρού.",
                "Στα ζιζανιοκτόνα.",
                "Στα διασυστηματικά μυκητοκτόνα.",
                "Στα ζιζανιοκτόνα.");
        this.addQuestion_4(q31_4);
        Question_4 q32_4 = new Question_4("Με τη ρύθμιση του εξοπλισμού εφαρμογής γεωργικών φαρμάκων (βαθμονόμηση) επιτυγχάνουμε:",
                "Ελάχιστες επιπτώσεις στο περιβάλλον",
                "Οικονομία στο φάρμακο",
                "Οικονομία στο φάρμακο, ελάχιστες " +
                        "επιπτώσεις στο περιβάλλον και στον εαυτό " +
                        "μας και αποτελεσματική εφαρμογή.",
                "Αποτελεσματική εφαρμογή.",
                "Οικονομία στο φάρμακο, ελάχιστες " +
                        "επιπτώσεις στο περιβάλλον και στον εαυτό " +
                        "μας και αποτελεσματική εφαρμογή.");
        this.addQuestion_4(q32_4);
        Question_4 q33_4 = new Question_4("Δεν υπάρχει κίνδυνος δηλητηρίασης διερχόμενων ζώων, εφόσον",
                "Το πλύσιμο του βυτίου γίνεται στο χωράφι.",
                "Τα χρησιμοποιούμενα γεωργικά φάρμακα δεν είναι " +
                        "δηλητήρια.",
                "Υπάρχουν διαρροές από το ψεκαστικό " +
                        "μηχάνημα.",
                "Μετά τον ψεκασμό σταματάει αμέσως η λειτουργία των " +
                        "μπεκ .",
                "Μετά τον ψεκασμό σταματάει αμέσως η λειτουργία των " +
                        "μπεκ .");
        this.addQuestion_4(q33_4);
        Question_4 q34_4 = new Question_4("Με τη σωστή συντήρηση του εξοπλισμού εφαρμογής γεωργικών φαρμάκων επιτυγχάνεται:",
                "Μεγάλη μείωση του κόστους " +
                        "καταπολέμησης.",
                "Διατήρηση του χρώματος της δεξαμενής για " +
                        "μεγαλύτερο χρονικό διάστημα.",
                "Μεταφορά των σταγονιδίων ψεκαστικού " +
                        "υγρού σε μεγαλύτερες αποστάσεις.",
                "Η ελάχιστη δυνατή ανάδευση του ψεκαστικού υγρού " +
                        "στη δεξαμενή.",
                "Μεγάλη μείωση του κόστους " +
                        "καταπολέμησης.");
        this.addQuestion_4(q34_4);
        Question_4 q35_4 = new Question_4("Η καταγραφή του εξοπλισμού εφαρμογής γεωργικών φαρμάκων:",
                "Είναι υποχρεωτική για την καλύτερη " +
                        "οργάνωση της περιοδικής επιθεώρησης που " +
                        "ακολουθεί.",
                "Είναι υποχρεωτική γιατί προβλέπεται από την " +
                        "ευρωπαϊκή και εθνική νομοθεσία.",
                "Εξυπηρετεί τη δημιουργία μητρώου που " +
                        "τηρείται στις αρμόδιες περιφερειακές " +
                        "υπηρεσίες απογραφής αγροτικών " +
                        "μηχανημάτων και αγροτικού εξηλεκτρισμού.",
                "Όλες οι άλλες απαντήσεις ισχύουν.",
                "Όλες οι άλλες απαντήσεις ισχύουν.");
        this.addQuestion_4(q35_4);
        Question_4 q36_4 = new Question_4("Για τον ψεκασμό ζιζανιοκτόνων εδάφους χρησιμοποιούμε μπέκ:",
                "Τύπου σκούπας.",
                "Τύπου κώνου.",
                "Ομοιόμορφης κατανομής.",
                "Συγκεντρωτικά.",
                "Τύπου σκούπας.");
        this.addQuestion_4(q36_4);
        Question_4 q37_4 = new Question_4("Οι βραχίονες ψεκασμού στα ψεκαστικά μηχανήματα μεγάλης καλλιέργειας",
                "Πρέπει να είναι χαλαροί.",
                "Δεν έχει σημασία σε τι ύψος βρίσκονται από την " +
                        "επιφάνεια-στόχο.",
                "Απαγορεύεται να έχουν διαφορετική " +
                        "διατομή κατά το μήκος τους.",
                "Κατασκευάζονται ώστε να ασφαλίζονται κατά τη " +
                        "μεταφορά και να ρυθμίζονται σε ύψος και κλίση κατά " +
                        "την εφαρμογή, μέσω κατάλληλων διατάξεων.",
                "Κατασκευάζονται ώστε να ασφαλίζονται κατά τη " +
                        "μεταφορά και να ρυθμίζονται σε ύψος και κλίση κατά " +
                        "την εφαρμογή, μέσω κατάλληλων διατάξεων.");
        this.addQuestion_4(q37_4);
        Question_4 q38_4 = new Question_4("Για τη συντήρηση και τον καθαρισμό των ακροφυσίων μπορούμε",
                "Να τα αποφράζουμε φυσώντας με το " +
                        "στόμα.",
                "Να τα ξεπλένουμε, χρησιμοποιώντας ειδικό βουρτσάκι ή " +
                        "να χρησιμοποιούμε δέσμη πεπιεσμένου αέρα.",
                "Να τα αποφράζουμε χρησιμοποιώντας " +
                        "αιχμηρό αντικείμενο π.χ. καρφί.",
                "Να μην τα συντηρούμε αν στο ψεκαστικό διάλυμα έχει " +
                        "προηγηθεί καλή ανάδευση.",
                "Να τα ξεπλένουμε, χρησιμοποιώντας ειδικό βουρτσάκι ή " +
                        "να χρησιμοποιούμε δέσμη πεπιεσμένου αέρα.");
        this.addQuestion_4(q38_4);
        Question_4 q39_4 = new Question_4("Το μανόμετρο πρέπει :",
                "Να έχει εύρος 80 bar όταν προορίζεται για " +
                        "νεφελοψεκαστήρα.",
                "Δεν είναι απαραίτητο να λειτουργεί όταν γνωρίζουμε " +
                        "την πίεση λειτουργίας της αντλίας.",
                "Να είναι κατάλληλης κλίμακας, ανάλογα με " +
                        "το είδος του εξοπλισμού εφαρμογής και να " +
                        "είναι ευανάγνωστο από τη θέση του χειριστή.",
                "Να έχει ένδειξη (λαμπάκι) που να υποδεικνύει άμεσα " +
                        "τυχόν διαρροή.",
                "Να είναι κατάλληλης κλίμακας, ανάλογα με " +
                        "το είδος του εξοπλισμού εφαρμογής και να " +
                        "είναι ευανάγνωστο από τη θέση του χειριστή.");
        this.addQuestion_4(q39_4);
        Question_4 q40_4 = new Question_4("Η βαλβίδα ασφαλείας εφόσον υπάρχει :",
                "Ενεργοποιείται όταν γίνεται υπέρβαση της " +
                        "πίεσης λειτουργίας και εκτονώνεται στη " +
                        "δεξαμενή.",
                "Ενεργοποιείται όταν γίνεται υπέρβαση της πίεσης " +
                        "λειτουργίας και εκτονώνεται στο περιβάλλον.",
                "Όταν ενεργοποιηθεί διακόπτει τη λειτουργία " +
                        "του ψεκαστικού μηχανήματος.",
                "Δεν μπορεί να χρησιμοποιηθεί όταν ψεκάζουμε με " +
                        "ζιζανιοκτόνο.",
                "Ενεργοποιείται όταν γίνεται υπέρβαση της " +
                        "πίεσης λειτουργίας και εκτονώνεται στη " +
                        "δεξαμενή.");
        this.addQuestion_4(q40_4);

    }

    private void addQuestions_5() {
        Question_5 q1_5 = new Question_5("Από πού μπορώ να αγοράσω γεωργικά φάρμακα;",
                "Μόνο από κατάστημα που έχει αναγγείλει " +
                        "την άσκηση λιανικής πώλησης γεωργικών " +
                        "φαρμάκων στις αρμόδιες αρχές.",
                "Μόνο από κατάστημα που έχει αναγγείλει την άσκηση " +
                        "λιανικής πώλησης γεωργικών φαρμάκων στον τοπικό " +
                        "τύπο.",
                "Από άλλους παραγωγούς.",
                "Από οποιοδήποτε κατάστημα και το ίντερνετ.",
                "Μόνο από κατάστημα που έχει αναγγείλει " +
                        "την άσκηση λιανικής πώλησης γεωργικών " +
                        "φαρμάκων στις αρμόδιες αρχές.");
        this.addQuestion_5(q1_5);
        Question_5 q2_5 = new Question_5("Ένα γνωστό γεωργικό φάρμακο γνωστής εταιρείας με ξενόγλωσση ετικέτα:",
                "Είναι σε κάθε περίπτωση παράνομο.",
                "Είναι παράνομο εφόσον δεν πουλιέται από " +
                        "καταστήματα γεωργικών φαρμάκων με γεωπόνο.",
                "Πρέπει πάντα να συνοδεύεται με φυλλάδιο με " +
                        "μετάφραση της ετικέτας του στα Ελληνικά.",
                "Είναι παράνομο εφόσον δεν υπάρχει εγκεκριμένο στη " +
                        "χώρα με την ίδια ονομασία.",
                "Είναι σε κάθε περίπτωση παράνομο.");
        this.addQuestion_5(q2_5);
        Question_5 q3_5 = new Question_5("Ποιος έχει την ευθύνη αν εντοπισθεί η χρήση παράνομου γεωργικού φαρμάκου;",
                "Η εταιρία ή το πρόσωπο που το πούλησε " +
                        "στο κατάστημα.",
                "Το κατάστημα ή αυτός που το πούλησε στον παραγωγό.",
                "Ο παραγωγός.",
                "Όλοι οι αναφερόμενοι στις άλλες επιλογές.",
                "Όλοι οι αναφερόμενοι στις άλλες επιλογές.");
        this.addQuestion_5(q3_5);
        Question_5 q4_5 = new Question_5("Η τήρηση αρχείου για κάθε χρήση γεωργικών φαρμάκων",
                "Πρέπει να γίνεται πολύ πριν την εφαρμογή",
                "Πρέπει να γίνεται λίγο πριν την εφαρμογή",
                "Πρέπει να γίνεται αμέσως μετά την εφαρμογή " +
                        "για να καταγράφεται η πραγματικότητα.",
                "Πρέπει να γίνεται στο τέλος κάθε εβδομάδας",
                "Πρέπει να γίνεται αμέσως μετά την εφαρμογή " +
                        "για να καταγράφεται η πραγματικότητα.");
        this.addQuestion_5(q4_5);
        Question_5 q5_5 = new Question_5("Η είσοδος σε θερμοκήπιο μετά τον ψεκασμό πρέπει να γίνεται:",
                "Αφού στεγνώσει το γεωργικό φάρμακο",
                "Σε 48 ώρες το χειμώνα και σε 6 ώρες το καλοκαίρι, " +
                        "μετά τον ψεκασμό.",
                "Αφού στεγνώσει το γεωργικό φάρμακο και " +
                        "εξαεριστεί ο χώρος εκτός αν κάτι άλλο αναφέρεται " +
                        "στην ετικέτα.",
                "Φορώντας τα προστατευτικά μέσα που " +
                        "αναφέρονται στην ετικέτα του γεωργικού φαρμάκου " +
                        "για τουλάχιστον μία ημέρα.",
                "Αφού στεγνώσει το γεωργικό φάρμακο και " +
                        "εξαεριστεί ο χώρος εκτός αν κάτι άλλο αναφέρεται " +
                        "στην ετικέτα.");
        this.addQuestion_5(q5_5);
        Question_5 q6_5 = new Question_5("Η τελευταία επέμβαση ενός γεωργικού φαρμάκου πριν τη συγκομιδή είναι 7 ημέρες. Αυτό σημαίνει:",
                "Για 7 ημέρες πριν τη συγκομιδή απαγορεύονται οι " +
                        "ψεκασμοί με όλα τα γεωργικά φάρμακα.",
                "Πρέπει να περάσουν τουλάχιστον 7 ημέρες μετά τον " +
                        "ψεκασμό του συγκεκριμένου γεωργικού φαρμάκου " +
                        "για να συγκομίσω.",
                "Μπορώ να συγκομίσω και νωρίτερα αρκεί να " +
                        "περάσουν τουλάχιστον 7 ημέρες μετά τον " +
                        "ψεκασμό του συγκεκριμένου γεωργικού " +
                        "φαρμάκου μέχρι να καταναλωθεί.",
                "Το φάρμακο είναι μέτρια οικολογικό.",
                "Πρέπει να περάσουν τουλάχιστον 7 ημέρες μετά τον " +
                        "ψεκασμό του συγκεκριμένου γεωργικού φαρμάκου " +
                        "για να συγκομίσω.");
        this.addQuestion_5(q6_5);
        Question_5 q7_5 = new Question_5("Κατά τη διάρκεια του ψεκασμού των γεωργικών φαρμάκων επιτρέπεται το κάπνισμα:",
                "Εφόσον ο ψεκαστής φορά τα γάντια που " +
                        "αναφέρονται επί της ετικέτας του γεωργικού " +
                        "φαρμάκου.",
                "Σε καμία περίπτωση δεν επιτρέπεται το κάπνισμα.",
                "Εφόσον τα τσιγάρα δεν έχουν βραχεί από το " +
                        "ψεκαστικό υγρό.",
                "Εφόσον είναι ηλεκτρονικό τσιγάρο.",
                "Σε καμία περίπτωση δεν επιτρέπεται το κάπνισμα.");
        this.addQuestion_5(q7_5);
        Question_5 q8_5 = new Question_5("Η κατανάλωση τροφής κατά την διάρκεια του ψεκασμού επιτρέπεται μόνο όταν:",
                "Το γεωργικό φάρμακο που ψεκάζουμε είναι " +
                        "μυκητοκτόνο.",
                "Το γεωργικό φάρμακο που ψεκάζουμε έχει μικρή " +
                        "τοξικότητα.",
                "Βγάζουμε τα γάντια που φοράμε στον ψεκασμό.",
                "Ποτέ.",
                "Ποτέ.");
        this.addQuestion_5(q8_5);
        Question_5 q9_5 = new Question_5("Η χρήση καυσόξυλων για ψήσιμο από ψεκασμένες καλλιέργειες (πχ. κληματίδες από κλάδεμα " +
                "αμπελιού) επιτρέπεται μόνο όταν:",
                "Έχει περάσει το χρονικό διάστημα της τελευταίας " +
                        "επέμβασης πριν την συγκομιδή.",
                "Είναι χειμώνας.",
                "Ποτέ.",
                "Εάν δεν φυσάει αέρας.",
                "Ποτέ.");
        this.addQuestion_5(q9_5);
        Question_5 q10_5 = new Question_5("Κατά τη διάρκεια εφαρμογής (ψεκασμός) φοράω:",
                "Πέδιλα.",
                "Λαστιχένιες μπότες χωρίς εσωτερική επένδυση.",
                "Αθλητικά παπούτσια.",
                "Δερμάτινες μπότες.",
                "Λαστιχένιες μπότες χωρίς εσωτερική επένδυση.");
        this.addQuestion_5(q10_5);
        Question_5 q11_5 = new Question_5("Αναγκαίο είναι το πλύσιμο για:",
                "Τη φόρμα μιας χρήσης.",
                "Τη φόρμα πολλαπλών χρήσεων.",
                "Τη μάσκα μιας χρήσης.",
                "Τα αθλητικά παπούτσια.",
                "Τη φόρμα πολλαπλών χρήσεων.");
        this.addQuestion_5(q11_5);
        Question_5 q12_5 = new Question_5("Μετά τον ψεκασμό:",
                "Συνεχίζω με τις υπόλοιπες δουλειές.",
                "Μπαίνω στο χωράφι και ελέγχω",
                "Κάνω ντους.",
                "Ξεκουράζομαι στην άκρη του χωραφιού",
                "Κάνω ντους.");
        this.addQuestion_5(q12_5);
        Question_5 q13_5 = new Question_5("Χρησιμοποιώ μεγαλύτερη δόση από την αναγραφόμενη στην ετικέτα ενός εντομοκτόνου:",
                "Όταν υπάρχει έντονο πρόβλημα προσβολής από " +
                        "έντομα.",
                "Ποτέ σε καμία περίπτωση.",
                "Όταν ο ψεκασμός είναι προληπτικός.",
                "Όταν θέλω να καταπολεμήσω ταυτόχρονα " +
                        "περισσότερα από δυο είδη εντόμων.",
                "Ποτέ σε καμία περίπτωση.");
        this.addQuestion_5(q13_5);
        Question_5 q14_5 = new Question_5("Ψεκάζω μόνο όταν ο άνεμος:",
                "Δεν είναι ισχυρός.",
                "Δεν είναι κρύος .",
                "Έχει άπνοια, αλλιώς απαγορεύεται.",
                "Πνέει αντίθετα.",
                "Δεν είναι ισχυρός.");
        this.addQuestion_5(q14_5);
        Question_5 q15_5 = new Question_5("Το πότισμα με υπερβολική ποσότητα νερού:",
                "Προκαλεί έκπλυση (ξέπλυμα) των " +
                        "γεωργικών φαρμάκων που εφαρμόστηκαν " +
                        "στο έδαφος.",
                "Βοηθά στη δράση ων γεωργικών φαρμάκων που " +
                        "εφαρμόστηκαν στο έδαφος.",
                "Δυναμώνει τα φυτά.",
                "Δεν έχει καμία επίπτωση.",
                "Προκαλεί έκπλυση (ξέπλυμα) των " +
                        "γεωργικών φαρμάκων που εφαρμόστηκαν " +
                        "στο έδαφος.");
        this.addQuestion_5(q15_5);
        Question_5 q16_5 = new Question_5("Ο κίνδυνος έκπλυσης (ξεπλύματος) των γεωργικών φαρμάκων προς τα υπόγεια νερά, είναι μεγάλος:",
                "Σε εδάφη με ρωγμές.",
                "Σε εδάφη με χαλικώδες ή αμμώδες υπέδαφος.",
                "Σε εδάφη με υψηλό υδροφόρο ορίζοντα.",
                "Σε κάθε περίπτωση των άλλων απαντήσεων",
                "Σε κάθε περίπτωση των άλλων απαντήσεων");
        this.addQuestion_5(q16_5);
        Question_5 q17_5 = new Question_5("Η μετάδοση επιβλαβών (φυτοπαθογόνων) οργανισμών από τα χρησιμοποιούμενα μηχανήματα και " +
                "τον εξοπλισμό γίνεται όταν:",
                "Είναι παλαιά.",
                "Δεν καθαρίζονται τακτικά.",
                "Είναι καινούρια.",
                "Δεν ρυθμίζονται σωστά τα μπεκ.",
                "Δεν καθαρίζονται τακτικά.");
        this.addQuestion_5(q17_5);
        Question_5 q18_5 = new Question_5("Οι ανθεκτικές ποικιλίες φυτών, πρέπει να προτιμούνται:",
                "Μόνο εφόσον υπάρχει σχετική εντολή " +
                        "από τις αρμόδιες αρχές.",
                "Μόνο εφόσον επιδοτούνται.",
                "Μόνο εφόσον υπάρχει σε έξαρση μια " +
                        "ασθένεια.",
                "Πάντα, εφόσον βοηθούν στην προληπτική αντιμετώπιση " +
                        "του παθογόνου.",
                "Πάντα, εφόσον βοηθούν στην προληπτική αντιμετώπιση " +
                        "του παθογόνου.");
        this.addQuestion_5(q18_5);
        Question_5 q19_5 = new Question_5("Για να προστατέψω ένα ωφέλιμο έντομο στο χωράφι μου…",
                "Εφαρμόζω μέτρα βιολογικού ελέγχου και αν " +
                        "χρειαστεί γεωργικά φάρμακα, που σύμφωνα με " +
                        "τις συμβουλές του γεωπόνου δεν επηρεάζουν " +
                        "την ανάπτυξή του.",
                "Δεν ψεκάζω ποτέ με ζιζανιοκτόνα.",
                "Δεν χρησιμοποιώ χημικά λιπάσματα.",
                "Δεν ψεκάζω με υψηλή θερμοκρασία.",
                "Εφαρμόζω μέτρα βιολογικού ελέγχου και αν " +
                        "χρειαστεί γεωργικά φάρμακα, που σύμφωνα με " +
                        "τις συμβουλές του γεωπόνου δεν επηρεάζουν " +
                        "την ανάπτυξή του.");
        this.addQuestion_5(q19_5);
        Question_5 q20_5 = new Question_5("Με τις παγίδες με κόλλα μπορώ:",
                "Να παρακολουθώ αν έχει γίνει σωστός " +
                        "ψεκασμός ενός γεωργικού φαρμάκου.",
                "Να παρακολουθώ αν έβρεξε.",
                "Να ελέγχω την κατάσταση του χωραφιού μου.",
                "Να παρακολουθώ τον πληθυσμό επιβλαβών εντόμων.",
                "Να παρακολουθώ τον πληθυσμό επιβλαβών εντόμων.");
        this.addQuestion_5(q20_5);
        Question_5 q21_5 = new Question_5("Με σκοπό την αποφυγή μολύνσεων του ξύλου μετά το κλάδεμα των δένδρων…",
                "Γίνεται προληπτικός ψεκασμός του δένδρου με " +
                        "μυκητοκτόνα πριν το κλάδεμα.",
                "Μεσαίες και μεγάλες τομές καλύπτονται με ειδικό " +
                        "επουλωτικό πληγών.",
                "Διατηρείται στρώμα από ζιζάνια στο έδαφος " +
                        "κάτω από το δένδρο.",
                "Ο κλαδευτής των δένδρων φορά ειδικά γάντια.",
                "Μεσαίες και μεγάλες τομές καλύπτονται με ειδικό " +
                        "επουλωτικό πληγών.");
        this.addQuestion_5(q21_5);
        Question_5 q22_5 = new Question_5("Το καλό κλάδεμα με την αφαίρεση των προσβεβλημένων κλάδων και ο αερισμός του δέντρου που " +
                "προκύπτει από το κλάδεμα …",
                "Πρέπει να γίνεται μετά την εφαρμογή των " +
                        "γεωργικών φαρμάκων.",
                "Αποτελούν μέτρο έκτακτης ανάγκης.",
                "Δεν επηρεάζουν τις ανάγκες του δένδρου για " +
                        "εφαρμογή γεωργικών φαρμάκων.",
                "Είναι το πρώτο μέτρο μείωσης των προσβολών από " +
                        "εχθρούς (κυρίως κοκκοειδή) και ασθένειες.",
                "Είναι το πρώτο μέτρο μείωσης των προσβολών από " +
                        "εχθρούς (κυρίως κοκκοειδή) και ασθένειες.");
        this.addQuestion_5(q22_5);
        Question_5 q23_5 = new Question_5("Η οξαλίδα (ζιζάνιο) μπορεί να χρησιμοποιηθεί:",
                "Για παραγωγή τσαγιού.",
                "Σε τίποτα.",
                "Για εδαφοκάλυψη και περιορισμό των ζιζανίων " +
                        "στην ελιά, στο αμπέλι και στα εσπεριδοειδή.",
                "Για περιορισμό των εντόμων.",
                "Για εδαφοκάλυψη και περιορισμό των ζιζανίων " +
                        "στην ελιά, στο αμπέλι και στα εσπεριδοειδή.");
        this.addQuestion_5(q23_5);
        Question_5 q24_5 = new Question_5("Τα προφυτρωτικά ζιζανιοκτόνα εφαρμόζονται:",
                "Αποκλειστικά για στενόφυλλα ζιζάνια.",
                "Πριν το φύτρωμα της καλλιέργειας.",
                "Αποκλειστικά για πλατύφυλλα ζιζάνια.",
                "Μετά το φύτρωμα της καλλιέργειας",
                "Πριν το φύτρωμα της καλλιέργειας.");
        this.addQuestion_5(q24_5);
        Question_5 q25_5 = new Question_5("Η καλύτερη εποχή για την εφαρμογή της ηλιαπολύμανσης είναι:",
                "Ο χειμώνας.",
                "Η άνοιξη.",
                "Το καλοκαίρι.",
                "Το φθινόπωρο.",
                "Το καλοκαίρι.");
        this.addQuestion_5(q25_5);
        Question_5 q26_5 = new Question_5("Η ηλιαπολύμανση εφαρμόζεται:",
                "Μόνο σε καλλιέργειες θερμοκηπίου.",
                "Μόνο σε φρούτα και λαχανικά.",
                "Μόνο σε λαχανικά.",
                "Σε πολλές καλλιέργειες.",
                "Σε πολλές καλλιέργειες.");
        this.addQuestion_5(q26_5);
        Question_5 q27_5 = new Question_5("Για να προστατέψω τους υδάτινους πόρους (λίμνες, ποτάμια κλπ) που τυχόν βρίσκονται κοντά " +
                "στην καλλιέργειά μου;",
                "Δεν χρησιμοποιώ γεωργικά φάρμακα με σήμανση " +
                        "τοξικό ή δηλητήριο.",
                "Όταν χρησιμοποιώ γεωργικά φάρμακα, τα " +
                        "εφαρμόζω κρατώντας κατάλληλη απόσταση από " +
                        "τους υδάτινους πόρους.",
                "Χρησιμοποιώ μόνον γεωργικά φάρμακα στερεάς " +
                        "μορφής (σκόνες, κοκκώδη κλπ).",
                "Χρησιμοποιώ μόνον νεφελοψεκαστήρες.",
                "Όταν χρησιμοποιώ γεωργικά φάρμακα, τα " +
                        "εφαρμόζω κρατώντας κατάλληλη απόσταση από " +
                        "τους υδάτινους πόρους.");
        this.addQuestion_5(q27_5);
        Question_5 q28_5 = new Question_5("Η απόρριψη των κενών συσκευασίας σε αρδευτικά κανάλια",
                "Δεν επηρεάζει τους υδάτινους πόρους (λίμνες, " +
                        "ποτάμια κλπ) που τυχόν βρίσκονται κοντά στην " +
                        "καλλιέργειά μου.",
                "Δεν τιμωρείται από την νομοθεσία.",
                "Ρυπαίνει τους υδάτινους πόρους (λίμνες, ποτάμια " +
                        "κλπ) και εν γένει το περιβάλλον.",
                "Δεν επηρεάζει το περιβάλλον αν τα γεωργικά " +
                        "φάρμακα δεν είναι τοξικά",
                "Ρυπαίνει τους υδάτινους πόρους (λίμνες, ποτάμια " +
                        "κλπ) και εν γένει το περιβάλλον.");
        this.addQuestion_5(q28_5);
        Question_5 q29_5 = new Question_5("Για την ασφάλεια του χρήστη :",
                "Δεν είναι απαραίτητη η ύπαρξη προφυλακτήρων " +
                        "του δυναμοδότη.",
                "Είναι απαραίτητη η ύπαρξη προφυλακτήρα στον " +
                        "δυναμοδότη και στον δυναμολήπτη του " +
                        "εξοπλισμού εφαρμογής γεωργικών φαρμάκων.",
                "Η ύπαρξη προφυλακτήρα στον δυναμολήπτη είναι " +
                        "αρκετή.",
                "Οι φθορές στα εξαρτήματα μετάδοσης κίνησης " +
                        "δεν παίζουν ρόλο.",
                "Είναι απαραίτητη η ύπαρξη προφυλακτήρα στον " +
                        "δυναμοδότη και στον δυναμολήπτη του " +
                        "εξοπλισμού εφαρμογής γεωργικών φαρμάκων.");
        this.addQuestion_5(q29_5);
        Question_5 q30_5 = new Question_5("Για τη χρήση φορητού εξοπλισμού εφαρμογής γεωργικών φαρμάκων (επινώτιων ψεκαστήρων):",
                "Η βαθμονόμηση είναι απαραίτητη και πρέπει να " +
                        "γίνεται με βάση την προσωπική ταχύτητα " +
                        "βηματισμού και το ρυθμό εφαρμογής του " +
                        "χρήστη και πάντοτε μόνο με τη χρήση καθαρού " +
                        "νερού.",
                "Πρέπει να λαμβάνονται τα μέτρα ατομικής " +
                        "προστασίας του χρήστη που αναφέρονται στην " +
                        "ετικέτα του γεωργικού φαρμάκου, όπως ισχύει και " +
                        "για τους νεφελοψεκαστήρες και ψεκαστήρες " +
                        "μεγάλων καλλιεργειών.",
                "Δεν απαιτείται βαθμονόμησή του, λόγω μικρού " +
                        "όγκου ψεκαστικού διαλύματος.",
                "Η βαθμονόμηση είναι απαραίτητη και πρέπει να " +
                        "λαμβάνονται τα μέτρα ατομικής προστασίας του " +
                        "χρήστη που αναφέρονται στις άλλες απαντήσεις",
                "Η βαθμονόμηση είναι απαραίτητη και πρέπει να " +
                        "λαμβάνονται τα μέτρα ατομικής προστασίας του " +
                        "χρήστη που αναφέρονται στις άλλες απαντήσεις");
        this.addQuestion_5(q30_5);
        Question_5 q31_5 = new Question_5("Χαμηλή πίεση ψεκασμού χρησιμοποιείται:",
                "Σε εντομοκτόνα.",
                "Σε όλα τα φάρμακα για οικονομία ψεκαστικού υγρού.",
                "Στα ζιζανιοκτόνα.",
                "Στα διασυστηματικά μυκητοκτόνα.",
                "Στα ζιζανιοκτόνα.");
        this.addQuestion_5(q31_5);
        Question_5 q32_5 = new Question_5("Με τη ρύθμιση του εξοπλισμού εφαρμογής γεωργικών φαρμάκων (βαθμονόμηση) επιτυγχάνουμε:",
                "Ελάχιστες επιπτώσεις στο περιβάλλον",
                "Οικονομία στο φάρμακο",
                "Οικονομία στο φάρμακο, ελάχιστες " +
                        "επιπτώσεις στο περιβάλλον και στον εαυτό " +
                        "μας και αποτελεσματική εφαρμογή.",
                "Αποτελεσματική εφαρμογή.",
                "Οικονομία στο φάρμακο, ελάχιστες " +
                        "επιπτώσεις στο περιβάλλον και στον εαυτό " +
                        "μας και αποτελεσματική εφαρμογή.");
        this.addQuestion_5(q32_5);
        Question_5 q33_5 = new Question_5("Δεν υπάρχει κίνδυνος δηλητηρίασης διερχόμενων ζώων, εφόσον",
                "Το πλύσιμο του βυτίου γίνεται στο χωράφι.",
                "Τα χρησιμοποιούμενα γεωργικά φάρμακα δεν είναι " +
                        "δηλητήρια.",
                "Υπάρχουν διαρροές από το ψεκαστικό " +
                        "μηχάνημα.",
                "Μετά τον ψεκασμό σταματάει αμέσως η λειτουργία των " +
                        "μπεκ .",
                "Μετά τον ψεκασμό σταματάει αμέσως η λειτουργία των " +
                        "μπεκ .");
        this.addQuestion_5(q33_5);
        Question_5 q34_5 = new Question_5("Με τη σωστή συντήρηση του εξοπλισμού εφαρμογής γεωργικών φαρμάκων επιτυγχάνεται:",
                "Μεγάλη μείωση του κόστους " +
                        "καταπολέμησης.",
                "Διατήρηση του χρώματος της δεξαμενής για " +
                        "μεγαλύτερο χρονικό διάστημα.",
                "Μεταφορά των σταγονιδίων ψεκαστικού " +
                        "υγρού σε μεγαλύτερες αποστάσεις.",
                "Η ελάχιστη δυνατή ανάδευση του ψεκαστικού υγρού " +
                        "στη δεξαμενή.",
                "Μεγάλη μείωση του κόστους " +
                        "καταπολέμησης.");
        this.addQuestion_5(q34_5);
        Question_5 q35_5 = new Question_5("Η καταγραφή του εξοπλισμού εφαρμογής γεωργικών φαρμάκων:",
                "Είναι υποχρεωτική για την καλύτερη " +
                        "οργάνωση της περιοδικής επιθεώρησης που " +
                        "ακολουθεί.",
                "Είναι υποχρεωτική γιατί προβλέπεται από την " +
                        "ευρωπαϊκή και εθνική νομοθεσία.",
                "Εξυπηρετεί τη δημιουργία μητρώου που " +
                        "τηρείται στις αρμόδιες περιφερειακές " +
                        "υπηρεσίες απογραφής αγροτικών " +
                        "μηχανημάτων και αγροτικού εξηλεκτρισμού.",
                "Όλες οι άλλες απαντήσεις ισχύουν.",
                "Όλες οι άλλες απαντήσεις ισχύουν.");
        this.addQuestion_5(q35_5);
        Question_5 q36_5 = new Question_5("Για τον ψεκασμό ζιζανιοκτόνων εδάφους χρησιμοποιούμε μπέκ:",
                "Τύπου σκούπας.",
                "Τύπου κώνου.",
                "Ομοιόμορφης κατανομής.",
                "Συγκεντρωτικά.",
                "Τύπου σκούπας.");
        this.addQuestion_5(q36_5);
        Question_5 q37_5 = new Question_5("Οι βραχίονες ψεκασμού στα ψεκαστικά μηχανήματα μεγάλης καλλιέργειας",
                "Πρέπει να είναι χαλαροί.",
                "Δεν έχει σημασία σε τι ύψος βρίσκονται από την " +
                        "επιφάνεια-στόχο.",
                "Απαγορεύεται να έχουν διαφορετική " +
                        "διατομή κατά το μήκος τους.",
                "Κατασκευάζονται ώστε να ασφαλίζονται κατά τη " +
                        "μεταφορά και να ρυθμίζονται σε ύψος και κλίση κατά " +
                        "την εφαρμογή, μέσω κατάλληλων διατάξεων.",
                "Κατασκευάζονται ώστε να ασφαλίζονται κατά τη " +
                        "μεταφορά και να ρυθμίζονται σε ύψος και κλίση κατά " +
                        "την εφαρμογή, μέσω κατάλληλων διατάξεων.");
        this.addQuestion_5(q37_5);
        Question_5 q38_5 = new Question_5("Για τη συντήρηση και τον καθαρισμό των ακροφυσίων μπορούμε",
                "Να τα αποφράζουμε φυσώντας με το " +
                        "στόμα.",
                "Να τα ξεπλένουμε, χρησιμοποιώντας ειδικό βουρτσάκι ή " +
                        "να χρησιμοποιούμε δέσμη πεπιεσμένου αέρα.",
                "Να τα αποφράζουμε χρησιμοποιώντας " +
                        "αιχμηρό αντικείμενο π.χ. καρφί.",
                "Να μην τα συντηρούμε αν στο ψεκαστικό διάλυμα έχει " +
                        "προηγηθεί καλή ανάδευση.",
                "Να τα ξεπλένουμε, χρησιμοποιώντας ειδικό βουρτσάκι ή " +
                        "να χρησιμοποιούμε δέσμη πεπιεσμένου αέρα.");
        this.addQuestion_5(q38_5);
        Question_5 q39_5 = new Question_5("Το μανόμετρο πρέπει :",
                "Να έχει εύρος 80 bar όταν προορίζεται για " +
                        "νεφελοψεκαστήρα.",
                "Δεν είναι απαραίτητο να λειτουργεί όταν γνωρίζουμε " +
                        "την πίεση λειτουργίας της αντλίας.",
                "Να είναι κατάλληλης κλίμακας, ανάλογα με " +
                        "το είδος του εξοπλισμού εφαρμογής και να " +
                        "είναι ευανάγνωστο από τη θέση του χειριστή.",
                "Να έχει ένδειξη (λαμπάκι) που να υποδεικνύει άμεσα " +
                        "τυχόν διαρροή.",
                "Να είναι κατάλληλης κλίμακας, ανάλογα με " +
                        "το είδος του εξοπλισμού εφαρμογής και να " +
                        "είναι ευανάγνωστο από τη θέση του χειριστή.");
        this.addQuestion_5(q39_5);
        Question_5 q40_5 = new Question_5("Η βαλβίδα ασφαλείας εφόσον υπάρχει :",
                "Ενεργοποιείται όταν γίνεται υπέρβαση της " +
                        "πίεσης λειτουργίας και εκτονώνεται στη " +
                        "δεξαμενή.",
                "Ενεργοποιείται όταν γίνεται υπέρβαση της πίεσης " +
                        "λειτουργίας και εκτονώνεται στο περιβάλλον.",
                "Όταν ενεργοποιηθεί διακόπτει τη λειτουργία " +
                        "του ψεκαστικού μηχανήματος.",
                "Δεν μπορεί να χρησιμοποιηθεί όταν ψεκάζουμε με " +
                        "ζιζανιοκτόνο.",
                "Ενεργοποιείται όταν γίνεται υπέρβαση της " +
                        "πίεσης λειτουργίας και εκτονώνεται στη " +
                        "δεξαμενή.");
        this.addQuestion_5(q40_5);

    }

    private void addQuestions_6() {
        Question_6 q1_6 = new Question_6("Από ποιον παίρνουμε πληροφορίες για το αν χρειάζεται και ποιο γεωργικό φάρμακο θα " +
                "χρησιμοποιήσουμε;",
                "Από το ιντερνετ.",
                "Από γεωπόνο.",
                "Από οποιοδήποτε υπάλληλο ενός " +
                        "καταστήματος γεωργικών εφοδίων.",
                "Από τον παραγωγό που έχει καλύτερη παραγωγή στην " +
                        "περιοχή.",
                "Από γεωπόνο.");
        this.addQuestion_6(q1_6);
        Question_6 q2_6 = new Question_6("Τι κάνουμε αν πιστεύουμε ότι ένα έντομο ή μια ασθένεια ή ένα ζιζάνιο δεν καταπολεμάται με τα " +
                "εγκεκριμένα σκευάσματα;",
                "Χρησιμοποιώ διπλάσια ή τριπλάσια δόση " +
                        "ενός γνωστού γεωργικού φαρμάκου.",
                "Συμβουλεύομαι τους γεωπόνους.",
                "Αναζητώ άλλα γεωργικά φάρμακα και " +
                        "πειραματίζομαι που κυκλοφορούν σε " +
                        "άλλες χώρες.",
                "Ψεκάζω ποιο συχνά από το χρονικό διάστημα που " +
                        "αναγράφει η ετικέτα.",
                "Συμβουλεύομαι τους γεωπόνους.");
        this.addQuestion_6(q2_6);
        Question_6 q3_6 = new Question_6("Προϊόντα που προορίζονται για την «ενίσχυση της άμυνας των φυτών» και αναφέρουν ενδείξεις " +
                "καταπολέμησης εντόμων και ασθενειών των φυτών;",
                "Είναι οικολογικά γεωργικά φάρμακα.",
                "Έχουν αποτελεσματικότητα στην καταπολέμηση εντόμων " +
                        "και ασθενειών των φυτών",
                "Προτιμούνται αντί για τα γεωργικά " +
                        "φάρμακα.",
                "Είναι παράνομα γεωργικά φάρμακα.",
                "Είναι παράνομα γεωργικά φάρμακα.");
        this.addQuestion_6(q3_6);
        Question_6 q4_6 = new Question_6("Ένα γεωργικό φάρμακο με κατ’ εξαίρεση άδεια χρήσης 120 ημερών",
                "Μπορεί να χρησιμοποιείται μόνον μέσα " +
                        "στη χρονική περίοδο που γράφει η ετικέτα " +
                        "του.",
                "Μπορεί να χρησιμοποιείται από οποιονδήποτε " +
                        "ενδιαφερόμενο αντιμετωπίζει το ίδιο πρόβλημα σε όλη τη " +
                        "χώρα.",
                "Μπορεί να διατηρηθεί στην αποθήκη του " +
                        "παραγωγού για 2 έτη αν δεν " +
                        "χρησιμοποιηθεί άμεσα.",
                "Μπορεί να διατηρηθεί για 2 έτη μόνον σε κατάστημα " +
                        "εμπορίας γεωργικών φαρμάκων.",
                "Μπορεί να χρησιμοποιείται μόνον μέσα " +
                        "στη χρονική περίοδο που γράφει η ετικέτα " +
                        "του.");
        this.addQuestion_6(q4_6);
        Question_6 q5_6 = new Question_6("Εάν η καλλιέργεια που θα ψεκάσουμε γειτνιάζει με άλλη καλλιέργεια που είναι κοντά στο στάδιο της " +
                "συγκομιδής λαμβάνουμε υπόψη μας τον άνεμο και δίνουμε ιδιαίτερη προσοχή ώστε:",
                "Να μην πέσει ψεκαστικό υγρό στη γειτονική " +
                        "καλλιέργεια.",
                "Να χρησιμοποιήσουμε μικρότερες από τις " +
                        "συνιστώμενες δόσεις",
                "Να μην είναι κοντά ο ιδιοκτήτης",
                "Να είναι ποτισμένη η γειτονική καλλιέργεια.",
                "Να μην πέσει ψεκαστικό υγρό στη γειτονική " +
                        "καλλιέργεια.");
        this.addQuestion_6(q5_6);
        Question_6 q6_6 = new Question_6("Κατά τη χρήση ενός σκευάσματος χωρίς να ληφθούν τα ατομικά μέσα προστασίας, ο " +
                "παραγωγός αισθάνεται έντονη αναπνευστική δυσφορία.",
                "Είναι σύνηθες φαινόμενο και αρκεί να " +
                        "διακόψει για λίγα λεπτά τον ψεκασμό",
                "Οφείλει μετά τον ψεκασμό να ενημερώσει τον " +
                        "προμηθευτή του και να ζητήσει συμβουλές.",
                "Εφόσον δεν αντιμετωπίζει καρδιολογικά " +
                        "προβλήματα, δεν έχει ιδιαίτερη σημασία.",
                "Πρέπει να ζητήσει άμεσα ιατρική συμβουλή και να " +
                        "επιδείξει την ετικέτα του φαρμάκου.",
                "Πρέπει να ζητήσει άμεσα ιατρική συμβουλή και να " +
                        "επιδείξει την ετικέτα του φαρμάκου.");
        this.addQuestion_6(q6_6);
        Question_6 q7_6 = new Question_6("Οι ψεκασμοί την περίοδο της ανθοφορίας των φυτών:",
                "Είναι συχνά όχι αποτελεσματικοί.",
                "Μπορεί να είναι επικίνδυνοι για τα ωφέλιμα έντομα " +
                        "όπως οι μέλισσες όταν χρησιμοποιούνται " +
                        "μελισσοτοξικά σκευάσματα.",
                "Συνιστώνται πάντα .",
                "Δεν επηρεάζουν τα ωφέλιμα έντομα όπως οι " +
                        "μέλισσες, αν γίνονται απογευματινές ώρες.",
                "Μπορεί να είναι επικίνδυνοι για τα ωφέλιμα έντομα " +
                        "όπως οι μέλισσες όταν χρησιμοποιούνται " +
                        "μελισσοτοξικά σκευάσματα.");
        this.addQuestion_6(q7_6);
        Question_6 q8_6 = new Question_6("Κατά την εφαρμογή εκλεκτικών (καταπολεμούν συγκεκριμένα ζιζάνια και δεν βλάπτουν την " +
                "καλλιέργεια) ζιζανιοκτόνων προσέχουμε ιδιαίτερα",
                "Τη δόση εφαρμογής",
                "Το στάδιο ανάπτυξης της καλλιέργειας",
                "Το στάδιο ανάπτυξης του ζιζανίου",
                "Όλες οι άλλες απαντήσεις μαζί",
                "Όλες οι άλλες απαντήσεις μαζί");
        this.addQuestion_6(q8_6);
        Question_6 q9_6 = new Question_6("Πού πλένουμε τα προστατευτικά μέσα (φόρμα, καπέλο, γάντια)",
                "Στο πλυντήριο μαζί με όλα τα ρούχα της " +
                        "οικογένειας",
                "Τα ξεπλένουμε ξεχωριστά από άλλα ρούχα και τα " +
                        "στεγνώνουμε στον ήλιο σε καλά αεριζόμενο χώρο",
                "Στο χωράφι",
                "Δεν τα πλένουμε ποτέ",
                "Τα ξεπλένουμε ξεχωριστά από άλλα ρούχα και τα " +
                        "στεγνώνουμε στον ήλιο σε καλά αεριζόμενο χώρο");
        this.addQuestion_6(q9_6);
        Question_6 q10_6 = new Question_6("Ο επαγγελματίας χρήστης οφείλει να ενημερώσει όταν ενδέχεται να μετακινηθεί το ψεκαστικό νέφος",
                "Εγγράφως τους κατοίκους, τους επαγγελματίες και " +
                        "τους μόνιμους επισκέπτες της περιοχής οι οποίοι " +
                        "ενδέχεται να εκτεθούν σε αυτό",
                "Σαράντα οκτώ (48) ώρες πρίν από το χρόνο ψεκασμού",
                "Όταν μόνο περαστικοί δύναται να εκτεθούν σε " +
                        "μετακινούμενο ψεκαστικό νέφος, η ενημέρωση " +
                        "του πρώτου εδαφίου γίνεται πριν από την έναρξη " +
                        "του ψεκασμού",
                "Όλες οι άλλες απαντήσεις μαζί",
                "Όλες οι άλλες απαντήσεις μαζί");
        this.addQuestion_6(q10_6);
        Question_6 q11_6 = new Question_6("Πόσο γεωργικό φάρμακο πρέπει να αγοράζω;",
                "Όσο χρειάζεται η καλλιέργειά μου για όλη την " +
                        "καλλιεργητική περίοδο, με βάση την ποσότητα " +
                        "που αγόρασα πέρυσι.",
                "Όσο χρειάζομαι για τον ψεκασμό που πρόκειται να " +
                        "κάνω.",
                "Όσο χρειάζομαι για δύο ψεκασμούς, έτσι ώστε να " +
                        "έχω σε περίπτωση που δεν «πετύχει» ο πρώτος " +
                        "ψεκασμός.",
                "Την ποσότητα που θα μου προτείνει το κατάστημα " +
                        "πώλησης γεωργικών φαρμάκων.",
                "Όσο χρειάζομαι για τον ψεκασμό που πρόκειται να " +
                        "κάνω.");
        this.addQuestion_6(q11_6);
        Question_6 q12_6 = new Question_6("Για να μετρήσω την απαιτούμενη ποσότητα (έστω 100 κυβικά εκατοστά) ενός γεωργικού " +
                "φαρμάκου σε υγρή μορφή…",
                "Χρησιμοποιώ κουταλάκι το γλυκού",
                "Χρησιμοποιώ κουτάλι της σούπας",
                "Χρησιμοποιώ ζυγαριά",
                "Χρησιμοποιώ κυπελάκι που μετρά 100 κυβικά " +
                        "εκατοστά ή ογκομετρική σύριγγα.",
                "Χρησιμοποιώ κυπελάκι που μετρά 100 κυβικά " +
                        "εκατοστά ή ογκομετρική σύριγγα.");
        this.addQuestion_6(q12_6);
        Question_6 q13_6 = new Question_6("Από μπουκάλι των 250 κυβικών εκατοστών ενός εντομοκτόνου, χρησιμοποιώ τα 200 κυβικά " +
                "εκατοστά, που είναι η μέγιστη προβλεπόμενη δόση σύμφωνα με την ετικέτα. Τα υπόλοιπα 50 " +
                "κυβικά εκατοστά…",
                "Τα προσθέτω στο ψεκαστικό διάλυμα",
                "Τα διατηρώ στην αποθήκη αφού κλείσω καλά το " +
                        "μπουκάλι για τον επόμενο ψεκασμό που θα " +
                        "χρειαστεί να κάνω με το ίδιο εντομοκτόνο.",
                "Το αφήνω στο χωράφι για τον επόμενο ψεκασμό",
                "Αφού πλύνω 3 φορές το μπουκάλι και αδειάσω τα " +
                        "απόνερα στο ψεκαστικό δοχείο, το πετάω στα " +
                        "σκουπίδια.",
                "Τα διατηρώ στην αποθήκη αφού κλείσω καλά το " +
                        "μπουκάλι για τον επόμενο ψεκασμό που θα " +
                        "χρειαστεί να κάνω με το ίδιο εντομοκτόνο.");
        this.addQuestion_6(q13_6);
        Question_6 q14_6 = new Question_6("Ποιος από τους παρακάτω χώρους θεωρείται πιο κατάλληλος για αποθήκευση " +
                "φυτοπροστατευτικών προϊόντων;",
                "Μια μεταλλική ντουλάπα που κλειδώνει κι " +
                        "αερίζεται σε ειδική χτιστή αποθήκη ή ειδική χτιστή " +
                        "αποθήκη που κλειδώνει κι αερίζεται.",
                "Δεν πρέπει να υπάρχει αποθηκευτικός χώρος γιατί " +
                        "πάντα αγοράζονται οι ποσότητες που πρέπει να " +
                        "χρησιμοποιηθούν για ένα ψεκασμό.",
                "Μία ανοιχτή αποθήκη στο χώρο δίπλα από το " +
                        "τρακτέρ για εύκολη πρόσβαση.",
                "Κουτί που βρίσκεται πάνω στο τρακτέρ",
                "Μια μεταλλική ντουλάπα που κλειδώνει κι " +
                        "αερίζεται σε ειδική χτιστή αποθήκη ή ειδική χτιστή " +
                        "αποθήκη που κλειδώνει κι αερίζεται.");
        this.addQuestion_6(q14_6);
        Question_6 q15_6 = new Question_6("Όταν έχει άνεμο και για να περιορίσω την απομάκρυνση του ψεκαστικού υγρού εκτός στόχου " +
                "(καλλιέργεια, έδαφος) :",
                "Αυξάνω την πίεση ψεκασμού",
                "Μειώνω την πίεση ψεκασμού",
                "Ψεκάζω κόντρα στον άνεμο.",
                "Ψεκάζω σύμφωνα με τη φορά του ανέμου.",
                "Μειώνω την πίεση ψεκασμού");
        this.addQuestion_6(q15_6);
        Question_6 q16_6 = new Question_6("Εάν κοντά στην καλλιέργεια που θα ψεκάσω υπάρχουν κυψέλες με μέλισσες :",
                "Ψεκάζω μόνο με μυκητοκτόνα",
                "Ψεκάζω μόνο ζιζανιοκτόνα",
                "Ζητάω από τον ιδιοκτήτη να τις " +
                        "απομακρύνει",
                "Ενημερώνω τον γεωπόνο του καταστήματος που " +
                        "προμηθεύομαι τα γεωργικά φάρμακα και ακολουθώ τις " +
                        "συμβουλές του και τις οδηγίες της ετικέτας των γεωργικών " +
                        "φαρμάκων",
                "Ενημερώνω τον γεωπόνο του καταστήματος που " +
                        "προμηθεύομαι τα γεωργικά φάρμακα και ακολουθώ τις " +
                        "συμβουλές του και τις οδηγίες της ετικέτας των γεωργικών " +
                        "φαρμάκων");
        this.addQuestion_6(q16_6);
        Question_6 q17_6 = new Question_6("Η μετάδοση επιβλαβών (φυτοπαθογόνων) οργανισμών από τα χρησιμοποιούμενα μηχανήματα και " +
                "τον εξοπλισμό γίνεται όταν:",
                "Είναι παλαιά.",
                "Δεν καθαρίζονται τακτικά.",
                "Είναι καινούρια.",
                "Δεν ρυθμίζονται σωστά τα μπεκ.",
                "Δεν καθαρίζονται τακτικά.");
        this.addQuestion_6(q17_6);
        Question_6 q18_6 = new Question_6("Οι ανθεκτικές ποικιλίες φυτών, πρέπει να προτιμούνται:",
                "Μόνο εφόσον υπάρχει σχετική εντολή " +
                        "από τις αρμόδιες αρχές.",
                "Μόνο εφόσον επιδοτούνται.",
                "Μόνο εφόσον υπάρχει σε έξαρση μια " +
                        "ασθένεια.",
                "Πάντα, εφόσον βοηθούν στην προληπτική αντιμετώπιση " +
                        "του παθογόνου.",
                "Πάντα, εφόσον βοηθούν στην προληπτική αντιμετώπιση " +
                        "του παθογόνου.");
        this.addQuestion_6(q18_6);
        Question_6 q19_6 = new Question_6("Για να προστατέψω ένα ωφέλιμο έντομο στο χωράφι μου…",
                "Εφαρμόζω μέτρα βιολογικού ελέγχου και αν " +
                        "χρειαστεί γεωργικά φάρμακα, που σύμφωνα με " +
                        "τις συμβουλές του γεωπόνου δεν επηρεάζουν " +
                        "την ανάπτυξή του.",
                "Δεν ψεκάζω ποτέ με ζιζανιοκτόνα.",
                "Δεν χρησιμοποιώ χημικά λιπάσματα.",
                "Δεν ψεκάζω με υψηλή θερμοκρασία.",
                "Εφαρμόζω μέτρα βιολογικού ελέγχου και αν " +
                        "χρειαστεί γεωργικά φάρμακα, που σύμφωνα με " +
                        "τις συμβουλές του γεωπόνου δεν επηρεάζουν " +
                        "την ανάπτυξή του.");
        this.addQuestion_6(q19_6);
        Question_6 q20_6 = new Question_6("Με τις παγίδες με κόλλα μπορώ:",
                "Να παρακολουθώ αν έχει γίνει σωστός " +
                        "ψεκασμός ενός γεωργικού φαρμάκου.",
                "Να παρακολουθώ αν έβρεξε.",
                "Να ελέγχω την κατάσταση του χωραφιού μου.",
                "Να παρακολουθώ τον πληθυσμό επιβλαβών εντόμων.",
                "Να παρακολουθώ τον πληθυσμό επιβλαβών εντόμων.");
        this.addQuestion_6(q20_6);
        Question_6 q21_6 = new Question_6("Με σκοπό την αποφυγή μολύνσεων του ξύλου μετά το κλάδεμα των δένδρων…",
                "Γίνεται προληπτικός ψεκασμός του δένδρου με " +
                        "μυκητοκτόνα πριν το κλάδεμα.",
                "Μεσαίες και μεγάλες τομές καλύπτονται με ειδικό " +
                        "επουλωτικό πληγών.",
                "Διατηρείται στρώμα από ζιζάνια στο έδαφος " +
                        "κάτω από το δένδρο.",
                "Ο κλαδευτής των δένδρων φορά ειδικά γάντια.",
                "Μεσαίες και μεγάλες τομές καλύπτονται με ειδικό " +
                        "επουλωτικό πληγών.");
        this.addQuestion_6(q21_6);
        Question_6 q22_6 = new Question_6("Το καλό κλάδεμα με την αφαίρεση των προσβεβλημένων κλάδων και ο αερισμός του δέντρου που " +
                "προκύπτει από το κλάδεμα …",
                "Πρέπει να γίνεται μετά την εφαρμογή των " +
                        "γεωργικών φαρμάκων.",
                "Αποτελούν μέτρο έκτακτης ανάγκης.",
                "Δεν επηρεάζουν τις ανάγκες του δένδρου για " +
                        "εφαρμογή γεωργικών φαρμάκων.",
                "Είναι το πρώτο μέτρο μείωσης των προσβολών από " +
                        "εχθρούς (κυρίως κοκκοειδή) και ασθένειες.",
                "Είναι το πρώτο μέτρο μείωσης των προσβολών από " +
                        "εχθρούς (κυρίως κοκκοειδή) και ασθένειες.");
        this.addQuestion_6(q22_6);
        Question_6 q23_6 = new Question_6("Η οξαλίδα (ζιζάνιο) μπορεί να χρησιμοποιηθεί:",
                "Για παραγωγή τσαγιού.",
                "Σε τίποτα.",
                "Για εδαφοκάλυψη και περιορισμό των ζιζανίων " +
                        "στην ελιά, στο αμπέλι και στα εσπεριδοειδή.",
                "Για περιορισμό των εντόμων.",
                "Για εδαφοκάλυψη και περιορισμό των ζιζανίων " +
                        "στην ελιά, στο αμπέλι και στα εσπεριδοειδή.");
        this.addQuestion_6(q23_6);
        Question_6 q24_6 = new Question_6("Τα προφυτρωτικά ζιζανιοκτόνα εφαρμόζονται:",
                "Αποκλειστικά για στενόφυλλα ζιζάνια.",
                "Πριν το φύτρωμα της καλλιέργειας.",
                "Αποκλειστικά για πλατύφυλλα ζιζάνια.",
                "Μετά το φύτρωμα της καλλιέργειας",
                "Πριν το φύτρωμα της καλλιέργειας.");
        this.addQuestion_6(q24_6);
        Question_6 q25_6 = new Question_6("Η καλύτερη εποχή για την εφαρμογή της ηλιαπολύμανσης είναι:",
                "Ο χειμώνας.",
                "Η άνοιξη.",
                "Το καλοκαίρι.",
                "Το φθινόπωρο.",
                "Το καλοκαίρι.");
        this.addQuestion_6(q25_6);
        Question_6 q26_6 = new Question_6("Η ηλιαπολύμανση εφαρμόζεται:",
                "Μόνο σε καλλιέργειες θερμοκηπίου.",
                "Μόνο σε φρούτα και λαχανικά.",
                "Μόνο σε λαχανικά.",
                "Σε πολλές καλλιέργειες.",
                "Σε πολλές καλλιέργειες.");
        this.addQuestion_6(q26_6);
        Question_6 q27_6 = new Question_6("Για να προστατέψω τους υδάτινους πόρους (λίμνες, ποτάμια κλπ) που τυχόν βρίσκονται κοντά " +
                "στην καλλιέργειά μου;",
                "Δεν χρησιμοποιώ γεωργικά φάρμακα με σήμανση " +
                        "τοξικό ή δηλητήριο.",
                "Όταν χρησιμοποιώ γεωργικά φάρμακα, τα " +
                        "εφαρμόζω κρατώντας κατάλληλη απόσταση από " +
                        "τους υδάτινους πόρους.",
                "Χρησιμοποιώ μόνον γεωργικά φάρμακα στερεάς " +
                        "μορφής (σκόνες, κοκκώδη κλπ).",
                "Χρησιμοποιώ μόνον νεφελοψεκαστήρες.",
                "Όταν χρησιμοποιώ γεωργικά φάρμακα, τα " +
                        "εφαρμόζω κρατώντας κατάλληλη απόσταση από " +
                        "τους υδάτινους πόρους.");
        this.addQuestion_6(q27_6);
        Question_6 q28_6 = new Question_6("Η απόρριψη των κενών συσκευασίας σε αρδευτικά κανάλια",
                "Δεν επηρεάζει τους υδάτινους πόρους (λίμνες, " +
                        "ποτάμια κλπ) που τυχόν βρίσκονται κοντά στην " +
                        "καλλιέργειά μου.",
                "Δεν τιμωρείται από την νομοθεσία.",
                "Ρυπαίνει τους υδάτινους πόρους (λίμνες, ποτάμια " +
                        "κλπ) και εν γένει το περιβάλλον.",
                "Δεν επηρεάζει το περιβάλλον αν τα γεωργικά " +
                        "φάρμακα δεν είναι τοξικά",
                "Ρυπαίνει τους υδάτινους πόρους (λίμνες, ποτάμια " +
                        "κλπ) και εν γένει το περιβάλλον.");
        this.addQuestion_6(q28_6);
        Question_6 q29_6 = new Question_6("Για την ασφάλεια του χρήστη :",
                "Δεν είναι απαραίτητη η ύπαρξη προφυλακτήρων " +
                        "του δυναμοδότη.",
                "Είναι απαραίτητη η ύπαρξη προφυλακτήρα στον " +
                        "δυναμοδότη και στον δυναμολήπτη του " +
                        "εξοπλισμού εφαρμογής γεωργικών φαρμάκων.",
                "Η ύπαρξη προφυλακτήρα στον δυναμολήπτη είναι " +
                        "αρκετή.",
                "Οι φθορές στα εξαρτήματα μετάδοσης κίνησης " +
                        "δεν παίζουν ρόλο.",
                "Είναι απαραίτητη η ύπαρξη προφυλακτήρα στον " +
                        "δυναμοδότη και στον δυναμολήπτη του " +
                        "εξοπλισμού εφαρμογής γεωργικών φαρμάκων.");
        this.addQuestion_6(q29_6);
        Question_6 q30_6 = new Question_6("Για τη χρήση φορητού εξοπλισμού εφαρμογής γεωργικών φαρμάκων (επινώτιων ψεκαστήρων):",
                "Η βαθμονόμηση είναι απαραίτητη και πρέπει να " +
                        "γίνεται με βάση την προσωπική ταχύτητα " +
                        "βηματισμού και το ρυθμό εφαρμογής του " +
                        "χρήστη και πάντοτε μόνο με τη χρήση καθαρού " +
                        "νερού.",
                "Πρέπει να λαμβάνονται τα μέτρα ατομικής " +
                        "προστασίας του χρήστη που αναφέρονται στην " +
                        "ετικέτα του γεωργικού φαρμάκου, όπως ισχύει και " +
                        "για τους νεφελοψεκαστήρες και ψεκαστήρες " +
                        "μεγάλων καλλιεργειών.",
                "Δεν απαιτείται βαθμονόμησή του, λόγω μικρού " +
                        "όγκου ψεκαστικού διαλύματος.",
                "Η βαθμονόμηση είναι απαραίτητη και πρέπει να " +
                        "λαμβάνονται τα μέτρα ατομικής προστασίας του " +
                        "χρήστη που αναφέρονται στις άλλες απαντήσεις",
                "Η βαθμονόμηση είναι απαραίτητη και πρέπει να " +
                        "λαμβάνονται τα μέτρα ατομικής προστασίας του " +
                        "χρήστη που αναφέρονται στις άλλες απαντήσεις");
        this.addQuestion_6(q30_6);
        Question_6 q31_6 = new Question_6("Χαμηλή πίεση ψεκασμού χρησιμοποιείται:",
                "Σε εντομοκτόνα.",
                "Σε όλα τα φάρμακα για οικονομία ψεκαστικού υγρού.",
                "Στα ζιζανιοκτόνα.",
                "Στα διασυστηματικά μυκητοκτόνα.",
                "Στα ζιζανιοκτόνα.");
        this.addQuestion_6(q31_6);
        Question_6 q32_6 = new Question_6("Με τη ρύθμιση του εξοπλισμού εφαρμογής γεωργικών φαρμάκων (βαθμονόμηση) επιτυγχάνουμε:",
                "Ελάχιστες επιπτώσεις στο περιβάλλον",
                "Οικονομία στο φάρμακο",
                "Οικονομία στο φάρμακο, ελάχιστες " +
                        "επιπτώσεις στο περιβάλλον και στον εαυτό " +
                        "μας και αποτελεσματική εφαρμογή.",
                "Αποτελεσματική εφαρμογή.",
                "Οικονομία στο φάρμακο, ελάχιστες " +
                        "επιπτώσεις στο περιβάλλον και στον εαυτό " +
                        "μας και αποτελεσματική εφαρμογή.");
        this.addQuestion_6(q32_6);
        Question_6 q33_6 = new Question_6("Δεν υπάρχει κίνδυνος δηλητηρίασης διερχόμενων ζώων, εφόσον",
                "Το πλύσιμο του βυτίου γίνεται στο χωράφι.",
                "Τα χρησιμοποιούμενα γεωργικά φάρμακα δεν είναι " +
                        "δηλητήρια.",
                "Υπάρχουν διαρροές από το ψεκαστικό " +
                        "μηχάνημα.",
                "Μετά τον ψεκασμό σταματάει αμέσως η λειτουργία των " +
                        "μπεκ .",
                "Μετά τον ψεκασμό σταματάει αμέσως η λειτουργία των " +
                        "μπεκ .");
        this.addQuestion_6(q33_6);
        Question_6 q34_6 = new Question_6("Με τη σωστή συντήρηση του εξοπλισμού εφαρμογής γεωργικών φαρμάκων επιτυγχάνεται:",
                "Μεγάλη μείωση του κόστους " +
                        "καταπολέμησης.",
                "Διατήρηση του χρώματος της δεξαμενής για " +
                        "μεγαλύτερο χρονικό διάστημα.",
                "Μεταφορά των σταγονιδίων ψεκαστικού " +
                        "υγρού σε μεγαλύτερες αποστάσεις.",
                "Η ελάχιστη δυνατή ανάδευση του ψεκαστικού υγρού " +
                        "στη δεξαμενή.",
                "Μεγάλη μείωση του κόστους " +
                        "καταπολέμησης.");
        this.addQuestion_6(q34_6);
        Question_6 q35_6 = new Question_6("Η καταγραφή του εξοπλισμού εφαρμογής γεωργικών φαρμάκων:",
                "Είναι υποχρεωτική για την καλύτερη " +
                        "οργάνωση της περιοδικής επιθεώρησης που " +
                        "ακολουθεί.",
                "Είναι υποχρεωτική γιατί προβλέπεται από την " +
                        "ευρωπαϊκή και εθνική νομοθεσία.",
                "Εξυπηρετεί τη δημιουργία μητρώου που " +
                        "τηρείται στις αρμόδιες περιφερειακές " +
                        "υπηρεσίες απογραφής αγροτικών " +
                        "μηχανημάτων και αγροτικού εξηλεκτρισμού.",
                "Όλες οι άλλες απαντήσεις ισχύουν.",
                "Όλες οι άλλες απαντήσεις ισχύουν.");
        this.addQuestion_6(q35_6);
        Question_6 q36_6 = new Question_6("Για τον ψεκασμό ζιζανιοκτόνων εδάφους χρησιμοποιούμε μπέκ:",
                "Τύπου σκούπας.",
                "Τύπου κώνου.",
                "Ομοιόμορφης κατανομής.",
                "Συγκεντρωτικά.",
                "Τύπου σκούπας.");
        this.addQuestion_6(q36_6);
        Question_6 q37_6 = new Question_6("Οι βραχίονες ψεκασμού στα ψεκαστικά μηχανήματα μεγάλης καλλιέργειας",
                "Πρέπει να είναι χαλαροί.",
                "Δεν έχει σημασία σε τι ύψος βρίσκονται από την " +
                        "επιφάνεια-στόχο.",
                "Απαγορεύεται να έχουν διαφορετική " +
                        "διατομή κατά το μήκος τους.",
                "Κατασκευάζονται ώστε να ασφαλίζονται κατά τη " +
                        "μεταφορά και να ρυθμίζονται σε ύψος και κλίση κατά " +
                        "την εφαρμογή, μέσω κατάλληλων διατάξεων.",
                "Κατασκευάζονται ώστε να ασφαλίζονται κατά τη " +
                        "μεταφορά και να ρυθμίζονται σε ύψος και κλίση κατά " +
                        "την εφαρμογή, μέσω κατάλληλων διατάξεων.");
        this.addQuestion_6(q37_6);
        Question_6 q38_6 = new Question_6("Για τη συντήρηση και τον καθαρισμό των ακροφυσίων μπορούμε",
                "Να τα αποφράζουμε φυσώντας με το " +
                        "στόμα.",
                "Να τα ξεπλένουμε, χρησιμοποιώντας ειδικό βουρτσάκι ή " +
                        "να χρησιμοποιούμε δέσμη πεπιεσμένου αέρα.",
                "Να τα αποφράζουμε χρησιμοποιώντας " +
                        "αιχμηρό αντικείμενο π.χ. καρφί.",
                "Να μην τα συντηρούμε αν στο ψεκαστικό διάλυμα έχει " +
                        "προηγηθεί καλή ανάδευση.",
                "Να τα ξεπλένουμε, χρησιμοποιώντας ειδικό βουρτσάκι ή " +
                        "να χρησιμοποιούμε δέσμη πεπιεσμένου αέρα.");
        this.addQuestion_6(q38_6);
        Question_6 q39_6 = new Question_6("Το μανόμετρο πρέπει :",
                "Να έχει εύρος 80 bar όταν προορίζεται για " +
                        "νεφελοψεκαστήρα.",
                "Δεν είναι απαραίτητο να λειτουργεί όταν γνωρίζουμε " +
                        "την πίεση λειτουργίας της αντλίας.",
                "Να είναι κατάλληλης κλίμακας, ανάλογα με " +
                        "το είδος του εξοπλισμού εφαρμογής και να " +
                        "είναι ευανάγνωστο από τη θέση του χειριστή.",
                "Να έχει ένδειξη (λαμπάκι) που να υποδεικνύει άμεσα " +
                        "τυχόν διαρροή.",
                "Να είναι κατάλληλης κλίμακας, ανάλογα με " +
                        "το είδος του εξοπλισμού εφαρμογής και να " +
                        "είναι ευανάγνωστο από τη θέση του χειριστή.");
        this.addQuestion_6(q39_6);
        Question_6 q40_6 = new Question_6("Η βαλβίδα ασφαλείας εφόσον υπάρχει :",
                "Ενεργοποιείται όταν γίνεται υπέρβαση της " +
                        "πίεσης λειτουργίας και εκτονώνεται στη " +
                        "δεξαμενή.",
                "Ενεργοποιείται όταν γίνεται υπέρβαση της πίεσης " +
                        "λειτουργίας και εκτονώνεται στο περιβάλλον.",
                "Όταν ενεργοποιηθεί διακόπτει τη λειτουργία " +
                        "του ψεκαστικού μηχανήματος.",
                "Δεν μπορεί να χρησιμοποιηθεί όταν ψεκάζουμε με " +
                        "ζιζανιοκτόνο.",
                "Ενεργοποιείται όταν γίνεται υπέρβαση της " +
                        "πίεσης λειτουργίας και εκτονώνεται στη " +
                        "δεξαμενή.");
        this.addQuestion_6(q40_6);


    }

    private void addQuestions_7() {
        Question_7 q1_7 = new Question_7("Ποια από τις παρακάτω προτάσεις είναι σωστή;",
                "Τα γεωργικά φάρμακα είναι καρκινογόνα.",
                "Τα γεωργικά φάρμακα που έχουν έγκριση είναι ακίνδυνα " +
                        "με όποιο τρόπο και να τα χειριστώ.",
                "Η χρήση εγκεκριμένου γεωργικού " +
                        "φαρμάκου σύμφωνα με τις οδηγίες της " +
                        "ετικέτας του ελαχιστοποιεί τις δυσμενείς " +
                        "επιδράσεις στην υγεία του χρήστη, " +
                        "καταναλωτή και το περιβάλλον.",
                "Τα εντομοκτόνα είναι τα μόνα επικίνδυνα γεωργικά " +
                        "φάρμακα για τον άνθρωπο.",
                "Η χρήση εγκεκριμένου γεωργικού " +
                        "φαρμάκου σύμφωνα με τις οδηγίες της " +
                        "ετικέτας του ελαχιστοποιεί τις δυσμενείς " +
                        "επιδράσεις στην υγεία του χρήστη, " +
                        "καταναλωτή και το περιβάλλον.");
        this.addQuestion_7(q1_7);
        Question_7 q2_7 = new Question_7("Ένα λίπασμα μπορεί να χρησιμοποιηθεί ως γεωργικό φάρμακο για την καταπολέμηση εντόμων και " +
                "ασθενειών των φυτών",
                "Αν το συστήνει ο παρασκευαστής του",
                "Αν το συστήνει το κατάστημα πώλησης",
                "Αν υπάρχουν δοκιμές για το σκοπό αυτό.",
                "Όχι.",
                "Όχι.");
        this.addQuestion_7(q2_7);
        Question_7 q3_7 = new Question_7("Ποιος έχει την ευθύνη αν εντοπισθεί η χρήση παράνομου γεωργικού φαρμάκου;",
                "Η εταιρία ή το πρόσωπο που το πούλησε " +
                        "στο κατάστημα.",
                "Το κατάστημα ή αυτός που το πούλησε στον παραγωγό.",
                "Ο παραγωγός.",
                "Όλοι οι αναφερόμενοι στις άλλες επιλογές.",
                "Όλοι οι αναφερόμενοι στις άλλες επιλογές.");
        this.addQuestion_7(q3_7);
        Question_7 q4_7 = new Question_7("Η τήρηση αρχείου για κάθε χρήση γεωργικών φαρμάκων",
                "Πρέπει να γίνεται πολύ πριν την εφαρμογή",
                "Πρέπει να γίνεται λίγο πριν την εφαρμογή",
                "Πρέπει να γίνεται αμέσως μετά την εφαρμογή " +
                        "για να καταγράφεται η πραγματικότητα.",
                "Πρέπει να γίνεται στο τέλος κάθε εβδομάδας",
                "Πρέπει να γίνεται αμέσως μετά την εφαρμογή " +
                        "για να καταγράφεται η πραγματικότητα.");
        this.addQuestion_7(q4_7);
        Question_7 q5_7 = new Question_7("Η είσοδος σε θερμοκήπιο μετά τον ψεκασμό πρέπει να γίνεται:",
                "Αφού στεγνώσει το γεωργικό φάρμακο",
                "Σε 48 ώρες το χειμώνα και σε 6 ώρες το καλοκαίρι, " +
                        "μετά τον ψεκασμό.",
                "Αφού στεγνώσει το γεωργικό φάρμακο και " +
                        "εξαεριστεί ο χώρος εκτός αν κάτι άλλο αναφέρεται " +
                        "στην ετικέτα.",
                "Φορώντας τα προστατευτικά μέσα που " +
                        "αναφέρονται στην ετικέτα του γεωργικού φαρμάκου " +
                        "για τουλάχιστον μία ημέρα.",
                "Αφού στεγνώσει το γεωργικό φάρμακο και " +
                        "εξαεριστεί ο χώρος εκτός αν κάτι άλλο αναφέρεται " +
                        "στην ετικέτα.");
        this.addQuestion_7(q5_7);
        Question_7 q6_7 = new Question_7("Η τελευταία επέμβαση ενός γεωργικού φαρμάκου πριν τη συγκομιδή είναι 7 ημέρες. Αυτό σημαίνει:",
                "Για 7 ημέρες πριν τη συγκομιδή απαγορεύονται οι " +
                        "ψεκασμοί με όλα τα γεωργικά φάρμακα.",
                "Πρέπει να περάσουν τουλάχιστον 7 ημέρες μετά τον " +
                        "ψεκασμό του συγκεκριμένου γεωργικού φαρμάκου " +
                        "για να συγκομίσω.",
                "Μπορώ να συγκομίσω και νωρίτερα αρκεί να " +
                        "περάσουν τουλάχιστον 7 ημέρες μετά τον " +
                        "ψεκασμό του συγκεκριμένου γεωργικού " +
                        "φαρμάκου μέχρι να καταναλωθεί.",
                "Το φάρμακο είναι μέτρια οικολογικό.",
                "Πρέπει να περάσουν τουλάχιστον 7 ημέρες μετά τον " +
                        "ψεκασμό του συγκεκριμένου γεωργικού φαρμάκου " +
                        "για να συγκομίσω.");
        this.addQuestion_7(q6_7);
        Question_7 q7_7 = new Question_7("Κατά τη διάρκεια του ψεκασμού των γεωργικών φαρμάκων επιτρέπεται το κάπνισμα:",
                "Εφόσον ο ψεκαστής φορά τα γάντια που " +
                        "αναφέρονται επί της ετικέτας του γεωργικού " +
                        "φαρμάκου.",
                "Σε καμία περίπτωση δεν επιτρέπεται το κάπνισμα.",
                "Εφόσον τα τσιγάρα δεν έχουν βραχεί από το " +
                        "ψεκαστικό υγρό.",
                "Εφόσον είναι ηλεκτρονικό τσιγάρο.",
                "Σε καμία περίπτωση δεν επιτρέπεται το κάπνισμα.");
        this.addQuestion_7(q7_7);
        Question_7 q8_7 = new Question_7("Η κατανάλωση τροφής κατά την διάρκεια του ψεκασμού επιτρέπεται μόνο όταν:",
                "Το γεωργικό φάρμακο που ψεκάζουμε είναι " +
                        "μυκητοκτόνο.",
                "Το γεωργικό φάρμακο που ψεκάζουμε έχει μικρή " +
                        "τοξικότητα.",
                "Βγάζουμε τα γάντια που φοράμε στον ψεκασμό.",
                "Ποτέ.",
                "Ποτέ.");
        this.addQuestion_7(q8_7);
        Question_7 q9_7 = new Question_7("Η χρήση καυσόξυλων για ψήσιμο από ψεκασμένες καλλιέργειες (πχ. κληματίδες από κλάδεμα " +
                "αμπελιού) επιτρέπεται μόνο όταν:",
                "Έχει περάσει το χρονικό διάστημα της τελευταίας " +
                        "επέμβασης πριν την συγκομιδή.",
                "Είναι χειμώνας.",
                "Ποτέ.",
                "Εάν δεν φυσάει αέρας.",
                "Ποτέ.");
        this.addQuestion_7(q9_7);
        Question_7 q10_7 = new Question_7("Κατά τη διάρκεια εφαρμογής (ψεκασμός) φοράω:",
                "Πέδιλα.",
                "Λαστιχένιες μπότες χωρίς εσωτερική επένδυση.",
                "Αθλητικά παπούτσια.",
                "Δερμάτινες μπότες.",
                "Λαστιχένιες μπότες χωρίς εσωτερική επένδυση.");
        this.addQuestion_7(q10_7);
        Question_7 q11_7 = new Question_7("Αναγκαίο είναι το πλύσιμο για:",
                "Τη φόρμα μιας χρήσης.",
                "Τη φόρμα πολλαπλών χρήσεων.",
                "Τη μάσκα μιας χρήσης.",
                "Τα αθλητικά παπούτσια.",
                "Τη φόρμα πολλαπλών χρήσεων.");
        this.addQuestion_7(q11_7);
        Question_7 q12_7 = new Question_7("Μετά τον ψεκασμό:",
                "Συνεχίζω με τις υπόλοιπες δουλειές.",
                "Μπαίνω στο χωράφι και ελέγχω",
                "Κάνω ντους.",
                "Ξεκουράζομαι στην άκρη του χωραφιού",
                "Κάνω ντους.");
        this.addQuestion_7(q12_7);
        Question_7 q13_7 = new Question_7("Χρησιμοποιώ μεγαλύτερη δόση από την αναγραφόμενη στην ετικέτα ενός εντομοκτόνου:",
                "Όταν υπάρχει έντονο πρόβλημα προσβολής από " +
                        "έντομα.",
                "Ποτέ σε καμία περίπτωση.",
                "Όταν ο ψεκασμός είναι προληπτικός.",
                "Όταν θέλω να καταπολεμήσω ταυτόχρονα " +
                        "περισσότερα από δυο είδη εντόμων.",
                "Ποτέ σε καμία περίπτωση.");
        this.addQuestion_7(q13_7);
        Question_7 q14_7 = new Question_7("Ψεκάζω μόνο όταν ο άνεμος:",
                "Δεν είναι ισχυρός.",
                "Δεν είναι κρύος .",
                "Έχει άπνοια, αλλιώς απαγορεύεται.",
                "Πνέει αντίθετα.",
                "Δεν είναι ισχυρός.");
        this.addQuestion_7(q14_7);
        Question_7 q15_7 = new Question_7("Το πότισμα με υπερβολική ποσότητα νερού:",
                "Προκαλεί έκπλυση (ξέπλυμα) των " +
                        "γεωργικών φαρμάκων που εφαρμόστηκαν " +
                        "στο έδαφος.",
                "Βοηθά στη δράση ων γεωργικών φαρμάκων που " +
                        "εφαρμόστηκαν στο έδαφος.",
                "Δυναμώνει τα φυτά.",
                "Δεν έχει καμία επίπτωση.",
                "Προκαλεί έκπλυση (ξέπλυμα) των " +
                        "γεωργικών φαρμάκων που εφαρμόστηκαν " +
                        "στο έδαφος.");
        this.addQuestion_7(q15_7);
        Question_7 q16_7 = new Question_7("Ο κίνδυνος έκπλυσης (ξεπλύματος) των γεωργικών φαρμάκων προς τα υπόγεια νερά, είναι μεγάλος:",
                "Σε εδάφη με ρωγμές.",
                "Σε εδάφη με χαλικώδες ή αμμώδες υπέδαφος.",
                "Σε εδάφη με υψηλό υδροφόρο ορίζοντα.",
                "Σε κάθε περίπτωση των άλλων απαντήσεων",
                "Σε κάθε περίπτωση των άλλων απαντήσεων");
        this.addQuestion_7(q16_7);
        Question_7 q17_7 = new Question_7("Η μετάδοση επιβλαβών (φυτοπαθογόνων) οργανισμών από τα χρησιμοποιούμενα μηχανήματα και " +
                "τον εξοπλισμό γίνεται όταν:",
                "Είναι παλαιά.",
                "Δεν καθαρίζονται τακτικά.",
                "Είναι καινούρια.",
                "Δεν ρυθμίζονται σωστά τα μπεκ.",
                "Δεν καθαρίζονται τακτικά.");
        this.addQuestion_7(q17_7);
        Question_7 q18_7 = new Question_7("Οι ανθεκτικές ποικιλίες φυτών, πρέπει να προτιμούνται:",
                "Μόνο εφόσον υπάρχει σχετική εντολή " +
                        "από τις αρμόδιες αρχές.",
                "Μόνο εφόσον επιδοτούνται.",
                "Μόνο εφόσον υπάρχει σε έξαρση μια " +
                        "ασθένεια.",
                "Πάντα, εφόσον βοηθούν στην προληπτική αντιμετώπιση " +
                        "του παθογόνου.",
                "Πάντα, εφόσον βοηθούν στην προληπτική αντιμετώπιση " +
                        "του παθογόνου.");
        this.addQuestion_7(q18_7);
        Question_7 q19_7 = new Question_7("Για να προστατέψω ένα ωφέλιμο έντομο στο χωράφι μου…",
                "Εφαρμόζω μέτρα βιολογικού ελέγχου και αν " +
                        "χρειαστεί γεωργικά φάρμακα, που σύμφωνα με " +
                        "τις συμβουλές του γεωπόνου δεν επηρεάζουν " +
                        "την ανάπτυξή του.",
                "Δεν ψεκάζω ποτέ με ζιζανιοκτόνα.",
                "Δεν χρησιμοποιώ χημικά λιπάσματα.",
                "Δεν ψεκάζω με υψηλή θερμοκρασία.",
                "Εφαρμόζω μέτρα βιολογικού ελέγχου και αν " +
                        "χρειαστεί γεωργικά φάρμακα, που σύμφωνα με " +
                        "τις συμβουλές του γεωπόνου δεν επηρεάζουν " +
                        "την ανάπτυξή του.");
        this.addQuestion_7(q19_7);
        Question_7 q20_7 = new Question_7("Με τις παγίδες με κόλλα μπορώ:",
                "Να παρακολουθώ αν έχει γίνει σωστός " +
                        "ψεκασμός ενός γεωργικού φαρμάκου.",
                "Να παρακολουθώ αν έβρεξε.",
                "Να ελέγχω την κατάσταση του χωραφιού μου.",
                "Να παρακολουθώ τον πληθυσμό επιβλαβών εντόμων.",
                "Να παρακολουθώ τον πληθυσμό επιβλαβών εντόμων.");
        this.addQuestion_7(q20_7);
        Question_7 q21_7 = new Question_7("Με σκοπό την αποφυγή μολύνσεων του ξύλου μετά το κλάδεμα των δένδρων…",
                "Γίνεται προληπτικός ψεκασμός του δένδρου με " +
                        "μυκητοκτόνα πριν το κλάδεμα.",
                "Μεσαίες και μεγάλες τομές καλύπτονται με ειδικό " +
                        "επουλωτικό πληγών.",
                "Διατηρείται στρώμα από ζιζάνια στο έδαφος " +
                        "κάτω από το δένδρο.",
                "Ο κλαδευτής των δένδρων φορά ειδικά γάντια.",
                "Μεσαίες και μεγάλες τομές καλύπτονται με ειδικό " +
                        "επουλωτικό πληγών.");
        this.addQuestion_7(q21_7);
        Question_7 q22_7 = new Question_7("Το καλό κλάδεμα με την αφαίρεση των προσβεβλημένων κλάδων και ο αερισμός του δέντρου που " +
                "προκύπτει από το κλάδεμα …",
                "Πρέπει να γίνεται μετά την εφαρμογή των " +
                        "γεωργικών φαρμάκων.",
                "Αποτελούν μέτρο έκτακτης ανάγκης.",
                "Δεν επηρεάζουν τις ανάγκες του δένδρου για " +
                        "εφαρμογή γεωργικών φαρμάκων.",
                "Είναι το πρώτο μέτρο μείωσης των προσβολών από " +
                        "εχθρούς (κυρίως κοκκοειδή) και ασθένειες.",
                "Είναι το πρώτο μέτρο μείωσης των προσβολών από " +
                        "εχθρούς (κυρίως κοκκοειδή) και ασθένειες.");
        this.addQuestion_7(q22_7);
        Question_7 q23_7 = new Question_7("Η οξαλίδα (ζιζάνιο) μπορεί να χρησιμοποιηθεί:",
                "Για παραγωγή τσαγιού.",
                "Σε τίποτα.",
                "Για εδαφοκάλυψη και περιορισμό των ζιζανίων " +
                        "στην ελιά, στο αμπέλι και στα εσπεριδοειδή.",
                "Για περιορισμό των εντόμων.",
                "Για εδαφοκάλυψη και περιορισμό των ζιζανίων " +
                        "στην ελιά, στο αμπέλι και στα εσπεριδοειδή.");
        this.addQuestion_7(q23_7);
        Question_7 q24_7 = new Question_7("Τα προφυτρωτικά ζιζανιοκτόνα εφαρμόζονται:",
                "Αποκλειστικά για στενόφυλλα ζιζάνια.",
                "Πριν το φύτρωμα της καλλιέργειας.",
                "Αποκλειστικά για πλατύφυλλα ζιζάνια.",
                "Μετά το φύτρωμα της καλλιέργειας",
                "Πριν το φύτρωμα της καλλιέργειας.");
        this.addQuestion_7(q24_7);
        Question_7 q25_7 = new Question_7("Η καλύτερη εποχή για την εφαρμογή της ηλιαπολύμανσης είναι:",
                "Ο χειμώνας.",
                "Η άνοιξη.",
                "Το καλοκαίρι.",
                "Το φθινόπωρο.",
                "Το καλοκαίρι.");
        this.addQuestion_7(q25_7);
        Question_7 q26_7 = new Question_7("Η ηλιαπολύμανση εφαρμόζεται:",
                "Μόνο σε καλλιέργειες θερμοκηπίου.",
                "Μόνο σε φρούτα και λαχανικά.",
                "Μόνο σε λαχανικά.",
                "Σε πολλές καλλιέργειες.",
                "Σε πολλές καλλιέργειες.");
        this.addQuestion_7(q26_7);
        Question_7 q27_7 = new Question_7("Για να προστατέψω τους υδάτινους πόρους (λίμνες, ποτάμια κλπ) που τυχόν βρίσκονται κοντά " +
                "στην καλλιέργειά μου;",
                "Δεν χρησιμοποιώ γεωργικά φάρμακα με σήμανση " +
                        "τοξικό ή δηλητήριο.",
                "Όταν χρησιμοποιώ γεωργικά φάρμακα, τα " +
                        "εφαρμόζω κρατώντας κατάλληλη απόσταση από " +
                        "τους υδάτινους πόρους.",
                "Χρησιμοποιώ μόνον γεωργικά φάρμακα στερεάς " +
                        "μορφής (σκόνες, κοκκώδη κλπ).",
                "Χρησιμοποιώ μόνον νεφελοψεκαστήρες.",
                "Όταν χρησιμοποιώ γεωργικά φάρμακα, τα " +
                        "εφαρμόζω κρατώντας κατάλληλη απόσταση από " +
                        "τους υδάτινους πόρους.");
        this.addQuestion_7(q27_7);
        Question_7 q28_7 = new Question_7("Η απόρριψη των κενών συσκευασίας σε αρδευτικά κανάλια",
                "Δεν επηρεάζει τους υδάτινους πόρους (λίμνες, " +
                        "ποτάμια κλπ) που τυχόν βρίσκονται κοντά στην " +
                        "καλλιέργειά μου.",
                "Δεν τιμωρείται από την νομοθεσία.",
                "Ρυπαίνει τους υδάτινους πόρους (λίμνες, ποτάμια " +
                        "κλπ) και εν γένει το περιβάλλον.",
                "Δεν επηρεάζει το περιβάλλον αν τα γεωργικά " +
                        "φάρμακα δεν είναι τοξικά",
                "Ρυπαίνει τους υδάτινους πόρους (λίμνες, ποτάμια " +
                        "κλπ) και εν γένει το περιβάλλον.");
        this.addQuestion_7(q28_7);
        Question_7 q29_7 = new Question_7("Για την ασφάλεια του χρήστη :",
                "Δεν είναι απαραίτητη η ύπαρξη προφυλακτήρων " +
                        "του δυναμοδότη.",
                "Είναι απαραίτητη η ύπαρξη προφυλακτήρα στον " +
                        "δυναμοδότη και στον δυναμολήπτη του " +
                        "εξοπλισμού εφαρμογής γεωργικών φαρμάκων.",
                "Η ύπαρξη προφυλακτήρα στον δυναμολήπτη είναι " +
                        "αρκετή.",
                "Οι φθορές στα εξαρτήματα μετάδοσης κίνησης " +
                        "δεν παίζουν ρόλο.",
                "Είναι απαραίτητη η ύπαρξη προφυλακτήρα στον " +
                        "δυναμοδότη και στον δυναμολήπτη του " +
                        "εξοπλισμού εφαρμογής γεωργικών φαρμάκων.");
        this.addQuestion_7(q29_7);
        Question_7 q30_7 = new Question_7("Για τη χρήση φορητού εξοπλισμού εφαρμογής γεωργικών φαρμάκων (επινώτιων ψεκαστήρων):",
                "Η βαθμονόμηση είναι απαραίτητη και πρέπει να " +
                        "γίνεται με βάση την προσωπική ταχύτητα " +
                        "βηματισμού και το ρυθμό εφαρμογής του " +
                        "χρήστη και πάντοτε μόνο με τη χρήση καθαρού " +
                        "νερού.",
                "Πρέπει να λαμβάνονται τα μέτρα ατομικής " +
                        "προστασίας του χρήστη που αναφέρονται στην " +
                        "ετικέτα του γεωργικού φαρμάκου, όπως ισχύει και " +
                        "για τους νεφελοψεκαστήρες και ψεκαστήρες " +
                        "μεγάλων καλλιεργειών.",
                "Δεν απαιτείται βαθμονόμησή του, λόγω μικρού " +
                        "όγκου ψεκαστικού διαλύματος.",
                "Η βαθμονόμηση είναι απαραίτητη και πρέπει να " +
                        "λαμβάνονται τα μέτρα ατομικής προστασίας του " +
                        "χρήστη που αναφέρονται στις άλλες απαντήσεις",
                "Η βαθμονόμηση είναι απαραίτητη και πρέπει να " +
                        "λαμβάνονται τα μέτρα ατομικής προστασίας του " +
                        "χρήστη που αναφέρονται στις άλλες απαντήσεις");
        this.addQuestion_7(q30_7);
        Question_7 q31_7 = new Question_7("Χαμηλή πίεση ψεκασμού χρησιμοποιείται:",
                "Σε εντομοκτόνα.",
                "Σε όλα τα φάρμακα για οικονομία ψεκαστικού υγρού.",
                "Στα ζιζανιοκτόνα.",
                "Στα διασυστηματικά μυκητοκτόνα.",
                "Στα ζιζανιοκτόνα.");
        this.addQuestion_7(q31_7);
        Question_7 q32_7 = new Question_7("Με τη ρύθμιση του εξοπλισμού εφαρμογής γεωργικών φαρμάκων (βαθμονόμηση) επιτυγχάνουμε:",
                "Ελάχιστες επιπτώσεις στο περιβάλλον",
                "Οικονομία στο φάρμακο",
                "Οικονομία στο φάρμακο, ελάχιστες " +
                        "επιπτώσεις στο περιβάλλον και στον εαυτό " +
                        "μας και αποτελεσματική εφαρμογή.",
                "Αποτελεσματική εφαρμογή.",
                "Οικονομία στο φάρμακο, ελάχιστες " +
                        "επιπτώσεις στο περιβάλλον και στον εαυτό " +
                        "μας και αποτελεσματική εφαρμογή.");
        this.addQuestion_7(q32_7);
        Question_7 q33_7 = new Question_7("Δεν υπάρχει κίνδυνος δηλητηρίασης διερχόμενων ζώων, εφόσον",
                "Το πλύσιμο του βυτίου γίνεται στο χωράφι.",
                "Τα χρησιμοποιούμενα γεωργικά φάρμακα δεν είναι " +
                        "δηλητήρια.",
                "Υπάρχουν διαρροές από το ψεκαστικό " +
                        "μηχάνημα.",
                "Μετά τον ψεκασμό σταματάει αμέσως η λειτουργία των " +
                        "μπεκ .",
                "Μετά τον ψεκασμό σταματάει αμέσως η λειτουργία των " +
                        "μπεκ .");
        this.addQuestion_7(q33_7);
        Question_7 q34_7 = new Question_7("Με τη σωστή συντήρηση του εξοπλισμού εφαρμογής γεωργικών φαρμάκων επιτυγχάνεται:",
                "Μεγάλη μείωση του κόστους " +
                        "καταπολέμησης.",
                "Διατήρηση του χρώματος της δεξαμενής για " +
                        "μεγαλύτερο χρονικό διάστημα.",
                "Μεταφορά των σταγονιδίων ψεκαστικού " +
                        "υγρού σε μεγαλύτερες αποστάσεις.",
                "Η ελάχιστη δυνατή ανάδευση του ψεκαστικού υγρού " +
                        "στη δεξαμενή.",
                "Μεγάλη μείωση του κόστους " +
                        "καταπολέμησης.");
        this.addQuestion_7(q34_7);
        Question_7 q35_7 = new Question_7("Η καταγραφή του εξοπλισμού εφαρμογής γεωργικών φαρμάκων:",
                "Είναι υποχρεωτική για την καλύτερη " +
                        "οργάνωση της περιοδικής επιθεώρησης που " +
                        "ακολουθεί.",
                "Είναι υποχρεωτική γιατί προβλέπεται από την " +
                        "ευρωπαϊκή και εθνική νομοθεσία.",
                "Εξυπηρετεί τη δημιουργία μητρώου που " +
                        "τηρείται στις αρμόδιες περιφερειακές " +
                        "υπηρεσίες απογραφής αγροτικών " +
                        "μηχανημάτων και αγροτικού εξηλεκτρισμού.",
                "Όλες οι άλλες απαντήσεις ισχύουν.",
                "Όλες οι άλλες απαντήσεις ισχύουν.");
        this.addQuestion_7(q35_7);
        Question_7 q36_7 = new Question_7("Για τον ψεκασμό ζιζανιοκτόνων εδάφους χρησιμοποιούμε μπέκ:",
                "Τύπου σκούπας.",
                "Τύπου κώνου.",
                "Ομοιόμορφης κατανομής.",
                "Συγκεντρωτικά.",
                "Τύπου σκούπας.");
        this.addQuestion_7(q36_7);
        Question_7 q37_7 = new Question_7("Οι βραχίονες ψεκασμού στα ψεκαστικά μηχανήματα μεγάλης καλλιέργειας",
                "Πρέπει να είναι χαλαροί.",
                "Δεν έχει σημασία σε τι ύψος βρίσκονται από την " +
                        "επιφάνεια-στόχο.",
                "Απαγορεύεται να έχουν διαφορετική " +
                        "διατομή κατά το μήκος τους.",
                "Κατασκευάζονται ώστε να ασφαλίζονται κατά τη " +
                        "μεταφορά και να ρυθμίζονται σε ύψος και κλίση κατά " +
                        "την εφαρμογή, μέσω κατάλληλων διατάξεων.",
                "Κατασκευάζονται ώστε να ασφαλίζονται κατά τη " +
                        "μεταφορά και να ρυθμίζονται σε ύψος και κλίση κατά " +
                        "την εφαρμογή, μέσω κατάλληλων διατάξεων.");
        this.addQuestion_7(q37_7);
        Question_7 q38_7 = new Question_7("Για τη συντήρηση και τον καθαρισμό των ακροφυσίων μπορούμε",
                "Να τα αποφράζουμε φυσώντας με το " +
                        "στόμα.",
                "Να τα ξεπλένουμε, χρησιμοποιώντας ειδικό βουρτσάκι ή " +
                        "να χρησιμοποιούμε δέσμη πεπιεσμένου αέρα.",
                "Να τα αποφράζουμε χρησιμοποιώντας " +
                        "αιχμηρό αντικείμενο π.χ. καρφί.",
                "Να μην τα συντηρούμε αν στο ψεκαστικό διάλυμα έχει " +
                        "προηγηθεί καλή ανάδευση.",
                "Να τα ξεπλένουμε, χρησιμοποιώντας ειδικό βουρτσάκι ή " +
                        "να χρησιμοποιούμε δέσμη πεπιεσμένου αέρα.");
        this.addQuestion_7(q38_7);
        Question_7 q39_7 = new Question_7("Το μανόμετρο πρέπει :",
                "Να έχει εύρος 80 bar όταν προορίζεται για " +
                        "νεφελοψεκαστήρα.",
                "Δεν είναι απαραίτητο να λειτουργεί όταν γνωρίζουμε " +
                        "την πίεση λειτουργίας της αντλίας.",
                "Να είναι κατάλληλης κλίμακας, ανάλογα με " +
                        "το είδος του εξοπλισμού εφαρμογής και να " +
                        "είναι ευανάγνωστο από τη θέση του χειριστή.",
                "Να έχει ένδειξη (λαμπάκι) που να υποδεικνύει άμεσα " +
                        "τυχόν διαρροή.",
                "Να είναι κατάλληλης κλίμακας, ανάλογα με " +
                        "το είδος του εξοπλισμού εφαρμογής και να " +
                        "είναι ευανάγνωστο από τη θέση του χειριστή.");
        this.addQuestion_7(q39_7);
        Question_7 q40_7 = new Question_7("Η βαλβίδα ασφαλείας εφόσον υπάρχει :",
                "Ενεργοποιείται όταν γίνεται υπέρβαση της " +
                        "πίεσης λειτουργίας και εκτονώνεται στη " +
                        "δεξαμενή.",
                "Ενεργοποιείται όταν γίνεται υπέρβαση της πίεσης " +
                        "λειτουργίας και εκτονώνεται στο περιβάλλον.",
                "Όταν ενεργοποιηθεί διακόπτει τη λειτουργία " +
                        "του ψεκαστικού μηχανήματος.",
                "Δεν μπορεί να χρησιμοποιηθεί όταν ψεκάζουμε με " +
                        "ζιζανιοκτόνο.",
                "Ενεργοποιείται όταν γίνεται υπέρβαση της " +
                        "πίεσης λειτουργίας και εκτονώνεται στη " +
                        "δεξαμενή.");
        this.addQuestion_7(q40_7);
    }


    @Override
    public void onUpgrade(SQLiteDatabase db, int oldV, int newV) {
        // Drop older table if existed
        db.execSQL("DROP TABLE IF EXISTS " + TABLE_QUEST);
        db.execSQL("DROP TABLE IF EXISTS " + TABLE_QUEST_2);
        db.execSQL("DROP TABLE IF EXISTS " + TABLE_QUEST_3);
        db.execSQL("DROP TABLE IF EXISTS " + TABLE_QUEST_4);
        db.execSQL("DROP TABLE IF EXISTS " + TABLE_QUEST_5);
        db.execSQL("DROP TABLE IF EXISTS " + TABLE_QUEST_6);
        db.execSQL("DROP TABLE IF EXISTS " + TABLE_QUEST_7);
        // Create tables again
        onCreate(db);
    }

    // Adding new question
    public void addQuestion(Question quest) {
        //SQLiteDatabase db = this.getWritableDatabase();
        ContentValues values = new ContentValues();
        values.put(KEY_QUES, quest.getQUESTION());
        values.put(KEY_ANSWER, quest.getANSWER());
        values.put(KEY_OPTA, quest.getOPTA());
        values.put(KEY_OPTB, quest.getOPTB());
        values.put(KEY_OPTC, quest.getOPTC());
        values.put(KEY_OPTD, quest.getOPTD());
        // Inserting Row
        dbase.insert(TABLE_QUEST, null, values);
    }

    public void addQuestion_2(Question_2 quest_2) {
        //SQLiteDatabase db = this.getWritableDatabase();
        ContentValues values_2 = new ContentValues();
        values_2.put(KEY_QUES_2, quest_2.getQUESTION_2());
        values_2.put(KEY_ANSWER_2, quest_2.getANSWER_2());
        values_2.put(KEY_OPTA_2, quest_2.getOPTA_2());
        values_2.put(KEY_OPTB_2, quest_2.getOPTB_2());
        values_2.put(KEY_OPTC_2, quest_2.getOPTC_2());
        values_2.put(KEY_OPTD_2, quest_2.getOPTD_2());
        // Inserting Row
        dbase.insert(TABLE_QUEST_2, null, values_2);
    }

    public void addQuestion_3(Question_3 quest_3) {
        //SQLiteDatabase db = this.getWritableDatabase();
        ContentValues values_3 = new ContentValues();
        values_3.put(KEY_QUES_3, quest_3.getQUESTION_3());
        values_3.put(KEY_ANSWER_3, quest_3.getANSWER_3());
        values_3.put(KEY_OPTA_3, quest_3.getOPTA_3());
        values_3.put(KEY_OPTB_3, quest_3.getOPTB_3());
        values_3.put(KEY_OPTC_3, quest_3.getOPTC_3());
        values_3.put(KEY_OPTD_3, quest_3.getOPTD_3());
        // Inserting Row
        dbase.insert(TABLE_QUEST_3, null, values_3);
    }

    public void addQuestion_4(Question_4 quest_4) {
        //SQLiteDatabase db = this.getWritableDatabase();
        ContentValues values_4 = new ContentValues();
        values_4.put(KEY_QUES_4, quest_4.getQUESTION_4());
        values_4.put(KEY_ANSWER_4, quest_4.getANSWER_4());
        values_4.put(KEY_OPTA_4, quest_4.getOPTA_4());
        values_4.put(KEY_OPTB_4, quest_4.getOPTB_4());
        values_4.put(KEY_OPTC_4, quest_4.getOPTC_4());
        values_4.put(KEY_OPTD_4, quest_4.getOPTD_4());
        // Inserting Row
        dbase.insert(TABLE_QUEST_4, null, values_4);
    }

    public void addQuestion_5(Question_5 quest_5) {
        //SQLiteDatabase db = this.getWritableDatabase();
        ContentValues values_5 = new ContentValues();
        values_5.put(KEY_QUES_5, quest_5.getQUESTION_5());
        values_5.put(KEY_ANSWER_5, quest_5.getANSWER_5());
        values_5.put(KEY_OPTA_5, quest_5.getOPTA_5());
        values_5.put(KEY_OPTB_5, quest_5.getOPTB_5());
        values_5.put(KEY_OPTC_5, quest_5.getOPTC_5());
        values_5.put(KEY_OPTD_5, quest_5.getOPTD_5());
        // Inserting Row
        dbase.insert(TABLE_QUEST_5, null, values_5);
    }

    public void addQuestion_6(Question_6 quest_6) {
        //SQLiteDatabase db = this.getWritableDatabase();
        ContentValues values_6 = new ContentValues();
        values_6.put(KEY_QUES_6, quest_6.getQUESTION_6());
        values_6.put(KEY_ANSWER_6, quest_6.getANSWER_6());
        values_6.put(KEY_OPTA_6, quest_6.getOPTA_6());
        values_6.put(KEY_OPTB_6, quest_6.getOPTB_6());
        values_6.put(KEY_OPTC_6, quest_6.getOPTC_6());
        values_6.put(KEY_OPTD_6, quest_6.getOPTD_6());
        // Inserting Row
        dbase.insert(TABLE_QUEST_6, null, values_6);
    }

    public void addQuestion_7(Question_7 quest_7) {
        //SQLiteDatabase db = this.getWritableDatabase();
        ContentValues values_7 = new ContentValues();
        values_7.put(KEY_QUES_7, quest_7.getQUESTION_7());
        values_7.put(KEY_ANSWER_7, quest_7.getANSWER_7());
        values_7.put(KEY_OPTA_7, quest_7.getOPTA_7());
        values_7.put(KEY_OPTB_7, quest_7.getOPTB_7());
        values_7.put(KEY_OPTC_7, quest_7.getOPTC_7());
        values_7.put(KEY_OPTD_7, quest_7.getOPTD_7());
        // Inserting Row
        dbase.insert(TABLE_QUEST_7, null, values_7);
    }


    public List<Question> getAllQuestions() {
        List<Question> quesList = new ArrayList<Question>();
        // Select All Query
        String selectQuery = "SELECT  * FROM " + TABLE_QUEST;
        dbase = this.getReadableDatabase();
        Cursor cursor = dbase.rawQuery(selectQuery, null);
        // looping through all rows and adding to list
        if (cursor.moveToFirst()) {
            do {
                Question quest = new Question();
                quest.setID(cursor.getInt(0));
                quest.setQUESTION(cursor.getString(1));
                quest.setANSWER(cursor.getString(2));
                quest.setOPTA(cursor.getString(3));
                quest.setOPTB(cursor.getString(4));
                quest.setOPTC(cursor.getString(5));
                quest.setOPTD(cursor.getString(6));
                quesList.add(quest);
            } while (cursor.moveToNext());
        }
        cursor.close();
        // return quest list
        return quesList;
    }

    public List<Question_2> getAllQuestions_2() {
        List<Question_2> quesList_2 = new ArrayList<Question_2>();
        // Select All Query
        String selectQuery_2 = "SELECT  * FROM " + TABLE_QUEST_2;
        dbase = this.getReadableDatabase();
        Cursor cursor_2 = dbase.rawQuery(selectQuery_2, null);
        // looping through all rows and adding to list
        if (cursor_2.moveToFirst()) {
            do {
                Question_2 quest_2 = new Question_2();
                quest_2.setID_2(cursor_2.getInt(0));
                quest_2.setQUESTION_2(cursor_2.getString(1));
                quest_2.setANSWER_2(cursor_2.getString(2));
                quest_2.setOPTA_2(cursor_2.getString(3));
                quest_2.setOPTB_2(cursor_2.getString(4));
                quest_2.setOPTC_2(cursor_2.getString(5));
                quest_2.setOPTD_2(cursor_2.getString(6));
                quesList_2.add(quest_2);
            } while (cursor_2.moveToNext());
        }
        cursor_2.close();
        // return quest list
        return quesList_2;
    }

    public List<Question_3> getAllQuestions_3() {
        List<Question_3> quesList_3 = new ArrayList<Question_3>();
        // Select All Query
        String selectQuery_3 = "SELECT  * FROM " + TABLE_QUEST_3;
        dbase = this.getReadableDatabase();
        Cursor cursor_3 = dbase.rawQuery(selectQuery_3, null);
        // looping through all rows and adding to list
        if (cursor_3.moveToFirst()) {
            do {
                Question_3 quest_3 = new Question_3();
                quest_3.setID_3(cursor_3.getInt(0));
                quest_3.setQUESTION_3(cursor_3.getString(1));
                quest_3.setANSWER_3(cursor_3.getString(2));
                quest_3.setOPTA_3(cursor_3.getString(3));
                quest_3.setOPTB_3(cursor_3.getString(4));
                quest_3.setOPTC_3(cursor_3.getString(5));
                quest_3.setOPTD_3(cursor_3.getString(6));
                quesList_3.add(quest_3);
            } while (cursor_3.moveToNext());
        }
        cursor_3.close();
        // return quest list
        return quesList_3;
    }

    public List<Question_4> getAllQuestions_4() {
        List<Question_4> quesList_4 = new ArrayList<Question_4>();
        // Select All Query
        String selectQuery_4 = "SELECT  * FROM " + TABLE_QUEST_4;
        dbase = this.getReadableDatabase();
        Cursor cursor_4 = dbase.rawQuery(selectQuery_4, null);
        // looping through all rows and adding to list
        if (cursor_4.moveToFirst()) {
            do {
                Question_4 quest_4 = new Question_4();
                quest_4.setID_4(cursor_4.getInt(0));
                quest_4.setQUESTION_4(cursor_4.getString(1));
                quest_4.setANSWER_4(cursor_4.getString(2));
                quest_4.setOPTA_4(cursor_4.getString(3));
                quest_4.setOPTB_4(cursor_4.getString(4));
                quest_4.setOPTC_4(cursor_4.getString(5));
                quest_4.setOPTD_4(cursor_4.getString(6));
                quesList_4.add(quest_4);
            } while (cursor_4.moveToNext());
        }
        cursor_4.close();
        // return quest list
        return quesList_4;
    }

    public List<Question_5> getAllQuestions_5() {
        List<Question_5> quesList_5 = new ArrayList<Question_5>();
        // Select All Query
        String selectQuery_5 = "SELECT  * FROM " + TABLE_QUEST_5;
        dbase = this.getReadableDatabase();
        Cursor cursor_5 = dbase.rawQuery(selectQuery_5, null);
        // looping through all rows and adding to list
        if (cursor_5.moveToFirst()) {
            do {
                Question_5 quest_5 = new Question_5();
                quest_5.setID_5(cursor_5.getInt(0));
                quest_5.setQUESTION_5(cursor_5.getString(1));
                quest_5.setANSWER_5(cursor_5.getString(2));
                quest_5.setOPTA_5(cursor_5.getString(3));
                quest_5.setOPTB_5(cursor_5.getString(4));
                quest_5.setOPTC_5(cursor_5.getString(5));
                quest_5.setOPTD_5(cursor_5.getString(6));
                quesList_5.add(quest_5);
            } while (cursor_5.moveToNext());
        }
        cursor_5.close();
        // return quest list
        return quesList_5;
    }

    public List<Question_6> getAllQuestions_6() {
        List<Question_6> quesList_6 = new ArrayList<Question_6>();
        // Select All Query
        String selectQuery_6 = "SELECT  * FROM " + TABLE_QUEST_6;
        dbase = this.getReadableDatabase();
        Cursor cursor_6 = dbase.rawQuery(selectQuery_6, null);
        // looping through all rows and adding to list
        if (cursor_6.moveToFirst()) {
            do {
                Question_6 quest_6 = new Question_6();
                quest_6.setID_6(cursor_6.getInt(0));
                quest_6.setQUESTION_6(cursor_6.getString(1));
                quest_6.setANSWER_6(cursor_6.getString(2));
                quest_6.setOPTA_6(cursor_6.getString(3));
                quest_6.setOPTB_6(cursor_6.getString(4));
                quest_6.setOPTC_6(cursor_6.getString(5));
                quest_6.setOPTD_6(cursor_6.getString(6));
                quesList_6.add(quest_6);
            } while (cursor_6.moveToNext());
        }
        cursor_6.close();
        // return quest list
        return quesList_6;
    }

    public List<Question_7> getAllQuestions_7() {
        List<Question_7> quesList_7 = new ArrayList<Question_7>();
        // Select All Query
        String selectQuery_7 = "SELECT  * FROM " + TABLE_QUEST_7;
        dbase = this.getReadableDatabase();
        Cursor cursor_7 = dbase.rawQuery(selectQuery_7, null);
        // looping through all rows and adding to list
        if (cursor_7.moveToFirst()) {
            do {
                Question_7 quest_7 = new Question_7();
                quest_7.setID_7(cursor_7.getInt(0));
                quest_7.setQUESTION_7(cursor_7.getString(1));
                quest_7.setANSWER_7(cursor_7.getString(2));
                quest_7.setOPTA_7(cursor_7.getString(3));
                quest_7.setOPTB_7(cursor_7.getString(4));
                quest_7.setOPTC_7(cursor_7.getString(5));
                quest_7.setOPTD_7(cursor_7.getString(6));
                quesList_7.add(quest_7);
            } while (cursor_7.moveToNext());
        }
        cursor_7.close();
        // return quest list
        return quesList_7;
    }


    public int rowcount() {
        int row = 0;
        String selectQuery = "SELECT  * FROM " + TABLE_QUEST;
        SQLiteDatabase db = this.getWritableDatabase();
        Cursor cursor = db.rawQuery(selectQuery, null);
        row = cursor.getCount();
        cursor.close();
        return row;
    }

    public int rowcount_2() {
        int row_2 = 0;
        String selectQuery_2 = "SELECT  * FROM " + TABLE_QUEST_2;
        SQLiteDatabase db = this.getWritableDatabase();
        Cursor cursor_2 = db.rawQuery(selectQuery_2, null);
        row_2 = cursor_2.getCount();
        cursor_2.close();
        return row_2;
    }

    public int rowcount_3() {
        int row_3 = 0;
        String selectQuery_3 = "SELECT  * FROM " + TABLE_QUEST_3;
        SQLiteDatabase db = this.getWritableDatabase();
        Cursor cursor_3 = db.rawQuery(selectQuery_3, null);
        row_3 = cursor_3.getCount();
        cursor_3.close();
        return row_3;
    }

    public int rowcount_4() {
        int row_4 = 0;
        String selectQuery_4 = "SELECT  * FROM " + TABLE_QUEST_4;
        SQLiteDatabase db = this.getWritableDatabase();
        Cursor cursor_4 = db.rawQuery(selectQuery_4, null);
        row_4 = cursor_4.getCount();
        cursor_4.close();
        return row_4;
    }

    public int rowcount_5() {
        int row_5 = 0;
        String selectQuery_5 = "SELECT  * FROM " + TABLE_QUEST_5;
        SQLiteDatabase db = this.getWritableDatabase();
        Cursor cursor_5 = db.rawQuery(selectQuery_5, null);
        row_5 = cursor_5.getCount();
        cursor_5.close();
        return row_5;
    }

    public int rowcount_6() {
        int row_6 = 0;
        String selectQuery_6 = "SELECT  * FROM " + TABLE_QUEST_6;
        SQLiteDatabase db = this.getWritableDatabase();
        Cursor cursor_6 = db.rawQuery(selectQuery_6, null);
        row_6 = cursor_6.getCount();
        cursor_6.close();
        return row_6;
    }

    public int rowcount_7() {
        int row_7 = 0;
        String selectQuery_7 = "SELECT  * FROM " + TABLE_QUEST_7;
        SQLiteDatabase db = this.getWritableDatabase();
        Cursor cursor_7 = db.rawQuery(selectQuery_7, null);
        row_7 = cursor_7.getCount();
        cursor_7.close();
        return row_7;
    }


}
